[
  {
    "sequence": 0,
    "slug": "michael-saylor---strategy",
    "name": "Michael  Saylor",
    "title": "Founder & Executive Chairman",
    "company": "Strategy",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae228fa_4PlAFF3JOdRPDHzObJSTKvkuTeVJvB5NwYJPPplwiiA.webp",
    "biography": "Michael Saylor is the Executive Chairman of Strategy (MSTR), a publicly traded business intelligence firm & holder of ₿499,096 that he founded in 1989. He is also the founder of Alarm.com (ALRM), named inventor on 48+ patents, & author of the book “The Mobile Wave”. He founded the Saylor Academy (saylor.org), a non-profit that has provided free education to over 2 million students. He is an advocate for the Bitcoin Standard (hope.com) with dual degrees from MIT in Aerospace Engineering & History of Science. He posts his views on X @saylor and his website Michael.com. His 4 hour interview with Lex Fridman summarizes his thoughts on Bitcoin, Inflation, and the Future of Money with ~11 million views on YouTube.",
    "localImage": "avatars/mena-speakers/michael-saylor.webp"
  },
  {
    "sequence": 1,
    "slug": "cz---binance",
    "name": "CZ",
    "title": "Founder",
    "company": "Binance",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69138f18c094c785ffbd8660_c0TEIkeM5XowLsNdtAKkQPOcKukd-xSN-5WaYE09P6A.webp",
    "biography": "Founder of Binance",
    "localImage": "avatars/mena-speakers/cz.webp"
  },
  {
    "sequence": 2,
    "slug": "michael-novogratz---galaxy",
    "name": "Michael Novogratz",
    "title": "CEO and Founder",
    "company": "Galaxy",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691ca1254f7c48b0f5c14477_54DLlVI0tw5YHsVzx6f1nTRsK7xch8QARDkM95uRcMo.webp",
    "biography": "Michael Novogratz is the Founder and CEO of Galaxy Digital. He was formerly a Partner and President of Fortress Investment Group LLC. Prior to Fortress, Mr. Novogratz spent 11 years at Goldman Sachs, where he was elected Partner in 1998. Mr. Novogratz served on the New York Federal Reserve’s Investment Advisory Committee on Financial Markets from 2012 – 2015. Mr. Novogratz serves as the Chairman of The Bail Project and has made criminal justice reform a focus of his family’s foundation. He also sits on the Board of Overseers at NYU Langone Medical Center and is a board member of Princeton Varsity Club and Jazz Foundation of America. Mr. Novogratz received an AB in Economics from Princeton University and served as a helicopter pilot in the US Army.",
    "localImage": "avatars/mena-speakers/michael-novogratz.webp"
  },
  {
    "sequence": 3,
    "slug": "h-e-dr-mohamed-al-kuwaiti---cyber-security-council",
    "name": "H.E. Dr. Mohamed Al Kuwaiti",
    "title": "Head of Cyber Security, United Arab Emirates Government",
    "company": "Cyber Security Council",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c95507ab2f8549b67f3f_g7pe98-QdKpf9BpPC5_Re5PLqsRuspweuNcWW32XzCE.webp",
    "biography": "H.E. Dr. Mohamed Al Kuwaiti is the Head of Cyber Security for the UAE Government and leads the UAE Cyber Security Council. He oversees the national cybersecurity strategy, resilience programs, and major initiatives that positioned the UAE among the top-ranked countries in the ITU Global Cybersecurity Index 2024. He also serves as Managing Director of the National Data Center and plays key international roles, including Co-Chair of the Counter Ransomware Initiative and Vice Chair of OIC-CERT. Dr. Al Kuwaiti has over 20 years of experience in national security and has spoken at more than 50 global events. He holds a Ph.D. in Computer Engineering and Network Security from George Washington University.",
    "localImage": "avatars/mena-speakers/h-e-dr-mohamed-al-kuwaiti.webp"
  },
  {
    "sequence": 4,
    "slug": "paul-manafort---trump-for-president-2016",
    "name": "Paul Manafort",
    "title": "Former Campaign Manager",
    "company": "Trump for President, 2016",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c929debfe8592c795216_sOVlT7607htPoYD4BraIcHlb2ZLdn8LsdisOeeFjAEk.webp",
    "biography": "Paul Manafort is a seasoned political strategist and consultant with decades of experience in navigating complex geopolitical landscapes. As a former chairman of a major U.S. presidential campaign, he has a deep understanding of the intersection between politics, economics, and emerging technologies. In recent years, Paul has taken a keen interest in the potential of Bitcoin and blockchain technology to transform the global financial system. He brings a unique perspective on the role of cryptocurrency in fostering financial independence and decentralization. Paul’s insights offer a valuable blend of traditional financial expertise and a forward-looking view on the disruptive power of digital assets, making him a compelling voice at the forefront of the Bitcoin revolution.",
    "localImage": "avatars/mena-speakers/paul-manafort.webp"
  },
  {
    "sequence": 5,
    "slug": "ahmed-bin-sulayem---dmcc",
    "name": "Ahmed Bin Sulayem",
    "title": "Executive Chairman & CEO",
    "company": "DMCC",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69138e378f6085cb8a0b64ae_d15e1f6ba7c78bf695cb19a6.webp",
    "biography": "Ahmed Bin Sulayem is the Executive Chairman and Chief Executive Officer of DMCC and has driven its growth from a start-up of 28 member companies in 2003 to the world’s leading international business district in 2025 with over 25,000 member companies from 180 countries, employing over 80,000 people.Tasked with enhancing commodity trade flows through Dubai, DMCC has introduced to the market a number of value-added products and services under Mr Bin Sulayem’s leadership. In 2023, DMCC was named ‘Global Free Zone of the Year’ by The Financial Times fDi Magazine, for a record ninth consecutive year.Mr Bin Sulayem oversaw the exponential growth of the DMCC Free Zone master development in Jumeirah Lakes Towers (JLT), a 200-hectare business and residential community in Dubai of over 100,000 people living and working in 87 towers. Mr Bin Sulayem also oversees the development of DMCC’s latest real estate project, the Uptown Dubai district.Mr Bin Sulayem currently serves as the Chairman of the Dubai Diamond Exchange (DDE) and the Dubai Gold & Commodities Exchange (DGCX).The Kimberley Process officially appointed the United Arab Emirates (UAE) as the first and only Arab country to Chair the Kimberley Process (KP) in November 2015. Shortly after, the UAE Ministry of Economy officially appointed Mr Bin Sulayem as the UAE’s Chair of the KP for 2016. Mr Bin Sulayem was reappointed Chair of the KP for a historic second time in 2024 and has continued his leadership role with the position of Custodian Chair of the KP in 2025.CV – DMCC• 2001 – Joined DMCC• 2002 – Appointed Chief Operating Officer (COO)• 2007 – Appointed Executive Chairman• 2019 – Appointed Chief Executive Officer (CEO)",
    "localImage": "avatars/mena-speakers/ahmed-bin-sulayem.webp"
  },
  {
    "sequence": 6,
    "slug": "simon-dixon---bnktothefuture-com",
    "name": "Simon Dixon",
    "title": "CEO & Co-Founder",
    "company": "BnkToTheFuture.com",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6900c3bd887c880bb611ed95_6a3dbaf2a45dea3799bd678e.webp",
    "biography": "Simon Dixon has always considered himself a finance geek—obsessed with banking, monetary reform and geo-financial analysis that shape our world. After building a career as an insider in investment banking—as a stockbroker, market maker, and corporate finance banker—he developed a rare understanding of how the financial system really works. But when his father lost everything in the dot-com bust, Simon left his lucrative career behind to become a monetary reformer, determined not just to expose the flaws of finance but to fix them.That mission led him to Bitcoin when it was just $3—a moment that changed everything. Unlike most early adopters who were tech enthusiasts, Simon came from finance, and he decoded what Satoshi left behind: Bitcoin was not just money, but the tool that could end the corrupt financial system, dismantle the Federal Reserve, and strip power from those who abuse it. He saw how politicians and regulators would deliberately co-opt innovation to maintain control—something he experienced first-hand when his attempts to reform the UK banking system were blocked.With that foresight, Simon gained financial freedom through Bitcoin and became one of the earliest investors in the industry’s biggest names—including Coinbase, Kraken, BitPay, Bitfinex, Blockchain.com, Circle and Robinhood. He is also the author of *Bank to the Future* (2012), the world’s first published book to ever discuss Bitcoin.Recognized by Robert Kiyosaki as “the first guy to ever talk about Bitcoin,” praised by Richard Branson for his investment platform BnkToTheFuture.com, and called by Max Keiser “the No.1 Bitcoin investment banker ever,” Simon has long been ahead of his time. Through BnkToTheFuture, he has facilitated over $2.5 billion of investments into companies that shaped the Bitcoin ecosystem.He has helped thousands become Bitcoin millionaires and billionaires—and now seeks to help millions more protect themselves, their families, and their nations from an AI-driven jobless future and the oppressive control of central bank digital currencies (CBDCs)—with Bitcoin as the tool for freedom and protection.Simon is widely recognized not only for his pioneering role in Bitcoin but also for his expertise in geo-financial analysis, money, and investing. His ability to connect Bitcoin, macroeconomics, and global financial power shifts has allowed him to anticipate trends and events years before they unfold—making him the person many influencers and analysts quietly study.Through his weekly show BitcoinHardTalk (100k+ YouTube subscribers, 200k+ followers on X), Simon helps people follow the money, self-custody their Bitcoin, and resist an oppressive financial system whose time is running out.",
    "localImage": "avatars/mena-speakers/simon-dixon.webp"
  },
  {
    "sequence": 7,
    "slug": "abdulla-al-dhaheri---the-blockchain-center-abu-dhabi",
    "name": "Abdulla Al Dhaheri",
    "title": "CEO",
    "company": "The Blockchain Center Abu Dhabi",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c8e0c5e7a5122094b645_WSwuHtTtu9z8-Zn2tCk_aUGu4uZ7K-feNMzkQC95lno.webp",
    "biography": "Abdulla Al Dhaheri is the CEO of The Blockchain Center Abu Dhabi, leading the UAE’s flagship hub for digital asset innovation. He has played an instrumental role in bringing tier-1 global exchanges and market makers to Abu Dhabi, collaborating closely with regulators and sovereign stakeholders to build the UAE’s leadership in digital assets, AI, and tokenized finance. Abdulla previously advised multi-billion-dollar companies on public listings and digital asset adoption, and has been invited to speak at global conferences for his contributions to decentralized technologies. Today, he continues to invest strategically through The Blockchain Center Fund, scaling global digital asset ventures and sovereign-grade digital asset infrastructures from Abu Dhabi to the world.",
    "localImage": "avatars/mena-speakers/abdulla-al-dhaheri.webp"
  },
  {
    "sequence": 8,
    "slug": "saifedean-ammous---saifedean-com",
    "name": "Saifedean Ammous",
    "title": "Author",
    "company": "Saifedean.com",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d7fa920a9a1abc0c2d5_597bc93262550160e15fefb3.webp",
    "biography": "Saifedean is an economist and the author of the best-selling book, The Bitcoin Standard. as well as The Fiat Standard, The Gold Standard, and Principles of Economics. He teaches economics on his online learning platform saifedean.com and hosts The Bitcoin Standard Podcast.",
    "localImage": "avatars/mena-speakers/saifedean-ammous.webp"
  },
  {
    "sequence": 9,
    "slug": "john-koudounis---calamos-investments",
    "name": "John Koudounis",
    "title": "President and CEO",
    "company": "Calamos Investments",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad6a77208e786f90fb41_7p7_usM5fYNHy6XgsxWJSbaNQa_w0AVzoQGs0CuFHyc.webp",
    "biography": "John Koudounis serves as the President and CEO of Calamos Investments, the third largest liquid alternatives asset manager in the US. Under his leadership, the firm’s AUM has surged to over $46 billion, nearly tripling since he took the helm in 2016. Notably, he has overseen the launch of innovative products, including the world's first suite of downside-protected Bitcoin ETFs.With over 37 years of experience in the financial services sector, he previously held the position of President and CEO at Mizuho Securities in the Americas, where he significantly expanded the firm's capital markets teams and enhanced profitability, client base, and product diversity, elevating Mizuho to a top-tier global investment bank.In addition to his corporate responsibilities, Koudounis is recognized for his thought leadership, frequently speaking at global conferences and platforms such as CNBC, Fox Business, and Bloomberg TV. Koudounis is committed to philanthropy and is involved with several organizations including the Concordia Leadership Council, the SEAL Future Foundation, The Hellenic Initiative, and the Ecumenical Bartholomew Foundation.He holds a degree in International Diplomacy & Foreign Affairs and Economics from Brown University.",
    "localImage": "avatars/mena-speakers/john-koudounis.webp"
  },
  {
    "sequence": 10,
    "slug": "marwan-al-zarouni---dubai-blockchain-center-dbcc",
    "name": "Marwan Al Zarouni",
    "title": "CEO",
    "company": "Dubai Blockchain Center (DBCC).",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6900c3c39d2d90269fda5731_xSLLAx1Qkv4ykdRGOXrMVOgy3c2EENIhmyFUqAJlmOE.webp",
    "biography": "Dr. Marwan Al Zarouni is a global Bitcoin and blockchain advocate driving Dubai’s digital innovation agenda. As CEO of the Dubai Blockchain Center, he has led regional efforts in Bitcoin education, adoption, and policy development. Recognized among CoinTelegraph’s Top 100 Most Influential Figures in Blockchain and Cryptocurrencies (2022), he also served on the World Economic Forum’s Global Future Council on Cryptocurrencies. Through his leadership, Dr. Al Zarouni continues to position Dubai as a global hub for blockchain and Bitcoin innovation.",
    "localImage": "avatars/mena-speakers/marwan-al-zarouni.webp"
  },
  {
    "sequence": 11,
    "slug": "bilal-bin-saqib---minister-of-state-for-blockchain-and-crypto-in-pakistan",
    "name": "Bilal  Bin Saqib",
    "title": "CEO",
    "company": "Minister of State for Blockchain and Crypto in Pakistan",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b638dc64b755698d9ae6_qsdS-KB65viPckYvQGgB_E-Mqvs8l3rRXfhKlKclFZI.webp",
    "biography": "Bilal Bin Saqib is the CEO of the Pakistan Crypto Council, a government-backed advisory body accelerating crypto regulation and driving innovation across Pakistan’s digital asset landscape. He also serves as Chief Advisor to the Finance Minister of Pakistan.Named in Forbes 30 Under 30 and honored as a Member of the British Empire by King Charles III, Bilal is a force where conviction meets code. With ventures across Web2 and Web3, and a social media following of over 700,000, he’s part builder, part crypto diplomat — using Bitcoin not just as a technology, but as a tool for economic independence and, financial inclusion. Additionally, Bilal is also an advisor to the Trump-family backed DeFi project, World Liberty Financial.",
    "localImage": "avatars/mena-speakers/bilal-bin-saqib.webp"
  },
  {
    "sequence": 12,
    "slug": "aaron-van-wirdum---bitcoin-magazine",
    "name": "Aaron  van Wirdum",
    "title": "",
    "company": "Bitcoin Magazine",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68a7722442ecf3c5645d1357_6ebd2291b174cef8fc57a92d.webp",
    "biography": "Aaron van Wirdum is the technical editor for Bitcoin Magazine and the cohost of the Bitcoin, Explained podcast. With a background in studying the historical influence of society-shaping technologies, he’s been covering Bitcoin and related projects since 2013. He is known for his ability to explain highly-technical subjects to a layman audience and specializes in topics including Bitcoin’s history, scaling and privacy technology.",
    "localImage": "avatars/mena-speakers/aaron-van-wirdum.webp"
  },
  {
    "sequence": 13,
    "slug": "aaron-daniel---resolvr",
    "name": "Aaron Daniel",
    "title": "Co-founder",
    "company": "Resolvr",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6902797f70c9cd59bf3eb2ab_ldXo9g0oJ1Bxr-0EZRtLZjyXLUW6uKkx_H4mWU8aa3s.webp",
    "biography": "Cofounder of Resolvr, an insurtech bridging the global insurance market to Bitcoin. Published author for Bitcoin Magazine and the Satoshi Papers.",
    "localImage": "avatars/mena-speakers/aaron-daniel.webp"
  },
  {
    "sequence": 14,
    "slug": "abderrahman-ghiadi---emcd",
    "name": "Abderrahman Ghiadi",
    "title": "Head of Mining Pool (MENA)",
    "company": "EMCD",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68cd6a08f0812abbb58892b9_hk7AA_X8wQfEbg3HFsc4zCj4hG0zQ2ulCWbKA_ShCkU.webp",
    "biography": "10+ years' background in Investments / Bitcoin mining for HNWIs & Institutions. He is also conducting research as a PhD researcher in Economics focusing on Bitcoin, Bitcoin mining, and Energy Economics using stranded or curtailed energy sources, and the development of competitive mining pool services for medium-size to large miners in the MEA region",
    "localImage": "avatars/mena-speakers/abderrahman-ghiadi.webp"
  },
  {
    "sequence": 15,
    "slug": "abdumalik-mirakhmedov---gda",
    "name": "Abdumalik Mirakhmedov",
    "title": "Executive President",
    "company": "GDA",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68cd6a08f0812abbb58892b6_68QsRv_jIWk8KuJfIOsEQVC-Fb54n2fw7Yt4gFcu05I.webp",
    "biography": "Abdumalik Mirakhmedov is Executive President of GDA, one of the world’s largest and most experienced Bitcoin mining companies, with a track record of building, managing, and scaling data center operations spanning nearly a decade.GDA champions innovation, responsible energy use, and investment in the communities where it operates globally, including 20 data centres across North America, South America, Europe, and Central Asia.With a total power capacity of over 600 MW, the company has brought over 180,000 miners online. GDA is committed to supporting the infrastructure for the future of money by making the bitcoin network more robust, resilient, and secure.",
    "localImage": "avatars/mena-speakers/abdumalik-mirakhmedov.webp"
  },
  {
    "sequence": 16,
    "slug": "abu-akkuc---21million-fashion-orange-elite",
    "name": "Abu Akkuc",
    "title": "Founder & Creative Director",
    "company": "21Million Fashion | Orange Elite",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c2e69ff4851defb4062164_ikTz8ByLhibTjqyd3G89SI1fdoLYATIYNU_NvsykM6s.webp",
    "biography": "Abu Akkuc is the founder and Creative Director of 21Million Fashion (Bitcoin fashion brand). With his brand, he demonstrates that Bitcoin is far more than a financial instrument – it is a cultural movement that inspires a new way of thinking. His collections carry the spirit of “Proof of Work”: discipline, perseverance, and authenticity are reflected in every detail. For him, fashion becomes a medium that makes freedom, independence, and creativity tangible.Under the umbrella of 21Million Fashion, Abu has also created a high-fashion subbrand, Orange Elite, which combines the highest quality standards with elegance and the rebellious energy of Bitcoin.Beyond his role as an entrepreneur, Abu is deeply committed to promoting Bitcoin education. He conveys the cultural, social, and philosophical dimensions of Bitcoin, making it clear that it’s not just about money, but about a new understanding of responsibility and self-determination. His work blends style with substance, showing how Bitcoin is shaping our culture and mindset in lasting ways.",
    "localImage": "avatars/mena-speakers/abu-akkuc.webp"
  },
  {
    "sequence": 17,
    "slug": "adam-haynes---simple-mining",
    "name": "Adam Haynes",
    "title": "Founder & CEO",
    "company": "Simple Mining",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691d2b6d669f6f49c9c3cba1_KrAPMWnFZIz7JYjxEeqWljn-g-PDC-CzqsodKW-tBIM.webp",
    "biography": "Founder & CEO of Simple Mining. We sell, host, and repair Bitcoin miners with the goal of making Bitcoin mining simple, accessible, and profitable for everyone.",
    "localImage": "avatars/mena-speakers/adam-haynes.webp"
  },
  {
    "sequence": 18,
    "slug": "adam-o-brien---bitcoin-well",
    "name": "Adam O'Brien",
    "title": "Founder and CEO",
    "company": "Bitcoin Well",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae22910_mlvcMjU7lRHxF5uY_WvIGRlPXYi5NbryJDq5U50NIEE.webp",
    "biography": "Adam is a husband, father of four and a bitcoin entrepreneur on a mission to enable independence. Since founding Bitcoin Well in 2013, Adam has made it easy to buy, sell and use bitcoin both online in the bitcoin-only portal, and in person at Bitcoin ATMs across Canada. Today, Bitcoin Well is a publicly traded organization (BTCW)",
    "localImage": "avatars/mena-speakers/adam-o-brien.webp"
  },
  {
    "sequence": 19,
    "slug": "adam-schneider---la-boulangerie-by-vulpes",
    "name": "Adam Schneider",
    "title": "CEO",
    "company": "La Boulangerie By Vulpes",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fa401e27e0f1b13c012_88e216e7a00b420e7c5154be.webp",
    "biography": "Adam Schneider, better known as “Seccour,” is a prominent figure in the Bitcoin community, especially in the UAE. He discovered Bitcoin in December 2012 at the age of 16, while still in high school. Having lived in Dubai since 2010, Seccour later pursued cybersecurity studies at university, which deepened his understanding of Bitcoin’s underlying technology.Since 2017, he has organized the Dubai Bitcoin Meetup, fostering a community dedicated to learning about and engaging with Bitcoin. His work focuses on advocating for Bitcoin in the UAE and developing tools that contribute to the evolving Bitcoin landscape.",
    "localImage": "avatars/mena-speakers/adam-schneider.webp"
  },
  {
    "sequence": 20,
    "slug": "alain-kunz---gsr",
    "name": "Alain Kunz",
    "title": "MD, Head of Business Development",
    "company": "GSR",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d742752443e303c5ce8_iTcRfTNndzdPdoNTBbLLh2vc_WfBpEl88WicijKhTLE.webp",
    "biography": "Alain Kunz is a Managing Director at GSR, where he leads Business Development for the firm - a global leader in digital asset trading and market structure, and a key capital markets partner to the crypto industry.Prior to joining GSR, Mr. Kunz founded several ventures in the financial services and digital asset sectors. He has also advised public and private institutions, political leaders, and high-net-worth individuals, focusing on the intersection of innovation, finance, technology, and societal impact.Mr. Kunz began his career at UBS Investment Bank after graduating from the University of St. Gallen (HSG). His career reflects a consistent commitment to bridging traditional finance and emerging technologies in an increasingly digital economy.",
    "localImage": "avatars/mena-speakers/alain-kunz.webp"
  },
  {
    "sequence": 21,
    "slug": "alan-lane---silvergate-bank",
    "name": "Alan Lane",
    "title": "Advisor",
    "company": "Unchained",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea66ebf8c5d21bce9cb3e_5MAWk4yVjJ6xjTlLckj7yujxd2YbQc5pzjZZ1-I5pX0.webp",
    "biography": "Former CEO of Silvergate Bank. Silvergate began banking the bitcoin industry in 2014.",
    "localImage": "avatars/mena-speakers/alan-lane.webp"
  },
  {
    "sequence": 22,
    "slug": "alejandro-de-la-torre---dmnd",
    "name": "Alejandro de la Torre",
    "title": "CEO & Co-Founder",
    "company": "DMND",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c929debfe8592c795207_XKMdp2PeEn3CFmu2a-iaMMJqJCmJS_qSEhxiz-zpGgc.webp",
    "biography": "Former VP & Co-Founder of BTC.com & Poolin bitcoin mining pools. Activated Taproot via miner-activated-softfork. 10 + years in bitcoin mining. Currently CEO & Co-Founder of DMND the first fully StratumV2 Bitcoin Mining Pool.",
    "localImage": "avatars/mena-speakers/alejandro-de-la-torre.webp"
  },
  {
    "sequence": 23,
    "slug": "aleksandar-svetski---satlantis",
    "name": "Aleksandar Svetski",
    "title": "Founder CEO",
    "company": "Satlantis",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae228f7_M_BJj5lV41k3h_dgG9NCXKwjEkS81VJkK0iiQmt0gcM.webp",
    "biography": "Alex Svetski is an Author and Entrepreneur.Aleksandar is the Author of the best selling “UnCommunist Manifesto” and the \"Bushido of Bitcoin”. He is building the Nostr-enabled Social Network for Sovereign Individuals: Satlantis.ioPreviously, he launched the world’s first Bitcoin-only savings app: Amber, and open sourced The Spirit of Satoshi, a Bitcoin-centric LLM.",
    "localImage": "avatars/mena-speakers/aleksandar-svetski.webp"
  },
  {
    "sequence": 24,
    "slug": "alex-bodromian---luminx",
    "name": "Alex Bodromian",
    "title": "Chief Operating Officer",
    "company": "LuminX",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a8454ad57c15bd297ef_SsfnNt4sqPLWtYaVTxOY4Rhspylemsh167rsY2MW5js.webp",
    "biography": "Alex is a seasoned professional in the financial services industry with a proven track record in business development, client relationship management, and strategic planning. His expertise lies in driving growth and delivering exceptional value to clients.",
    "localImage": "avatars/mena-speakers/alex-bodromian.webp"
  },
  {
    "sequence": 25,
    "slug": "alex-recouso---citizenx",
    "name": "Alex Recouso",
    "title": "Co-founder & CEO",
    "company": "CitizenX",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea6996b6d1481cef4e8df_B_YgvVtEDxDW76zbekn9QptEVfbwzt_m9kkzJ2ZdgNk.webp",
    "biography": "Alex Recouso is the co-founder and CEO of CitizenX, the world's first citizenship market. CitizenX has assisted countless Bitcoiners and their families in diversifying their passport portfolios, providing greater optionality, sovereignty, and freedom. He also advises nation-states on designing and implementing citizenship and residency programs to accumulate Bitcoin in budget-neutral ways.",
    "localImage": "avatars/mena-speakers/alex-recouso.webp"
  },
  {
    "sequence": 26,
    "slug": "alexander-neumueller---cambridge-judge-business-school-univeristy-of-cambridge",
    "name": "Alexander Neumüller",
    "title": "Research Associate",
    "company": "Cambridge Judge Business School, Univeristy of Cambridge",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c96892900a15228a1d7077_d663dd272d5b69b991b90f1a.webp",
    "biography": "Alexander is a Research Associate at the Cambridge Centre for Alternative Finance (CCAF), where he leads the Cambridge Digital Assets Programme’s research efforts on the climate impact of digital assets. Drawing on extensive practical experience within the crypto ecosystem – from cryptocurrency mining to engaging with DeFi protocols – he brings deep domain expertise to his work. Prior to joining the CCAF, Alexander held various roles in traditional finance, including corporate banking, proprietary trading, and asset management. He holds a Master’s degree in Finance from Cambridge Judge Business School, University of Cambridge, and an MBA from Johannes Kepler Universität Linz. Alexander is widely regarded as an expert on the environmental footprint of cryptocurrency mining, and his insights are frequently featured in leading media outlets such as Bloomberg, Fox News, Reuters, and The Financial Times.",
    "localImage": "avatars/mena-speakers/alexander-neum-ller.webp"
  },
  {
    "sequence": 27,
    "slug": "alexander-sayegh---miningrid-llc",
    "name": "Alexander Sayegh",
    "title": "Co-Founder & CTO",
    "company": "Mining Grid",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa481eac3cef80db52e1__lYz8WaJEDNMExAD6joQLEGi-qC0v5r-h-2AN8Y_yfM.webp",
    "biography": "An early advocate for Blockchain technology and Bitcoin specifically, focusing on spreading the knowledge, sharing expertise and providing technical consulting, I've made Bitcoin and Blockchain my career for a good reason, I have a lot to contribute to it, the skill to teach people about it and the technical depth of advising on strategy, technology and integration with rest of the world.With my deep technical foundation and a strong belief in Bitcoin’s transformative potential, I focus on building scalable mining and cloud solutions that empower individuals and enterprises alike.",
    "localImage": "avatars/mena-speakers/alexander-sayegh.webp"
  },
  {
    "sequence": 28,
    "slug": "alexandre-laizet---capital-b",
    "name": "Alexandre Laizet",
    "title": "Board Director of Bitcoin Strategy",
    "company": "Capital B",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/692a5fc8dacb2be474726207_b69706f6f52ddc63a810536b.webp",
    "biography": "Alexandre is Board Member and Director of Bitcoin Strategy at Capital B, Europe’s first Bitcoin Treasury Company. Alexandre is a committed Bitcoin maximalist.",
    "localImage": "avatars/mena-speakers/alexandre-laizet.webp"
  },
  {
    "sequence": 29,
    "slug": "ali-alnuaimi---shafra",
    "name": "Ali Alnuaimi",
    "title": "Founder",
    "company": "Shafra",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691c8398212add11b5e2d63d_nJrpQRH_AkWQBpTvAYye1iOCt6nrhr_UdTzo96g7uCw.webp",
    "biography": "Ali Alnuaimi founded Shafra and stands at the crossroads of energy, technology, and digital assets in the UAE. Once a nuclear engineer who launched the nation's first reactor and sat on the UAE Space Agency board, he left the public sector to advance Bitcoin as a strategic energy play. Today he counsels government leaders, sovereign wealth funds, and giants such as MARA on Bitcoin policy, energy efficiency, and industrial-scale mining. A founding adviser to the Sui protocol and partner to several others, he channels deep expertise and wide connections to unite government, legacy industries, and emerging AI-driven tech, securing lasting value through intellectual, political, and financial capital.",
    "localImage": "avatars/mena-speakers/ali-alnuaimi.webp"
  },
  {
    "sequence": 30,
    "slug": "alisia-painter---botanix-labs",
    "name": "Alisia Painter",
    "title": "Co-Founder and COO",
    "company": "Botanix Labs",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f15121c5ee0abd6b503296_lrrpPvFeDFmzz4wFbsiv2eTF4vIl4rmKhfDtSC7efrQ.webp",
    "biography": "Alisia Painter is the COO and Co-Founder of Botanix Labs, the team behind Botanix, the Bitcoin-based blockchain unlocking Bitcoin Finance. With over a decade of experience in Ethereum and an MBA from Harvard Business School, Alisia is a Bitcoiner at heart, focused on expanding Bitcoin’s programmability and bringing yield-bearing assets like stBTC to market.She has been featured in CNBC, Forbes, Schwab Network, Kitco News, and CoinDesk TV, sharing insights on Bitcoin’s evolution from digital gold to financial infrastructure, and regularly speaks at leading industry conferences on the future of decentralized finance and institutional adoption.",
    "localImage": "avatars/mena-speakers/alisia-painter.webp"
  },
  {
    "sequence": 31,
    "slug": "allen-farrington---flux",
    "name": "Allen Farrington",
    "title": "CEO",
    "company": "Flux",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c91398b6b62f77c38c15_GZxxOj8PzT2BVqBke_Cos7_hO0lLwbasX71SU4oOfbw.webp",
    "biography": "Writer and Investor, coauthor of Bitcoin Is Venice and Only The Strong Survive, cofounder and General Partner at Axiom, cofounder and CEO at Flux",
    "localImage": "avatars/mena-speakers/allen-farrington.webp"
  },
  {
    "sequence": 32,
    "slug": "allen-helm---btc-inc-bitcoin-for-corporations",
    "name": "Allen Helm",
    "title": "Director of Business Development",
    "company": "BTC Inc, Bitcoin for Corporations",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05dbcef52f00403b35ba_PHOMrfxlw2wqqf-ojQaMaYK01xyTGZVVbfs7ZZbyGME.webp",
    "biography": "Allen Helm co-founded Bitcoin for Corporations (BFC) in 2024, a joint initiative between Strategy (formerly MicroStrategy) and BTC Inc., where he now serves as Director of Business Development & Client Services. He leads product execution, client success, and business development, working with corporate treasuries, service providers, and capital allocators to accelerate global Bitcoin adoption.Previously, he scaled enterprise partnerships at Bitcoin Magazine and The Bitcoin Conference.",
    "localImage": "avatars/mena-speakers/allen-helm.webp"
  },
  {
    "sequence": 33,
    "slug": "alphonse-mehounme---flash",
    "name": "Alphonse Mehounme",
    "title": "CEO",
    "company": "Flash",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6914aa417d46b579bee42714_a2d92603e2f74e7944e33ec5.webp",
    "biography": "Alphonse is Co-founder and CEO of Flash, a platform that is helping people in Francophone Africa access Bitcoin easily and opt out of fiat. He also contributes to Bitcoin education through local initiatives and participate in conferences to share insights.",
    "localImage": "avatars/mena-speakers/alphonse-mehounme.webp"
  },
  {
    "sequence": 34,
    "slug": "andrej-majcen---bitcoin-suisse-ag",
    "name": "Andrej Majcen",
    "title": "Group CEO & Co-Founder",
    "company": "Bitcoin Suisse AG",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6900fed802842471d227f6a3_835b9326ae343811144de631.webp",
    "biography": "Andrej Majcen is the Co-Founder and Group Chief Executive Officer of Bitcoin Suisse, Switzerland’s leading and longest-established crypto-financial services firm. He co-founded the company in 2013, when Bitcoin was still nascent and Ethereum had yet to launch, and has since guided its growth into a major international brand—Switzerland’s largest custodian and one of the world’s foremost staking operators.Over the past decade, Andrej has held several senior leadership roles at Bitcoin Suisse, including Head of Global Expansion and Strategic Clients, before being appointed Group CEO in 2024. In recognition of his contributions to the blockchain and fintech industry, he was named to the Forbes 30 Under 30 DACH list in 2020.A frequent speaker at blockchain and finance conferences around the world, Andrej is a strong advocate for the transformative potential of digital assets to build a more inclusive, efficient, and resilient global economy.",
    "localImage": "avatars/mena-speakers/andrej-majcen.webp"
  },
  {
    "sequence": 35,
    "slug": "andrew-hohns---battery-finance",
    "name": "Andrew Hohns",
    "title": "CEO",
    "company": "Battery Finance",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c8ea98b6b62f77c370f2_FY72ds5-juFGNygsfERidExtasYywH5ZTtKTLB4vLDM.webp",
    "biography": "Andrew Hohns, PhD., Founder & Chief Executive Officer. Dr. Hohns founded Newmarket in 2020 and Battery Finance in 2022. He has overseen transaction structuring for approximately $50 billion of notional risk transfer. He has been a regular speaker at various industry conferences, with expertise in topics related to securitization, bitcoin, socially responsible investment, impact investment, infrastructure, and development finance. Prior to founding Newmarket, Dr. Hohns served as Managing Director at Mariner Investment Group from 2012 through 2020 and as Managing Director at Cohen & Company until 2012. Additionally, Dr. Hohns was an Adjunct Assistant Professor at New York University’s Stern School of Business from 2012 to 2015. He holds a BS in Economics from the Wharton School at the University of Pennsylvania (2000), a Masters in Liberal Arts from the School of Arts and Sciences at the University of Pennsylvania (2006), and a PhD in Applied Economics and Managerial Sciences from the Wharton School at the University of Pennsylvania (2012). Dr. Hohns is a member of the Board of Directors of Fold Holdings Group (NASDAQ:FLD), Bitcoin Development Corporation, Inc (NASDAQ: BDCIU), and UNICEF USA.",
    "localImage": "avatars/mena-speakers/andrew-hohns.webp"
  },
  {
    "sequence": 36,
    "slug": "andrew-vjranes---blockdaemon",
    "name": "Andrew Vranjes",
    "title": "Chief Revenue Officer",
    "company": "Blockdaemon",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911fdde8f909637df331e0e_20mDmpOMnOh3xkbDVFZzOs0eUq01cFw7yn9WnwvzFYI.webp",
    "biography": "Andrew is driving Blockdaemon’s global growth strategy as Chief Revenue Officer (CRO). In this role, he is responsible for driving and aligning all revenue generating processes across the organization. Previously, Andrew was VP and GM at APAC, where he has successfully led regional growth, forged strategic partnerships, and expanded market presence in the Asia Pacific Region. Prior to joining Blockdaemon, Andrew has held leadership roles in Amazon Web Services (AWS), Cisco Systems and Singtel/Optus. In AWS, Andrew built out the teams focussed on Startups, Digital Natives, Crypto/Fintech and AWS’s partnerships with the Venture Capital and Private Equity community. In Cisco, Andrew led sales and Business Development for several acquisitions and internally built software solutions, most notably the GTM in APAC for an acquisition, tail-f systems. In Optus Business, Andrew led and owned the P&L for the Data Centre and Cloud Practice.",
    "localImage": "avatars/mena-speakers/andrew-vranjes.webp"
  },
  {
    "sequence": 37,
    "slug": "anish-shivdasani---roland-berger",
    "name": "Anish Shivdasani",
    "title": "Head of Digital Assets",
    "company": "Roland Berger",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a9325834804b3e0608d_ywQcxTRkj5LivLrStQoL9OqqQw6gPJSiBRxt7HS9iVs.webp",
    "biography": "Dr Anish Shivdasani is Head of Digital Assets at Roland Berger, where he has advised exchanges, banks, bitcoin mines and sovereign wealth funds on a range of strategic matters",
    "localImage": "avatars/mena-speakers/anish-shivdasani.webp"
  },
  {
    "sequence": 38,
    "slug": "anthony-scaramucci---skybridge-capital",
    "name": "Anthony Scaramucci",
    "title": "Founder and Managing Partner",
    "company": "SkyBridge Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a8454ad57c15bd297f2_dIiUazuXW-pkr59Jt3NTI__6vEwpSZim_rFk2kKj0D0.webp",
    "biography": "Anthony Scaramucci is the founder and managing partner of SkyBridge, a global alternative investment firm, and founder and chairman of SALT, a global thought leadership forum and venture studio.He is co-host of two podcasts, “The Rest Is Politics US” and “Open Book,” and author of six books, including most recently “The Little Book of Bitcoin.”Prior to founding SkyBridge in 2005, Scaramucci co-founded investment partnership Oscar Capital Management, which was sold to Neuberger Berman in 2001. Earlier, he worked in Private Wealth Management at Goldman Sachs & Co.In 2022, Scaramucci was ranked #47 in Cointelegraph’s Top 100 Influencers in Crypto and Blockchain. In 2016, he was ranked #85 in Worth Magazine’s Power 100: The 100 Most Powerful People in Global Finance. In 2011, he received Ernst & Young’s New York Financial Services “Entrepreneur of the Year” Award and is a member of the Council on Foreign Relations (CFR).Scaramucci served on President Donald J. Trump’s Presidential Transition Team Executive Committee in 2016 before serving briefly as White House Communications Director.Scaramucci, a native of Long Island, New York, holds a Bachelor of Arts degree in Economics from Tufts University and a Juris Doctor from Harvard Law School.",
    "localImage": "avatars/mena-speakers/anthony-scaramucci.webp"
  },
  {
    "sequence": 39,
    "slug": "areeb-ahmad---tlp-advisors",
    "name": "Areeb Ahmad",
    "title": "Senior Associate",
    "company": "TLP Advisors",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6914acc711d81744b9e23ab7_BlfQ9UvoG88kLibJLMi29s32HH-Zh-TbEpTyNhBpLOw.webp",
    "biography": "Areeb Ahmad tells the story of Bitcoin through the lens of law, power, and technology. Based in Dubai, he advises crypto exchanges and fintechs on licensing and compliance, while questioning how institutions, AI, and tokenization are rewriting the rules of money itself.",
    "localImage": "avatars/mena-speakers/areeb-ahmad.webp"
  },
  {
    "sequence": 40,
    "slug": "arjun-sethi---kraken",
    "name": "Arjun Sethi",
    "title": "co-CEO",
    "company": "Kraken",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d7fa920a9a1abc0c2d8_gf5IYOKle3yx46QLzhojy5hstJyd9z0lz-1biXt0Dx8.webp",
    "biography": "Arjun Sethi serves as Co-CEO of Kraken, one of the world’s largest,longest-standing and most secure cryptocurrency platforms.Arjun is widely recognized as one of the top early-stage ventureinvestors in Silicon Valley, as well as a successful founder andoperator.He is also Co-Founder and Chairman of Tribe Capital, a top venture capital firm focused on capturing a perpetual edge in venture and crypto using artificial intelligence and data science. Some of his noteworthy investments include xAI, Rippling, Applied Intuition, Slack, Gusto, Swarm (Sold to SpaceX), Shiprocket and Carta. Arjun was previously a Partner at Social Capital where he led the Venture Team focusing on early stage investing in the consumer and enterprise sector.Prior to his work in venture, Arjun co-founded and sold two successful software companies – LOLapps and MessageMe. LOLapps was acquired by 6waves to become the second largest game publisher on Facebook, and Arjun served as Chief Product Officer. His second company MessageMe was acquired by Yahoo, and Arjun subsequently joined Marissa Mayer’s executive team, where he led data and analytics teams and ran mobile and emerging products. He also served as a Board Observer on Alibaba.Arjun has a long track record of seeding, incubating, and growing investments - including as Co-Founder at Termina.ai, an AI-powered analytics platform used by leading institutional investors to diligence private market investments.He is also a Co-Founder at Kapital (AI powered software platform and bank), Ashvattha (platform for small molecule therapeutics), Foundation (humanoid robots), Ironfist (precision-targeted pharmaceutical treatment for tumors) and Nanopower Therapeutics (anti-inflammatory nanomedicine).",
    "localImage": "avatars/mena-speakers/arjun-sethi.webp"
  },
  {
    "sequence": 41,
    "slug": "arsh-molu---human-rights-foundation",
    "name": "Arsh Molu",
    "title": "Operations Lead",
    "company": "Human Rights Foundation",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae2290a_iVm-CJkt7RmKSKqoihR20sI_QbEOzKhl4kAAZoKPGXQ.webp",
    "biography": "Arsh Molu champions financial freedom at the Human Rights Foundation, an organization dedicated to defending human rights in authoritarian regimes. Arsh is also the Co-founder of Generation Bitcoin and the Bitcoin Students Network, worldwide communities that support younger generations in learning about Bitcoin, cultivating the next generation of Bitcoin leaders.",
    "localImage": "avatars/mena-speakers/arsh-molu.webp"
  },
  {
    "sequence": 42,
    "slug": "austin-alexander---10x-capital",
    "name": "Austin Alexander",
    "title": "Partner",
    "company": "10X Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69163c7e79c3e28d2652baa8_-1FQglAd7xkNVJ1opVk7xP7cXQ5gP3G4JpDFOm4N_eo.webp",
    "biography": "Austin Alexander discovered Bitcoin in 2011 while working at an economic policy think tank in Washington D.C. in 2013 he co-founded the New York Bitcoin Center, the world's first physical Bitcoin exchange. Austin served as the industries first sales executive when he joined kraken in 2014. From 2019-2022 he served as Krakens CEO for the Middle East in the first licensed exchange in the UAE. He is now a partner at 10x Capital",
    "localImage": "avatars/mena-speakers/austin-alexander.webp"
  },
  {
    "sequence": 43,
    "slug": "belyi-nobel-kubwayo---btc-shule",
    "name": "Belyï Nobel KUBWAYO",
    "title": "Founder & Director",
    "company": "BTC Shule",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa397a3a895a71d37c5b_GrHpVuNhDTSot9q1SOBKB2-uMbgbDUVHwXEFjRamzUI.webp",
    "biography": "Belyi is a Burundian Bitcoiner, economist, and social entrepreneur with a passion for technology and financial autonomy. He is the founder of BTC Shule, an initiative that educates Burundians on Bitcoin through meetups and online training, building a circular economy to foster financial autonomy in Gitega. He has been instrumental in building community-based Bitcoin adoption projects in rural areas and regularly advocates for financial autonomy through Bitcoin.Belyï holds several Bitcoin certifications, including the renowned Certified Bitcoin Professional (CBP), Sailor Academy, and Crack The Orange, solidifying his expertise in Bitcoin education and adoption. In addition to his advocacy work, he is also writing a book that explores Bitcoin’s potential in Africa, presenting it through African realities to resonate with and empower the continent’s youth.",
    "localImage": "avatars/mena-speakers/bely-nobel-kubwayo.webp"
  },
  {
    "sequence": 44,
    "slug": "benjamin-de-waal---musqet-limited",
    "name": "Benjamin de Waal",
    "title": "Chief Technology Officer",
    "company": "Musqet Limited",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e65aa469e7d7835b9b6c_XLXjfy4p8LLbVnbwOX28Zpe5A9Z15TXwkT7o4UBT9L0.webp",
    "biography": "Discovered Bitcoin in 2010. Stopped holding fiat in 2017. Resume includes Northern Bitcoin, Lightning Labs, Swan, and more. Currently laser-focused on Merchant Adoption at Musqet.",
    "localImage": "avatars/mena-speakers/benjamin-de-waal.webp"
  },
  {
    "sequence": 45,
    "slug": "bill-qian---cypher-capital",
    "name": "Bill Qian",
    "title": "Founder",
    "company": "Cypher Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad6a77208e786f90fb3e_YRzCSiYweZKGMXTFv5ulKgTecXBcP3iIkKVEsCUrdvE.webp",
    "biography": "Bill Qian – Founder, Investor, & Thought LeaderBill Qian is a global investor, entrepreneur, and thought leader shaping the future of crypto, AI, and fintech. With a track record of over $30 billion in investments, he has played a key role in backing and scaling transformative technologies worldwide.Currently, Bill is the Co-Founder of Cypher Capital, a leading multi-strategy investment firm focused on blockchain and Web3.Previously, Bill was the Global Head of M&A and Binance Labs at Binance, where he managed the world's largest crypto investment portfolio at the time—$25 billion. Prior to that, he led fintech and AI investments at JD.com, overseeing investments in a business that generated over $400 billion in gross merchandise volume (GMV).Beyond investing, Bill is a passionate advocate for the convergence of AI, blockchain, and digital finance. He shares insights through his podcast, “Where AI Meets Crypto, Technology Meets Humanity, and East Meets West,” featuring top industry voices on emerging trends.",
    "localImage": "avatars/mena-speakers/bill-qian.webp"
  },
  {
    "sequence": 46,
    "slug": "billy-boone---simple-mining",
    "name": "Billy Boone",
    "title": "Director of Market Research",
    "company": "Simple Mining",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691d2b692ef36fc4fdccc766_0a12eeb3fe689895288fcc94.webp",
    "biography": "Market Research at Simple Mining. Founder of The Bitcoin Mining Investor Letter.",
    "localImage": "avatars/mena-speakers/billy-boone.webp"
  },
  {
    "sequence": 47,
    "slug": "borja-martel-seward---roxom",
    "name": "Borja Martel Seward",
    "title": "Co-Founder & CEO",
    "company": "Roxom",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f1511fc1b8c54b78b4b475_iRv1iMGsyiukT6Sijn61dGTd9UFCfS0-yEQ_NHSGSkM.webp",
    "biography": "Building Bitcoin's Wall Street",
    "localImage": "avatars/mena-speakers/borja-martel-seward.webp"
  },
  {
    "sequence": 48,
    "slug": "brandon-green---btc-inc",
    "name": "Brandon Green",
    "title": "CEO",
    "company": "BTC Inc",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691e1280b042276097b785ce_bXYbqJ6tPtYHXXLjRx3vpKvHiDZz4AUnP4u0HAgKRKs.webp",
    "biography": "Brandon is CEO of BTC Inc. Since joining the Company in 2017, Green has been a core member of BTC Inc, holding a variety of leadership roles including Managing Director, Chief of Staff, and Head of Events. During his tenure, he has helped drive the global expansion of the Bitcoin Conference franchise beyond the United States to Amsterdam, Hong Kong, and Abu Dhabi.",
    "localImage": "avatars/mena-speakers/brandon-green.webp"
  },
  {
    "sequence": 49,
    "slug": "brett-tejpaul---coinbase",
    "name": "Brett Tejpaul",
    "title": "Co-CEO Institutional",
    "company": "Coinbase",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6921aedca4930d6e65a896e3_a9c6c5684b827ed09f14e76d.webp",
    "biography": "Brett Tejpaul serves as Co-CEO of Coinbase Institutional, leading Coinbase’s efforts to build a trusted bridge for institutions expanding their crypto strategies. In this role, he spearheads the growth of the institutional client base, develops sophisticated features and services tailored to institutional investors, and drives industry-wide education and innovation on digital assets.Brett brings deep expertise from traditional finance, having previously served as Global Head of Sales at Barclays and held senior leadership positions at JP Morgan. His unique combination of institutional markets experience and global crypto innovation enables him to deliver integrated solutions that seamlessly connect custody, advanced trading platforms, and prime services for the world's leading institutions.Brett holds a Bachelor of Science degree from Boston College.",
    "localImage": "avatars/mena-speakers/brett-tejpaul.webp"
  },
  {
    "sequence": 50,
    "slug": "brian-dixon---off-the-chain-capital",
    "name": "Brian Dixon",
    "title": "CEO",
    "company": "Off the Chain Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c8f5debeb5d0904d61b2_Zrd18ezLkqOc7Fytrgj31JeZ1q2syDVd-Sp4s2sZFvQ.webp",
    "biography": "Brian is the CEO of Off the Chain Capital, which is a Warren Buffet value-style investment firm focused on acquiring blockchain assets at a discount. He is the author of four books covering Bitcoin and advanced technology. He entered the Bitcoin space in 2012 and has traveled the world educating people on the importance of the technology and asset.",
    "localImage": "avatars/mena-speakers/brian-dixon.webp"
  },
  {
    "sequence": 51,
    "slug": "brindon-mwiine---bitcoin-kampala-gorilla-sats",
    "name": "Brindon Mwiine",
    "title": "Founder",
    "company": "Bitcoin Kampala/Gorilla Sats",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea66ebf8c5d21bce9cb3b_7978bd7ec5a6a4e0bd90766c.webp",
    "biography": "Brindon Mwiine is the Founder of Bitcoin Kampala Uganda, driving real-world Bitcoin adoption in Uganda through Bitcoin education, circular-economy initiatives, and paying teachers in sats. He is also Co-Founder of Gorilla Sats, which fuses Bitcoin with adventure tourism across Uganda.",
    "localImage": "avatars/mena-speakers/brindon-mwiine.webp"
  },
  {
    "sequence": 52,
    "slug": "bruce-fenton---chainstone-labs",
    "name": "Bruce Fenton",
    "title": "CEO",
    "company": "Chainstone Labs",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a91e189cd2254549fa8__6na6voHfDiqe6smXQ7s7f7BrF-FpTFD3E1f9IpuFg0.webp",
    "biography": "Bruce is CEO of the investment holding company Chainstone Labs. Bruce has been full time in Bitcoin since 2013 when he was Executive Director of the Bitcoin Foundation. He has over 30 years financial and investing experience and owns Atlantic Financial, a Registered Investment Advisor. Fenton is a liberty and free market advocate and ran for US Senate for New Hampshire in 2022. Fenton is the host of the Satoshi Roundtable, now in its 12th year, an annual event bringing together leading Founders, CEOs, and developers in the fintech and Bitcoin ecosystem.",
    "localImage": "avatars/mena-speakers/bruce-fenton.webp"
  },
  {
    "sequence": 53,
    "slug": "carl-moon---moon-group",
    "name": "Carl Moon",
    "title": "CEO & Founder",
    "company": "Moon Group",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6900c3dc4c952e8b9ad8d9d0_ca8c61e5006154eb5e53891a.webp",
    "biography": "Carl Runefelt is a prominent Bitcoin maximalist and entrepreneur who through his media presence, investments, and leadership in the crypto space - Promotes widespread Bitcoin adoption while encouraging others to adopt a long-term, conviction in Bitcoin as the foundation of the new financial era.",
    "localImage": "avatars/mena-speakers/carl-moon.webp"
  },
  {
    "sequence": 54,
    "slug": "carlos-estrada---coin-vigilante",
    "name": "Carlos Estrada",
    "title": "CEO & Founder",
    "company": "Coin Vigilante",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f921e6241b6b69e7c17ce8_f493850c132d15cbad340023.webp",
    "biography": "Carlos Estrada is a Bitcoin entrepreneur and the founder of Coin Vigilante, a company creating limited-edition Bitcoin-inspired timepieces that embody scarcity, precision, and proof-of-work. He is also the founder of Vigilante Media, a full-service marketing agency helping brands grow through storytelling, creative strategy, and digital innovation. In addition, Carlos leads Venture Watches, a B2B watch manufacturing company that provides end-to-end design and production solutions for brands and organizations worldwide. His work connects the worlds of Bitcoin, craftsmanship, and entrepreneurship—driven by a belief in sound money, creativity, and building lasting value.",
    "localImage": "avatars/mena-speakers/carlos-estrada.webp"
  },
  {
    "sequence": 55,
    "slug": "carly-b---the-bitcoin-conference",
    "name": "Carly B",
    "title": "Head of VIP & Strategic Partnerships",
    "company": "The Bitcoin Conference",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691d1b498552f2277f3560f8_fba248d90e04025f89ab2d2b.webp",
    "biography": "Carly Benson is the Head of VIP & Strategic Partnerships for the Bitcoin Conference and has been running the Whale Pass experience since 2021.Carly became a Bitcoin-only Bitcoiner in 2017 after living in Las Vegas and interacting with the professional poker and sports betting community. She learned about Bitcoin by seeing use-cases for it as the whales of the gambling world have been betting, settling and transacting in BTC for many years.Before getting in to the Bitcoin space, Carly ran her own successful marketing consultancy for 18 years and was known as an alcohol-free SME, Course Creator and Yoga Instructor.She has given talks around the world and her work and courses have helped thousands change their relationship with alcohol. She’s been featured in Women’s Health, SELF magazine, Extra TV, Travel Zoo and other notable outlets.",
    "localImage": "avatars/mena-speakers/carly-b.webp"
  },
  {
    "sequence": 56,
    "slug": "charlene-fadirepo---mango-digital-strategies",
    "name": "Charlene Fadirepo",
    "title": "CEO",
    "company": "Mango Digital Strategies",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea66ebf8c5d21bce9cb43_8f759d6de48cdbdde8005707.webp",
    "biography": "Charlene Fadirepo is the founder and CEO of Mango Digital Strategies, a Bitcoin education and consulting firm dedicated to helping finance professionals and mission-driven organizations unlock the potential of Bitcoin and digital assets. With 15+ years of expertise in finance, regulation, and strategic innovation, Charlene has guided corporate clients in integrating Bitcoin into their business models—whether through treasury management optimization, business practices, or exploring Bitcoin mining opportunities. Charlene is the creator of the popular course for finance professionals, BitcoinTreasuryCourse.com. Charlene is also the author of The Bitcoin Leap: How Bitcoin Is Transforming Africa. Charlene studied Electrical Engineering at the University of Virginia and earned a Masters In Business Administration from The Fuqua School of Business at Duke University.",
    "localImage": "avatars/mena-speakers/charlene-fadirepo.webp"
  },
  {
    "sequence": 57,
    "slug": "charlie-hu---bitlayer",
    "name": "Charlie Hu",
    "title": "Co-founder",
    "company": "Bitlayer",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691249b0ba33f4077c82dfb6_zzDn55nmpycjqXrYvFcBeUMlIKZpHTPyYj7u_8rCr2I.webp",
    "biography": "Charlie Hu is an entrepreneur and investor with a long tenure in the crypto space. He bought his first bitcoin in 2013 and since then he has been actively involved in the crypto spaces holding key positions in Polkadot, Tezos and Polygon.He is an active proponent of Bitcoin DeFi and scalability, believing that the largest liquidity unlock potential remains to be seen.Currently he is the the Cofounder of Bitlayer, a Bitcoin Layer 2 supercharging BitcoinDefi through YBTC and BitVM technology, a third generation bridging solution.Charlie is an active public speaker having participated in panels and delivering keynotes participated in Korea Blockchain Week, Bitcoin Nashville, Bitcoin Asia, Consensus. He is regularly featured in top media such as Cointelegraph, Coindesk, Bitcoin.com, Forbes amongst others.He is also a key connector between east and west unlocking opportunities between Asia retail communities and large investors and institutions in the US.",
    "localImage": "avatars/mena-speakers/charlie-hu.webp"
  },
  {
    "sequence": 58,
    "slug": "chris-lane---invictus-advisors",
    "name": "Chris Lane",
    "title": "Partner",
    "company": "Invictus Advisors",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea683efa80faec219fe12_qdq2n0iPzVfbvKTqC16H9RUCayQW7UiWnWQHQSVqTsg.webp",
    "biography": "Began learning about Bitcoin in 2013 while working at Silvergate Bank. Have worked at the intersection of Bitcoin, Digital Assets, and US Commercial Banking for the past 12 years.",
    "localImage": "avatars/mena-speakers/chris-lane.webp"
  },
  {
    "sequence": 59,
    "slug": "mmcrypto-chris---mmcrypto-mmhealth-mmcapital",
    "name": "Chris MMCrypto",
    "title": "Owner",
    "company": "MMCrypto || MMHealth || MMCapital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691e21da932ab22de832470e_e665692b1c65a5d6cea1fdc6.webp",
    "biography": "Bitcoin Content Creator for more than 8 Years.Biggest Public Bitcoin Trade open.Biggest Bitcoin only Audience on YouTube",
    "localImage": "avatars/mena-speakers/chris-mmcrypto.webp"
  },
  {
    "sequence": 60,
    "slug": "christian-lopez---cohen-company-capital-markets",
    "name": "Christian Lopez",
    "title": "Managing Director, Head of Blockchain and Digital Assets",
    "company": "Cohen & Company Capital Markets",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691e35443db35f24435a4264_mlwAZ1ccAxh_i5A3p9lJ-KNXax8aHhdKg4Qn3y6Xb2w.webp",
    "biography": "Christian has dedicated his career to the Fintech and financial services sectors, developing a unique expertise in M&A, venture capital, capital markets, SPAC, and private placement transactions. His passion for sound money and its transformative impact on the financial ecosystem drives his work.Currently, Christian is Managing Director, Head of Blockchain and Digital Assets at Cohen & Company Capital Markets. Previously, he served as Vice President at Broadhaven Capital Partners, providing M&A and private placement advisory services to blockchain and Fintech companies. Before that, he was an Associate at Guggenheim Securities, covering Fintech, Banks, Insurance, and Specialty Finance, with a keen interest in blockchain innovations.Christian holds an MBA from Columbia Business School and a BS from the University of Illinois Urbana-Champaign.",
    "localImage": "avatars/mena-speakers/christian-lopez.webp"
  },
  {
    "sequence": 61,
    "slug": "christoph-koster---ruya",
    "name": "Christoph Koster",
    "title": "CEO",
    "company": "ruya",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68a5e0609f3dee85f8442d60_4BfrTDCwFzvZvt1BBZdTIZHUUFNEQMmHgpZSjwUxzTM.webp",
    "biography": "Chris has been building financial services and investment platforms for banks, governments and technology companies. He is currently serving as the CEO of ruya, the UAE’s digital-first Islamic community bank. Under his leadership, ruya is dedicated to creating a fairer and more sustainable world through ethical Islamic banking practices, exceptional customer service and active community engagement.Before his role at ruya, Chris served as the Chief Operating Officer at a G42 joint venture, where he was responsible for building the business unit from its incubation phase. He also led the asset management of the group's portfolio of operating businesses and developed its proprietary investment programme.Prior to G42, Chris was a key member of the executive management team at the Abu Dhabi Investment Office (ADIO). His leadership and strategic vision were vital in positioning Abu Dhabi as a significant player on the global investment stage.At Emirates NBD, Chris led award-winning strategy and customer experience teams across Private Banking, Asset Management and Retail Banking. His tenure saw Emirates NBD's Private Banking business rise to prominence as the leading wealth management franchise in the region.Chris's career began at Roland Berger’s restructuring and turnaround practice as well as the corporate development and M&A team at a major renewable energy conglomerate.",
    "localImage": "avatars/mena-speakers/christoph-koster.webp"
  },
  {
    "sequence": 62,
    "slug": "clarisse-hagege---dfns",
    "name": "Clarisse Hagege",
    "title": "CEO",
    "company": "Dfns",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69138e2f3aa7da36a2f074f2_8SpUbwyaucXv-4r3d54B_Y46UTY3QimyPtbNoFfOyYI.webp",
    "biography": "Clarisse Hagège is the CEO of Dfns, a cybersecurity company securing Bitcoin and digital assets through advanced wallet infrastructure. Her work focuses on building the cryptographic and institutional rails that enable safe, programmable custody and transaction flows across Bitcoin and other blockchain networks.Beyond Dfns, Clarisse serves on the board of the MPC Alliance, mentors founders through Techstars Web3 Launchpad, and advises early-stage crypto startups at Station F, helping bridge traditional finance and decentralized systems.Before founding Dfns, Clarisse earned degrees in Geopolitics and History (Sorbonne), Finance (Sciences Po), and Applied Economics (Dauphine University). She spent a decade in investment banking at Goldman Sachs, Merrill Lynch, and Crédit Agricole CIB, where she became the youngest Chief of Staff to the CEO and led initiatives in research, global coverage, and energy innovation.Today, Clarisse is deeply engaged in expanding Bitcoin’s institutional adoption and ensuring secure, global access to self-custody infrastructure. She lives between New York and Paris with her partner, Christopher, and their two children.",
    "localImage": "avatars/mena-speakers/clarisse-hagege.webp"
  },
  {
    "sequence": 63,
    "slug": "cody-carbone---the-digital-chamber",
    "name": "Cody Carbone",
    "title": "CEO",
    "company": "The Digital Chamber",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b638dc64b755698d9ad8_6VRvRDzWD504ZeEjTY9QMEWa3j0HvDiIC8qQGGBhH3Y.webp",
    "biography": "Cody Carbone is the CEO of The Digital Chamber, the world’s largest and most trusted trade association representing the digital asset and blockchain industry. Under Cody’s leadership, The Digital Chamber serves as the go-to resource for policymakers, regulators, and industry leaders seeking clarity and collaboration in the rapidly evolving world of digital assets.With over 200 members spanning the entire digital economy—from bitcoin miners and crypto exchanges to financial institutions and Fortune 500 companies—The Chamber plays a central role in shaping the future of Web3 policy. As the premier voice in Washington, The Chamber leads federal education and advocacy efforts, crafting legislation, informing regulatory frameworks, and building bipartisan coalitions to ensure the United States remains a global hub for digital innovation.Cody personally oversees the Chamber’s engagement with Congress and the Trump administration, offering insight and policy solutions that reflect the diverse and rapidly growing digital asset ecosystem. His efforts have helped influence the most consequential digital asset legislation in the U.S..Prior to joining The Digital Chamber, Cody spent six years at Ernst & Young’s (EY) Office of Public Policy, where he led federal advocacy on financial services and emerging technologies. He also brings significant legislative experience, having served as policy staff in both the U.S. House of Representatives and U.S. Senate.Cody holds a Juris Doctor (JD) and a Master of Public Administration (MPA) from Syracuse University and is admitted to the New York State Bar. He resides in Washington, D.C., where he continues to champion smart, innovation-forward policies for the digital future.",
    "localImage": "avatars/mena-speakers/cody-carbone.webp"
  },
  {
    "sequence": 64,
    "slug": "craig-deutsch---btc-inc",
    "name": "Craig  Deutsch",
    "title": "",
    "company": "BTC Inc.",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68a77218a9bccdfaa69a252a_13be398f1351339622f39e64.webp",
    "biography": "",
    "localImage": "avatars/mena-speakers/craig-deutsch.webp"
  },
  {
    "sequence": 65,
    "slug": "dan-webb---btc-media-inc",
    "name": "Dan Webb",
    "title": "Program Coordinator",
    "company": "BTC Media Inc",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e0842c00ad2e95a6d93bf_69ff7b621f14241dd0b94d58.webp",
    "biography": "I've worked in Bitcoin as software engineer, marketer, and strategist for more than five years. Former co-host of the High Hash Rate podcast.",
    "localImage": "avatars/mena-speakers/dan-webb.webp"
  },
  {
    "sequence": 66,
    "slug": "daniel-batten---ch4-capital",
    "name": "Daniel Batten",
    "title": "Managing Partner",
    "company": "CH4 Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68d415818d53cdafa7a0ad82_5969107ca52874bf6b07775d.webp",
    "biography": "Daniel Batten is an entrepreneur and venture capitalist who become a significant voice in the Bitcoin space mainly through his data-driven approach to challenging common energy narratives.As these narratives have evolved he has pivoted attention to investigating the humanitarian value of Bitcoin, and its suitability on the balance sheet of large institutional capital",
    "localImage": "avatars/mena-speakers/daniel-batten.webp"
  },
  {
    "sequence": 67,
    "slug": "daniel-jonsson---mgmt-digital-infrastructure-fund",
    "name": "Daniel Jonsson",
    "title": "CEO",
    "company": "mgmt Digital Infrastructure Fund",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa397a3a895a71d37c5e_tvmgf369uIDUlhmjpLARdzplrTSylsvgk8iAirGn1lI.webp",
    "biography": "Daniel is the CEO of newly launched mgmt Digital Infrastructure Fund, a fund focused on bitcoin mining where energy is low cost, stranded or curtailed and leveraging mining with additional revenue streams such as grid balancing and heat reuse in the Nordics and eventually throughout Europe.A passionate miner since 2017, Daniel has been active in the industry founding and leading companies such as Greenblocks, a bitcoin mining company and Viska Digital Assets, Iceland's first digital asset focused hedge fund.Daniel has been an active angel investor in recent years.As a firm believer in proof of work and doing hard things, Daniel can bench press 150kg and deadlift 221kg.",
    "localImage": "avatars/mena-speakers/daniel-jonsson.webp"
  },
  {
    "sequence": 68,
    "slug": "daniel-sempere-pico---viral-bits",
    "name": "Daniel Sempere Pico",
    "title": "Chief Viral Officer",
    "company": "Viral Bits",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b638dc64b755698d9af9_YVWaUR6QrI7QDReI9o0pF-orqQTHZfGTEzIdONGLVKA.webp",
    "biography": "I'm a former real estate broker and entrepreneur turned bitcoiner. I got seriously into bitcoin at the end of 2020. In early 2021, I started the Bitcoin Gandalf Twitter account and grew it from 0-80,000 followers in 3 years. I also worked in marketing at bitcoin mining company Braiins from 2021-2023. In addition to writing about bitcoin, I'm also focused on helping people become more sovereign by building their personal brands through my ghostwriting and personal branding strategy consulting services.",
    "localImage": "avatars/mena-speakers/daniel-sempere-pico.webp"
  },
  {
    "sequence": 69,
    "slug": "danny-knowles---what-bitcoin-did",
    "name": "Danny Knowles",
    "title": "Host",
    "company": "What Bitcoin Did",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae22907_1o9D8kaY2OIuoc39EEE3AS-iauetRo50bYA3sCWJy4Y.webp",
    "biography": "Host of What Bitcoin DidVenture Partner @ Epoch",
    "localImage": "avatars/mena-speakers/danny-knowles.webp"
  },
  {
    "sequence": 70,
    "slug": "danny-yeung---prenetics-ltd",
    "name": "Danny Yeung",
    "title": "Co-Founder & CEO",
    "company": "PRENETICS LTD",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691dd281aa4cb7be2fa3522d_Ee8W8NqmIwevhL1UWgPJgzc0wAV3lllNNoqXasBwiOs.webp",
    "biography": "Prenetics (Nasdaq: PRE) is a global health-tech and longevity company pioneering a dual-engine “Health + Wealth” strategy—building a transformative wellness brand while simultaneously accumulating one of the world’s most forward-leaning corporate Bitcoin treasuries.Its flagship brand IM8, co-founded with David Beckham, has become a category-defining force—achieving US$100M ARR in only 11 months, making it the fastest supplement company in history to reach this scale, even surpassing the growth trajectories of leading AI companies. IM8 is now projected to reach US$300M ARR by the end of 2026, powered by global expansion, strong clinical validation, and a world-class scientific advisory board.On the wealth engine, as of November 19, Prenetics holds 495 BTC and is acquiring 1 BTC per day, underscoring its commitment to long-term financial resilience, asymmetric upside, and a future where companies invest not only in extending lifespan, but also in strengthening financial health for decades to come.",
    "localImage": "avatars/mena-speakers/danny-yeung.webp"
  },
  {
    "sequence": 71,
    "slug": "darius-alexander---fti-consulting",
    "name": "Darius Alexander",
    "title": "Managing Director",
    "company": "FTI Consulting",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69175661899e123d57ee5efe_45pR_8Fvjm3oPgi8Ot1OMD1XoTpY5kd9fWN8XdUWjWg.webp",
    "biography": "Darius is Managing Director at FTI Consulting. He advises multinationals and institutional funds on marcomms, GTM and growth strategy, having launched into the UAE many leading global technology, fintech and digital assets firms. Prior to FTI, Darius was in venture capital and fintech company building.",
    "localImage": "avatars/mena-speakers/darius-alexander.webp"
  },
  {
    "sequence": 72,
    "slug": "dave-ripley---kraken",
    "name": "Dave Ripley",
    "title": "co-CEO",
    "company": "Kraken",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d7193b898106b94b61b_4r4dtKMmYA2YNpuZBWZB7I7YbuHLj_MsGZnlf3DYgL4.webp",
    "biography": "David Ripley has served as Kraken's Co-Chief Executive Officer since October 2024. He previously served as Kraken's Chief Operating Officer from October 2016 to April 2023 and Chief Executive Officer from April 2023 to October 2024.Prior to joining Kraken, Mr. Ripley was the Co-Founder and Chief Executive Officer of Glidera, a non-custodial wallet and funding service provider that was acquired by Kraken in 2016.Mr. Ripley previously held roles in consulting at The Boston Consulting Group, where he advised clients across multiple industries, including technology and financial services. Earlier in his career, he also held management positions in software engineering and product management at Syclo, a mobile enterprise software company. Mr. Ripley holds a B.S. in Electrical Engineering from the University of Illinois at Urbana-Champaign and an M.B.A. from the Kellogg School of Management at Northwestern University.",
    "localImage": "avatars/mena-speakers/dave-ripley.webp"
  },
  {
    "sequence": 73,
    "slug": "david-bailey---kindly-md-naka",
    "name": "David Bailey",
    "title": "CEO",
    "company": "KindlyMD ($NAKA)",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68fa2b9f369a0f3ee9e018b8_1efDYNmNSXMOIhoDJGbkwWsYaFHhwAreJK1ufUPeMg8.webp",
    "biography": "As the co-founder and chief executive officer of BTC Inc., David Bailey is an industry leader and evangelist for the decentralized future. Since 2013, BTC Inc has grown to offer critical intelligence, brand-building expertise and technical incubation specialized for the Bitcoin ecosystem, as well as industry-leading projects like Bitcoin Magazine, the Bitcoin 2022 conference, and Carrot. The company now operates in multiple countries and its brands are quickly becoming household names. Bailey sits on the board of advisors for the University of Alabama. He was managing partner at 402 Digital Partners, which is one of the earliest Bitcoin funds. He is currently general partner of UTXO Management; and is an active angel investor in the Bitcoin ecosystem.",
    "localImage": "avatars/mena-speakers/david-bailey.webp"
  },
  {
    "sequence": 74,
    "slug": "davinci-jeremie---davinci-codes-software-design",
    "name": "Davinci Jeremie",
    "title": "CEO",
    "company": "Davinci Codes Software Design",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea683efa80faec219fe18_dF6uIEOGQUiV0C42hYdTHXpQOPtYXHvm4QJscV9ZZ9E.webp",
    "biography": "Davinci Jeremie is a Bitcoin educator and entrepreneur dedicated to making crypto simple and practical. He runs the B4B (Bitcoin for Beginners) program, hosts live workshops and mentorships, and produces clear, hands-on guidance on buying, securing and using Bitcoin and Lightning. His teaching focuses on real-world custody, seed security and helping newcomers build confidence with crypto.",
    "localImage": "avatars/mena-speakers/davinci-jeremie.webp"
  },
  {
    "sequence": 75,
    "slug": "denny-xing---hash-house",
    "name": "Denny Xing",
    "title": "VP of Business Development",
    "company": "Hash House",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6894ba88feb4dbc64bde58f4_1cSpFRMN2lLdmorye0Q4uBDI6BCVMKFtCQ4BZCehWmg.webp",
    "biography": "Denny is currently the VP of Business Development at Hash House, where he leads business development, sales, and project management, driving growth and operational excellence across immersion and hydro cooling solutions and electrical hardware solutions.Prior to Hash House, Denny held key roles at Novablock, Poolin, and Luxor, where he developed expertise across multiple business verticals, including mining pool, firmware, hosting operations, and equipment financing.",
    "localImage": "avatars/mena-speakers/denny-xing.webp"
  },
  {
    "sequence": 76,
    "slug": "derar-islim---antalpha",
    "name": "Derar Islim",
    "title": "Antalpha's COO and CEO of Americas & EMEA",
    "company": "Antalpha",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691c838ce90d90923a60f651_a2a1b2e7f0ab23e98799f3cd.webp",
    "biography": "Derar Islim, Ph.D. – Chief Operating Officer, Antalpha Platform Holding Company and CEO, Americas & EMEADerar Islim, PhD, is a seasoned financial executive with significant experience in the digital asset industry, building and managing premier digital assets financial services and products globally. Islim’s career reflects a blend of academic rigor and practical experience in high-stakes financial environments. Derar’s leadership at Genesis, particularly during its crisis, showcased his ability to navigate complex operational and financial challenges from execution and governance perspectives.Derar formerly held the roles of Interim CEO and COO at Genesis and, prior to that, Head of Risk at Hard Yaka. He has an established track record of leading at the forefront of modern financial markets. Early in his career, he served as a senior trader at Bank of America Merrill Lynch, where he co-managed the Funding Valuation Adjustment (FVA) trading desk and worked on modeling, pricing, and hedging credit structured products.Derar holds a Ph.D. in Financial Mathematics from Florida State University, focusing on financial derivatives and applied partial differential equations.Derar is a recipient of the prestigious Fulbright Scholarship, alongside other academic and professional awards.",
    "localImage": "avatars/mena-speakers/derar-islim.webp"
  },
  {
    "sequence": 77,
    "slug": "dishang-patel---rakbank",
    "name": "Dishang Patel",
    "title": "Head of Digital Assets",
    "company": "RAKBANK",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691de94b6c99a1121bdeaad7_4a909c08765c2b1693d1f42b.webp",
    "biography": "Leading the banking charge for RAKBANK in the world of Digital Assets. With a background in Banking, Consulting, and Venture, Dishang brings a very rounded perspective whilst considering DeFi enablement possibilities to TradFi environments.",
    "localImage": "avatars/mena-speakers/dishang-patel.webp"
  },
  {
    "sequence": 78,
    "slug": "dylan-leclair---metaplanet",
    "name": "Dylan LeClair",
    "title": "Head of Bitcoin Strategy",
    "company": "Metaplanet",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911fc88d02f728a7c9fcb33_5tR53k3PR5pbJBXR9boO3r7DT-s4Yu5vtzlBeh9ZpMY.webp",
    "biography": "Dylan LeClair leads Metaplanet’s corporate Bitcoin strategy, advancing its mission to integrate Bitcoin into the core of public capital markets.",
    "localImage": "avatars/mena-speakers/dylan-leclair.webp"
  },
  {
    "sequence": 79,
    "slug": "efe-kelemci---crypto-kid",
    "name": "Efe Kelemci",
    "title": "Co Founder",
    "company": "Crypto Kid",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea683efa80faec219fe1b_30kohohojhnzgWi_KXue9Be3stVqGPSCQi21wo_PukA.webp",
    "biography": "Teen Bitcoiner, Macro Analyst and Educator",
    "localImage": "avatars/mena-speakers/efe-kelemci.webp"
  },
  {
    "sequence": 80,
    "slug": "eli-ben-sasson---starkware-industries",
    "name": "Eli Ben-Sasson",
    "title": "Co-Founder, CEO",
    "company": "Starkware Industries",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d742752443e303c5cf0_Y8Md79xn9nQCcBL95UjQ4pOAzIeQeMIvAGWAt9AuXq4.webp",
    "biography": "Eli is a co-founder and CEO of StarkWare, and Chairman of its Board of Directors.He has been researching cryptographic and zero knowledge proofs of computational integrity ever since he received his Phd in Theoretical Computer Science from the Hebrew University in 2001. Eli is a co-inventor of the STARK, FRI and Zerocash protocols and a Founding Scientist of the Zcash Company. Over the years he held research positions at the Institute for Advanced Study at Princeton, Harvard and MIT, and, most recently, was a Professor of CS at Technion, which he left to co-found StarkWare.",
    "localImage": "avatars/mena-speakers/eli-ben-sasson.webp"
  },
  {
    "sequence": 81,
    "slug": "emily-byun---btc-inc",
    "name": "Emily Byun",
    "title": "Programming Coordinator",
    "company": "BTC Inc.",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e933fa1586af4afeb2e5c3_38sq8DJ4FVAHnmBikXTTSts-pZcQms55AhgDMt7zKhc.webp",
    "biography": "",
    "localImage": "avatars/mena-speakers/emily-byun.webp"
  },
  {
    "sequence": 82,
    "slug": "eric-yakes---epoch",
    "name": "Eric Yakes",
    "title": "Managing Partner",
    "company": "Epoch",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e814fcf2a328d5a05d9935_i2tuRgWLm3vNZnt9mtEvjU1Lfu5LuentBtsHxjjTycM.webp",
    "biography": "Eric Yakes is the Founder and Managing Partner of Epoch - a bitcoin infrastructure focused venture capital firm. He left the world of distressed private equity buyouts to join the bitcoin revolution by authoring The 7th Property - a best selling new release and internationally published book on bitcoin. As a CFA charter holder, his thought leadership is focused on the financial community helping them understand the revolutionary investment characteristics of bitcoin. Eric is a founding member and board Chairman of The Space - a Denver based non-profit educating the masses on economics and bitcoin.",
    "localImage": "avatars/mena-speakers/eric-yakes.webp"
  },
  {
    "sequence": 83,
    "slug": "erik-hersman---gridless",
    "name": "Erik Hersman",
    "title": "CEO",
    "company": "Gridless",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa286d83ee45cd649401_e28cb263507ae55f10d46eb9.webp",
    "biography": "Erik Hersman is the CEO and co-founder of Gridless, a company building renewable energy mini-grids across Africa powered and stabilized by Bitcoin mining. Through projects in Kenya, Malawi, and Zambia, Gridless turns stranded or excess renewable power into productive local electricity and income for rural communities. A longtime technology entrepreneur and infrastructure builder, Erik’s work demonstrates how Bitcoin can be a catalyst for electrification, economic inclusion, and energy resilience across the continent.",
    "localImage": "avatars/mena-speakers/erik-hersman.webp"
  },
  {
    "sequence": 84,
    "slug": "erik-lapaglia---nexttech-ventures",
    "name": "Erik LaPaglia",
    "title": "Managing Partner",
    "company": "NextTech Ventures",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a91e189cd2254549fa5_85482fc08dcb9849d539dead.webp",
    "biography": "Erik LaPaglia is an angel investor, serial entrepreneur, and advisor with a track record of building and revitalizing companies across technology, real estate, advertising, and finance. As co-founder of Miami NFT Week and a board member of multiple organizations, Erik has been deeply involved in bridging innovation with institutional capital, fostering global partnerships at the intersection of Web3, tokenization, and traditional finance.Known for his ability to identify emerging trends and unlock new growth opportunities, Erik has advised and invested in numerous ventures within the blockchain and real-world asset (RWA) tokenization space. He has shared the stage at premier events such as iConnections, SALT, NFT NYC, Bitcoin Conference, and the Benzinga Tech & Finance Conference, engaging audiences on topics ranging from crypto adoption to proptech and capital markets innovation.With a vast network that spans entrepreneurs, investors, and thought leaders, Erik brings a unique perspective on how technology can reshape industries and create scalable, lasting impact.",
    "localImage": "avatars/mena-speakers/erik-lapaglia.webp"
  },
  {
    "sequence": 85,
    "slug": "fabian-jahr---brink",
    "name": "Fabian Jahr",
    "title": "Bitcoin Open Source Developer",
    "company": "Brink",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69aaa3e827485d4234c55_u0aUvcyI35CRv9Ei3ww7ekPrs95j4R-kUUDHovwMhBo.webp",
    "biography": "Fabian works on Bitcoin Core but also supports other related Bitcoin open source projects. He is also researching protocol innovations enabled by Schnorr signatures such as CISA.",
    "localImage": "avatars/mena-speakers/fabian-jahr.webp"
  },
  {
    "sequence": 86,
    "slug": "faisal-al-hammadi---further",
    "name": "Faisal Al Hammadi",
    "title": "Managing Partner",
    "company": "Further",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e0603ed34497d76de363f_ZAPpYzJfDnJn80AHmu3DRbdByPEiieoBtbjrrIWKzEY.webp",
    "biography": "All things Bitcoin",
    "localImage": "avatars/mena-speakers/faisal-al-hammadi.webp"
  },
  {
    "sequence": 87,
    "slug": "faisal-saeed-al-mutar---ideas-beyond-borders",
    "name": "Faisal Saeed Al Mutar",
    "title": "Founder",
    "company": "Ideas Beyond Borders",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6902797f70c9cd59bf3eb2a8_4224ec2bf7487b355435a2e9.webp",
    "biography": "Faisal Saeed Al Mutar is a social entrepreneur and media executive with extensive experience in economic development, innovation, and leadership.Over the past decade, Faisal has driven large-scale change and fostered growth in the Middle East and beyond. As the founder of Ideas Beyond Borders, he has built the organization into a leading platform for advancing free market thought, innovation, and policy reform in the Arab world, particularly in Iraq.Al Mutar has collaborated with intergovernmental organizations and private-sector stakeholders to promote growth and entrepreneurship. His work focuses on identifying transformative opportunities in diverse societies and implementing actionable policies to create jobs, reduce bureaucracy, and empower businesses with the tools necessary to grow.A sought-after speaker and thought leader, Faisal has delivered talks on global platforms, including TED, and engaged with audiences across the U.S. and the Middle East. His expertise spans innovation, counter-extremism, and geopolitical stability. He also supports startups and aspiring leaders, helping empower the next generation of changemakers.Faisal received the President’s Volunteer Service Award from President Barack Obama and an honorary doctorate from Whittier College in California.Splitting his time between New York and the Middle East, Faisal blends global insights with local expertise, building bridges between cultures and advancing meaningful change.",
    "localImage": "avatars/mena-speakers/faisal-saeed-al-mutar.webp"
  },
  {
    "sequence": 88,
    "slug": "farooq-ahmed---arcift-technologies",
    "name": "Farooq Ahmed",
    "title": "Founder & CEO",
    "company": "Arcift Technologies",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68fa434bf9de9a1bdac30d65_fbI-DW9pAC92ggQxBKwH0rpU5kqOX9XPFamdNJFxJFA.webp",
    "biography": "Passionate bitcoin maximalist from Pakistan, driving bitcoin adoption in Pakistan and the UAE. Founder of Bitcoin Pakistan, a non-profit dedicated to educating Pakistanis and muslims worldwide on bitcoin's power for financial sovereignty and wealth preservation.",
    "localImage": "avatars/mena-speakers/farooq-ahmed.webp"
  },
  {
    "sequence": 89,
    "slug": "fin-creighton---sovereign-kind",
    "name": "Fin Creighton",
    "title": "Founder",
    "company": "Bitcoin Success School",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f921c94f5e6d4dce509a2f_NH92zl5MO0QyGSr8nceP2qy20IL4KH4YiJ3eYVI6jEw.webp",
    "biography": "Fin Creighton is the founder of Bitcoin Success School. His work blends Bitcoin education, sovereignty, and long term protection, guiding individuals to avoid costly mistakes, remove trust in third parties, and take full control of their future. The Fin Creighton Podcast releases a weekly episode targeted for Gen Z Bitcoin Education.",
    "localImage": "avatars/mena-speakers/fin-creighton.webp"
  },
  {
    "sequence": 90,
    "slug": "frank-corva---bitcoin-magazine",
    "name": "Frank Corva",
    "title": "Political Correspondent",
    "company": "Bitcoin Magazine",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/692a1e2d76d6274dde056ed3_1VRjHWzGY0VvxO3kKu9oJw5woRmr_IfHrxM7DwI_9FY.webp",
    "biography": "Frank Corva is the White House and Political Correspondent for Bitcoin Magazine.",
    "localImage": "avatars/mena-speakers/frank-corva.webp"
  },
  {
    "sequence": 91,
    "slug": "fred-king---cryptosnake",
    "name": "Fred King",
    "title": "Founder",
    "company": "CryptoSnake",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b638dc64b755698d9ae3_lpvzHhYlGeSclczYovwN0VwAvpd5YWmRl9NRp3C2JWA.webp",
    "biography": "Fred King is a Bitcoiner and the founder of CryptoSnake, a YouTube channel focused on Bitcoin and crypto.",
    "localImage": "avatars/mena-speakers/fred-king.webp"
  },
  {
    "sequence": 92,
    "slug": "gary-sheynkman---further",
    "name": "Gary Sheynkman",
    "title": "Partner",
    "company": "Further",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69aaa3e827485d4234c4c_ADOcV_4RFQ2KGegHapsJfFmCIL-LnjFYmUeFwxGbkGI.webp",
    "biography": "Founder and VC",
    "localImage": "avatars/mena-speakers/gary-sheynkman.webp"
  },
  {
    "sequence": 93,
    "slug": "george-mekhail---bitcoin-for-corporations-btc-inc",
    "name": "George Mekhail",
    "title": "Managing Director",
    "company": "Bitcoin for Corporations, BTC Inc",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e81508c0228da0cb209262_kntEp80pjhdX-Ci1tuxVYej-jJz8s02NvN8sN3ulERU.webp",
    "biography": "George Mekhail is the Managing Director of Bitcoin for Corporations at BTC Inc., author of I Am Not Your Bruh, and co-author of Thank God for Bitcoin. A passionate advocate for Bitcoin since 2017, George blends his experience in marketing, financial innovation, and community development to guide companies in thoughtfully integrating Bitcoin into their strategic operations, while also advocating for strong family dynamics at home.",
    "localImage": "avatars/mena-speakers/george-mekhail.webp"
  },
  {
    "sequence": 94,
    "slug": "gopal-bharvad---21m-hedgit",
    "name": "Gopal Bharvad",
    "title": "Founder & COO",
    "company": "21m | Hedgit",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fb7f08a0cc040d0a122_SWRqYQEqz_a2cQc-LWBvo4Wp6BfXXvpORA9cj4rm99c.webp",
    "biography": "Building Bitcoin Financial Services @ HedgitWhile shaping the Orange Hill @ 21mStarted mining in 2014, burned down old refrigerator trying to cool a rig and hosted a Bitcoin meetup in 2016 then Shitereum happened. Since then been on the learning curve, educating about corn, building & growing while eternally repeating: Stack the sats.",
    "localImage": "avatars/mena-speakers/gopal-bharvad.webp"
  },
  {
    "sequence": 95,
    "slug": "greg-carson---humla-ventures",
    "name": "Greg Carson",
    "title": "Managing Partner",
    "company": "Humla Ventures",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68d438bf38f9e3a1f6440981_23c1cdec1648085e39920185.webp",
    "biography": "Greg Carson is a frequent contributor, lecturer and speaker on events about investing in the digital asset ecosystem and negotiation technique. He has spoken on these subjects at several global conferences including Super Venture, Wyoming Blockchain Symposium, CFC St Moritz, Bitcoin 2021-2025, MCC, Davos, Uncorrelated Alts, Horizon events and even at his Alma Mater, the Wharton School of Business. Greg has a decade as a tech founder, a decade of experience in investment banking and strategy, and is rounding out his first decade in venture capital. Humla Ventures operates in the top decile of venture returns and is one of the top global emerging managers in the space. Greg is a dedicated father snowboarder, sportsman, reader/writer, dance teacher and tai chi.",
    "localImage": "avatars/mena-speakers/greg-carson.webp"
  },
  {
    "sequence": 96,
    "slug": "gregg-davis---btc-inc",
    "name": "Gregg Davis",
    "title": "Director MENA",
    "company": "BTC Inc",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e814fcf2a328d5a05d9938_ab7455d6a349e3069fce2f0a.webp",
    "biography": "UK national, based in the UAE for 10 years. Having attended and had poor experiences at crypto events in the region, Gregg reached out to BTC Inc in 2022 to bring the Bitcoin Conference to Abu Dhabi. Using the landmark success of the inaugural Bitcoin MENA conference in 2024 as a launchpad, Gregg is now working on a bigger and better Bitcoin MENA 2025 along with launching Bitcoin Magazine, Bitcoin for Corporations and UTXO Managment into the GCC region. Yacht Captain by trade, Bitcoiner by nature.",
    "localImage": "avatars/mena-speakers/gregg-davis.webp"
  },
  {
    "sequence": 97,
    "slug": "haider-rafique---okx",
    "name": "Haider Rafique",
    "title": "Managing Partner and CMO",
    "company": "OKX",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05ffa6c269b0c06602fb_47f1f7be1cac530cf45d2cd4.webp",
    "biography": "Haider Rafique is the Global Managing Partner and Chief Marketing Officer at OKX, where he oversees government and investor relations, marketing, and brand partnerships. He plays a central role in shaping OKX’s engagement with global regulators, investors, and key stakeholders during a pivotal time for the cryptocurrency industry. Haider is also the creator of the OKX brand, and led its transformation into a globally recognized platform and was a key contributor developing the OKX app as a unified crypto super app.Prior to joining OKX, he led the rebranding and growth of blockchain.info into blockchain.com, one of the leading digital asset platforms. He has held senior marketing and growth roles at major crypto firms, including Okcoin, where he drove significant retail user growth. Haider’s experience spans traditional advertising with global agencies and technology companies such as Microsoft.",
    "localImage": "avatars/mena-speakers/haider-rafique.webp"
  },
  {
    "sequence": 98,
    "slug": "henson-orser---soter-insure",
    "name": "Henson Orser",
    "title": "Founder & CEO",
    "company": "Soter Insure",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c90e98b6b62f77c388f3_Wj-9Y2daFKNY3ZaETo3bekGB4ezZ7Xum22q9J9o_T7w.webp",
    "biography": "Prior to launching Soter Insure, Henson was the first CEO of the Virtual Asset Regulator Authority in Dubai (VARA), and prior to that he was President and Acting CEO of Komainu, an institutional grade digital asset custodian, launched out of Nomura Securities in collaboration with Coinshares and Ledger.",
    "localImage": "avatars/mena-speakers/henson-orser.webp"
  },
  {
    "sequence": 99,
    "slug": "hicham-chahine---nip-group-inc",
    "name": "Hicham Chahine",
    "title": "Founder & Co-CEO",
    "company": "NIP Group INC",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad63b989f44b0f787dcf_cb276ef2822ec001a6236cad.webp",
    "biography": "Hicham Chahine is Co-Founder and Co-CEO of NIP Group (NASDAQ: NIPG), where he is leading the company's rapid expansion into Bitcoin mining and digital infrastructure. Under his leadership, NIPG scaled from zero to 11.3 EH/s of Bitcoin mining capacity in under six months, establishing the company as one of the fastest-growing public miners globally, and the largest in the MENA region.Prior to NIPG's digital infrastructure expansion, Hicham acquired the esports organization Ninjas in Pyjamas in 2016 and built it into a global gaming and entertainment platform reaching hundreds of millions of fans. His background spans finance and entrepreneurship - from 2008 to 2016, he directed hedge fund investments at Formue, the Nordic region's largest wealth management firm, and in 2010 founded Diglife AS, a private equity firm focused on lifestyle, gaming, and technology investments.Hicham brings a unique perspective to Bitcoin mining through his combination of financial markets experience, operational scale-up expertise, and deep understanding of digital communities and fan engagement. He is based in Abu Dhabi, where NIPG operates under a partnership framework with the Abu Dhabi Investment Office. He holds a bachelor's degree in business and economics from BI Norwegian Business School.",
    "localImage": "avatars/mena-speakers/hicham-chahine.webp"
  },
  {
    "sequence": 100,
    "slug": "hubertus-the-austrian-hofkirchner---bitcredit-protocol",
    "name": "Hubertus \"the Austrian\" Hofkirchner",
    "title": "Founder",
    "company": "Bitcredit Protocol",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69121666116573083c1a1513_f02863a30fce3464880f3287.webp",
    "biography": "Hubertus is the Founder of Bitcredit Protocol, the elastic Bitcoin credit money layer for business adoption in the real economy. A former commercial banker, investment banker, and Telecom CEO, Hubertus has been an independent serial entrepreneur at the intersection of finance and IT for two decades, founding an online brokerage, a digital options exchange, and a global prediction market platform. He also hosts the monthly Austrian Economics Salon at Vienna's Hayek Institute.",
    "localImage": "avatars/mena-speakers/hubertus-the-austrian-hofkirchner.webp"
  },
  {
    "sequence": 101,
    "slug": "hunter-albright---salt-lending",
    "name": "Hunter Albright",
    "title": "Chief Revenue Officer",
    "company": "SALT Lending",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dff24a3f0c96164ffd59a5_4bb1d2cf57d574eb2886a181.webp",
    "biography": "Hunter is the Chief Revenue Officer of SALT Lending, one of the earliest Bitcoin-backed lending platforms, and co-author of the upcoming book - The Bitcoin Advantage. A systems engineer by training with a Ph.D. in optimization and AI from the University of Virginia, he has held senior leadership roles at global banks include Barclays, HBOS, and MasterCard, founded and advised multiple startups, and worked internationally across Europe and the U.S. Hunter has been active in Bitcoin education through the University of Colorado Blockchain Alliance, IEEE blockchain initiatives, and the CryptoCurrency Certification Consortium (C4), and he frequently speaks at global Bitcoin conferences on innovation in Bitcoin-backed finance and financial sovereignty.",
    "localImage": "avatars/mena-speakers/hunter-albright.webp"
  },
  {
    "sequence": 102,
    "slug": "ian-dillon---sumara-technology",
    "name": "Ian Dillon",
    "title": "CEO",
    "company": "Sumara Technology",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c9228ee863e3faf9fcdd_02zzn3GjAfwBxWAO0QvEVbhbbTViJkCUC6wfzXgiBEE.webp",
    "biography": "Ian is an executive and serial entrepreneur, building businesses providing financial services to underserved groups in the Middle East and Africa. Ian is currently CEO of Sumara Technology, which undertakes digital transformation projects for large financial services firms. Sumara Technology has a Bitcoin treasury, and uses this as a competitive advantage.Former Chief Product Officer at Moniepoint, the second fastest growing company in Africa, Global Head of Product at CMC Markets, and co-founder of NOW Money, a multiple award winning UAE-based company that broke new ground by providing accounts and access to financial services for the 26 million migrant workers in the Middle East.Ian was UAE Fintech Entrepreneur of the Year 2019 (ADGM).Ian is an avid Bitcoiner, who is working on solutions that can bring the benefits of Bitcoin to populations in Africa and the Middle East, who have unique characteristics and needs from financial services which are often poorly understood by the West.",
    "localImage": "avatars/mena-speakers/ian-dillon.webp"
  },
  {
    "sequence": 103,
    "slug": "irene-gao---bitmain",
    "name": "Irene Gao",
    "title": "President of Mining",
    "company": "Bitmain",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c3298b0b809e11df293146_1PFWXJme5xKCK9A4vihegkGZZtbLlUUwNCNCQ7xZyB0.webp",
    "biography": "Irene has years of experience in the digital currency mining space and is in charge of BITMAIN’s global business development. She is an expert on developing the mining ecosystem with vast knowledge of high-performance mining hardware and data center development. She is an advocate for renewable energy integration for green mining.",
    "localImage": "avatars/mena-speakers/irene-gao.webp"
  },
  {
    "sequence": 104,
    "slug": "irina-heaver---neoslegal",
    "name": "Irina Heaver",
    "title": "UAE’s Bitcoin Lawyer, Founder",
    "company": "NeosLegal",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68bb11c53324a56712621a57_Y3uIYhTYkUFUlPPPC6VvK3YtpSR0DsfPmdyQ4FAaFrQ.webp",
    "biography": "Irina Heaver is a leading Bitcoin lawyer based in Dubai, managing the first UAE-based law firm exclusively dedicated to Bitcoin and Crypto since 2016. She has represented some of the industry’s most prominent companies and groundbreaking projects. Irina has also advised numerous governments and regulators, playing a key role in shaping emerging technology policies and drafting Bitcoin-specific laws and regulations. Passionate about empowering visionary startup founders, Irina is dedicated to helping them bring their innovative ideas to life. As a Bitcoiner, she firmly believes that money should be separated from the state.",
    "localImage": "avatars/mena-speakers/irina-heaver.webp"
  },
  {
    "sequence": 105,
    "slug": "jd-gagnon---bits-blockchain-inc",
    "name": "JD Gagnon",
    "title": "Founder / President",
    "company": "BITS Blockchain Inc",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691e04ef87685140b5bc26db_5RI0fiSPm0lupE452GouNgal8B8B_Ono4lRbx_da7wc.webp",
    "biography": "JD Gagnon is a blockchain entrepreneur and strategist with expertise across multiple ecosystems, most recently including the Core Network. As Founder of BITS (bits.financial), he develops infrastructure that bridges traditional finance and DeFi, supporting real-yield strategies with institutional-grade custody and cross-chain composability for assets like BTC and wBTC. A co-founder of Rome Blockchain Labs, an incubator focused on DeFi innovation, and BENQI, a lending protocol on Avalanche that reached $4B in TVL post-launch, JD has experience scaling protocols from early-stage development to enterprise adoption. His background in financial planning, business consulting, and digital strategy helps him address risks, regulations, and opportunities with institutions and projects of all sizes.",
    "localImage": "avatars/mena-speakers/jd-gagnon.webp"
  },
  {
    "sequence": 106,
    "slug": "jez-mohideen---laser-digital",
    "name": "Jez Mohideen",
    "title": "Co-founder & CEO",
    "company": "Laser Digital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea683efa80faec219fe15_kNRZ2BEW2D3O9H2144wXsd4IdSo5cwfh5Fol_7ALtX0.webp",
    "biography": "Dr. Jez Mohideen is an accomplished entrepreneur and financial innovator, recognized for building businesses at the intersection of traditional finance and digital assets. As Co-Founder & CEO of Laser Digital — the digital finance arm of Nomura Group, he is leading thecreation of regulated, institutional-grade solutions across trading, asset management, and venture investment in the digital asset ecosystem.An entrepreneur at heart, Jez has co-founded and scaled ventures including Komainu, an institutional digital asset custodian launched with Nomura in 2018, and KAIO (formerly Libre), a pioneer in tokenisation infrastructure for real-world assets. Prior to Nomura, he was a partner at Brevan Howard, spearheading systematic and AI/ML-driven macro tradingstrategies.With over 30 years in global capital markets and macro trading, Jez also served as Nomura’s Chief Digital Officer and Co-Head of Global Markets EMEA, driving the firm’s digital transformation. He holds a PhD in Process Systems Engineering and a Master’s in Chemical Engineering from Imperial College London.",
    "localImage": "avatars/mena-speakers/jez-mohideen.webp"
  },
  {
    "sequence": 107,
    "slug": "jimmy-kostro---bitcoin-chiang-mai",
    "name": "Jimmy Kostro",
    "title": "Co-Founder",
    "company": "Bitcoin Chiang Mai",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fb5f0d2e532ffc91b2a_Nmk0QYSwsMPwafQ8fK4sFZ-9M7_1TAI66bMNDZMZDWc.webp",
    "biography": "Asia’s fastest growing physical Bitcoin community",
    "localImage": "avatars/mena-speakers/jimmy-kostro.webp"
  },
  {
    "sequence": 108,
    "slug": "john-pratt---bitcoin-sydney",
    "name": "John Pratt",
    "title": "Co founder and host",
    "company": "Bitcoin Sydney",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea683efa80faec219fe0e_BA5w1_yT3GWPBnIYpI0zfa09N0dYZNGMQjTKgjd9R18.webp",
    "biography": "JP has been studying Bitcoin for 12 years and from 2018, co-founded and hosts Bitcoin Sydney, an educational and social group focused on helping existing Bitcoiners and general public understand and get involved in this burgeoning ecosystem. He also presents talks to other community groups on the necessity of owning Bitcoin.His other topics of interest include Bitcoin Game Theory, Bitcoin as sound money/savings tech, Bitcoin satellite connected nodes (first to run one in Aus), Why Bitcoin is the only blockchain that matters, and Bitcoin history.",
    "localImage": "avatars/mena-speakers/john-pratt.webp"
  },
  {
    "sequence": 109,
    "slug": "jonathan-ovadia---ovex",
    "name": "Jonathan Ovadia",
    "title": "CEO",
    "company": "OVEX",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691d2b692ef36fc4fdccc763_mb0-aCgx-vaI-tHrbeVg0OMMVfQkYFEMs0wWGkIjS2Y.webp",
    "biography": "As the Founder and CEO of OVEX, Jonathan Ovadia is at the forefront of institutional Bitcoin adoption in Africa.With a strong background in Electrical and Computer Engineering from the University of Cape Town, Jonathan views market inefficiencies as engineering problems—and has built OVEX into the region's premier infrastructure for digital asset settlement and liquidity.Jonathan is widely recognized for democratizing access to global finance for the continent's largest enterprises. He has been instrumental in opening up institutional access to Bitcoin, establishing the secure, high-volume payment rails required for companies to use cryptocurrency as a real-time settlement layer for cross-border trade and corporate treasury management. Having processed billions in volume, Jonathan is re-defining the utility of Bitcoin and stablecoins for African commerce.",
    "localImage": "avatars/mena-speakers/jonathan-ovadia.webp"
  },
  {
    "sequence": 110,
    "slug": "joseph-collement---bitcoin-com",
    "name": "Joseph Collement",
    "title": "Chief Legal Officer and Head of Media",
    "company": "Bitcoin.com",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a980751fcd7f0273760_qh0zD4OyOB6r9GZmbK7m5MQ8IrYpLoUjBBvtq9TF2XY.webp",
    "biography": "Joseph is a licensed attorney in the U.S. and founder of thecryptolawyers.com (est. 2017), a crypto-only law firm where he represented top players in the industry. Joseph has been an executive at Bitcoin.com since 2020 and leads the media, legal and compliance teams. Joseph is also a regular contributor to various financial and crypto online publications such as Coindesk, Fortune, Yahoo Finance, and Cointelegraph.",
    "localImage": "avatars/mena-speakers/joseph-collement.webp"
  },
  {
    "sequence": 111,
    "slug": "joseph-dallago---rain",
    "name": "Joseph Dallago",
    "title": "CEO & Co-Founder",
    "company": "Rain",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691ca12e08736b4f1d14e48f_1ce33a513ef46784736cedce.webp",
    "biography": "Joseph Dallago is the Co-Founder and CEO of Rain, the first licensed and largest region-born cryptocurrency exchange in the Middle East and North Africa. He began coding at age 13 and has spent more than a decade building technology companies, founding and exiting two startups before Rain. Joseph entered the crypto space in 2013 and has been closely involved in its evolution, particularly across the Middle East. Under his leadership, Rain secured the region’s first crypto license with the Central Bank of Bahrain in 2017 and expanded its regulatory footprint by obtaining an ADGM licence in 2023. Rain has since grown to more than one million sign-ups and raised 110 million USD from global investors including Coinbase, Kleiner Perkins, and Paradigm. Joseph remains focused on expanding financial access and driving responsible crypto adoption across the region.",
    "localImage": "avatars/mena-speakers/joseph-dallago.webp"
  },
  {
    "sequence": 112,
    "slug": "joshua-wiltord-mutekanga---neona-synergy",
    "name": "Joshua  Wiltord Mutekanga",
    "title": "Country Lead- Uganda",
    "company": "Neona synergy",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e6c29dac8427fdb56449_bPEwIyp5YYMQwFQ9uFB1uUXlWH8fQ82HK8-IljXYjWk.webp",
    "biography": "Bitcoin advocate at the Bitcoin Innovation Hub in Uganda, where I lead Bitcoin education and adoption through programs that empower refugees.",
    "localImage": "avatars/mena-speakers/joshua-wiltord-mutekanga.webp"
  },
  {
    "sequence": 113,
    "slug": "kevin-zhang---foundry",
    "name": "Kevin  Zhang",
    "title": "Head of Asia",
    "company": "KindlyMD ($NAKA)",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c8da8bffe68f9b459b6c_MO7UlYOsHprQdwIlxrzv1BFTkvukOtK3nr7vu7xB5Zk.webp",
    "biography": "As Head of Asia, Kevin will lead Nakamoto, which is a subsidiary of KindlyMD, Bitcoin treasury strategy across one of the world’s most important and dynamic regions. Kevin is responsible cultivating key relationships with governments, regulators, exchanges, and public companies, while also strengthening ties with institutional investors, sovereign funds, and family offices.Kevin first entered the Bitcoin space in 2014 and has spent the past decade at the forefront of mining and infrastructure deployment. Previously, he served as SVP of Business Development and Mining Strategies at Foundry Digital. At Foundry, Kevin oversaw the deployment of one of the largest North American fleets and helped build the world’s largest Bitcoin mining pool for four consecutive years.Prior to joining Foundry Digital, Kevin served as Chief Mining Officer at Greenidge Generation, where he transformed a 106MW natural gas plant into the first federally regulated power plant to mine Bitcoin, paving the way for broader institutional adoption of mining in the U.S. Before that, he served as Mining Operations Manager at Bitcoin.com. In 2016, he co-founded Project Spokane, a Bitcoin mining datacenter that he helped establish as the largest mining facility in North America at the time.",
    "localImage": "avatars/mena-speakers/kevin-zhang.webp"
  },
  {
    "sequence": 114,
    "slug": "kgothatso-ngako---machankura",
    "name": "Kgothatso Ngako",
    "title": "CEO",
    "company": "Machankura",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6924946c21b88af69d317851_9bgncTWJAgZ2cP9v1eGBC3Tj0urCwxQPWkTbo_D9pLg.webp",
    "biography": "Kgothatso Ngako is a catalyst, accelerating the adoption of Bitcoin across the African continent.He has founded 8333.mobi, a wallet focused on giving people without an internet connected device the ability to send and receive Bitcoin (primarily through USSD), and exonumia.africa (focused on translating Bitcoin literature into African languages).",
    "localImage": "avatars/mena-speakers/kgothatso-ngako.webp"
  },
  {
    "sequence": 115,
    "slug": "khalil-nur-khalil---katsina-state-government",
    "name": "Khalil Nur Khalil",
    "title": "Chief Economic Adviser",
    "company": "Katsina State Government",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a9d8e7ef9fb7669981e_bO9edshoTk8uqIBF8rQFqZx08tqx5z9ynghaiR20WJ8.webp",
    "biography": "Khalil serves as the Economic Advisor to the Katsina State Government in Nigeria, and previously as the Executive Director of the Kaduna State Investment Promotion Agency in Nigeria. He is a passionate longtime Bitcoin advocate championing innovative economic policies and state-level strategies at the intersection of governance and Bitcoin in emerging markets",
    "localImage": "avatars/mena-speakers/khalil-nur-khalil.webp"
  },
  {
    "sequence": 116,
    "slug": "khing-oei---treasury",
    "name": "Khing Oei",
    "title": "CEO",
    "company": "Treasury",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68d41584bdb1e847db858480_e2e67794f54ebb1c172ef40f.webp",
    "biography": "Khing Oei is the Founder and CEO of Treasury, a Netherlands-based Bitcoin treasury company recently launched with the ambition to become Europe’s largest. Backed by investors including Winklevoss Capital and Nakamoto, Treasury has the intention to list via a reverse listing on Euronext Amsterdam.",
    "localImage": "avatars/mena-speakers/khing-oei.webp"
  },
  {
    "sequence": 117,
    "slug": "kingsley-advani---allocations",
    "name": "Kingsley Advani",
    "title": "CEO",
    "company": "Allocations",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69aaa3e827485d4234c52_-oVr22xwb4sXEVkU1XFs70HZwUk4wfXOIAAJTGp3hAo.webp",
    "biography": "Kingsley Advani is CEO of Allocations, CEO of Allo, Managing Partner of Chainfund Capital and has managed $1BN+ in crypto assets spanning private and public markets across multiple funds since 2013 and structured $2BN+ of private equity transactions. Previously, Kingsley was a Mergers & Acquisitions (M&A) investment banker at BNP Paribas in London where he advised on $10bn+ of debt financing transactions. Kingsley was an early / seed investor in a number of crypto unicorns including Ethereum, Solana, Polkadot, Avalanche, Arweave, Oasis, Coinbase and Robinhood. He has invested in multiple digital asset treasury companies including: BNC Network Company (NASDAQ: BNC), Nakamoto (NASDAQ: NAKA), SUI Group Holdings Limited (NASDAQ: SUIG), TON Strategy Company (NASDAQ: TONX), Satsuma Technology PLC (LSE: SATS), ETHZilla Corporation (NASDAQ: ETHZ) and Forward Industries, Inc. (NASDAQ: FORD).",
    "localImage": "avatars/mena-speakers/kingsley-advani.webp"
  },
  {
    "sequence": 118,
    "slug": "kristyna-mazankova---btc-inc-hesperides-university",
    "name": "Kristyna Mazankova",
    "title": "Head of PR, Director of the Master in Bitcoin",
    "company": "BTC Inc., Hesperides University",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6913ab78a0650f2fcd6b3fec_16a3d0a4a192180df3b2cf72.webp",
    "biography": "Kristýna Mazánková is the Director of the Master in Bitcoin — the world’s first English and global academic program dedicated entirely and only to Bitcoin as a social, technological, and economic phenomenon.Before entering the Bitcoin industry in 2019, Kristýna built her career in technology and corporate communications, helping global and regional organizations communicate innovation and navigate change. She later led communications at SatoshiLabs, the creators of Trezor, and today serves as Head of PR at BTC Inc., the company behind Bitcoin Magazine and the world’s largest Bitcoin conferences.At Hesperides University, Kristýna is shaping a new kind of higher education — one that treats Bitcoin not as a trend, but as a turning point in human organization, value, and trust. As she puts it, “Bitcoin deserves an academic space — serious, independent, and global.”Her work connects communication, education, technology, and the growing movement for intellectual and financial independence.",
    "localImage": "avatars/mena-speakers/kristyna-mazankova.webp"
  },
  {
    "sequence": 119,
    "slug": "laura-inamedinova---gate-com",
    "name": "Laura Inamedinova",
    "title": "CGEO",
    "company": "Gate.com",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911ff8acc4548866e7c7dc0_H7LNcfuirqvNmlX8mEXpBg1uOuNqKzhkyxMaGIIauEg.webp",
    "biography": "Laura K. Inamedinova is an award-winning serial entrepreneur, investor, and keynote speaker sharing her insights on the Web3 and Bitcoin space since 2016.As CGEO at Gate.com, she builds cross-border partnerships and manages the global growth of the exchange, with a strong focus on advancing Bitcoin adoption and access worldwide.Before joining Gate.com, she founded a Web3 marketing agency, LKI Consulting, which she grew to 8-figures. This led her to be globally acclaimed as one of the “10 Women Entrepreneurs” by Entrepreneur Magazine and among the “Top 10 Women in International Business” by Silicon Valley Times.In 2024, she transferred the leadership of LKI Consulting to a new management team, while Laura remained the majority shareholder.Laura was recognized as one of the “Forbes 30 Under 30 Blockchain Visionaries” by Forbes Mexico in 2025, highlighting her impact on the Web3 and Bitcoin industry.On a personal level, Laura is a successful angel investor with 40+ projects in her portfolio, an ex-Forbes and Huffington Post columnist, and an internationally renowned speaker who frequently covers Bitcoin’s role in shaping the future of finance.",
    "localImage": "avatars/mena-speakers/laura-inamedinova.webp"
  },
  {
    "sequence": 120,
    "slug": "leeor-groen---spartan-group",
    "name": "Leeor Groen",
    "title": "Partner",
    "company": "Spartan Group",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911ff992b5cc28ee50f6c12_4b39be5d940f01159e951c37.webp",
    "biography": "Leeor Groen is a Partner at Spartan Group based in Switzerland and active in the industry since 2016. He brings over ten years of experience in dealmaking, investing in, and advising technology companies across Europe, North America and Asia. At Spartan, Leeor works closely with founders, investors, and protocols across the digital asset ecosystem, helping them navigate strategic growth, capital raising, and exits.",
    "localImage": "avatars/mena-speakers/leeor-groen.webp"
  },
  {
    "sequence": 121,
    "slug": "lena-art---lena-wear-your-statement",
    "name": "Lena Art",
    "title": "Founder",
    "company": "LENA WEAR YOUR STATEMENT",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691ca12e08736b4f1d14e492_3844a90a8551fc069521e10f.webp",
    "biography": "Style is a way to say who you are without having to speak.",
    "localImage": "avatars/mena-speakers/lena-art.webp"
  },
  {
    "sequence": 122,
    "slug": "lina-seiche---the-little-hodler",
    "name": "Lina Seiche",
    "title": "CEO",
    "company": "The Little HODLer",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fb2151dfc7d84da6203_kVcmxaGTxf5Ls9xtr83Pq21R_0Xn5F6ZnA-HT2v_LS8.webp",
    "biography": "Lina Seiche is a cartoonist, writer, and creator of The Little HODLer, one of the world’s most popular Bitcoin comic and merchandise brands. Since 2020, The Little HODLer comic series has reached millions of readers online and in print; The Little HODLer plushies, comic books, and other merchandise have been adopted by customers in over 60 countries. Since 2025, The Little HODLer pioneers the world’s first primary school financial education program in El Salvador.",
    "localImage": "avatars/mena-speakers/lina-seiche.webp"
  },
  {
    "sequence": 123,
    "slug": "linah-ali---bitcoin-beef-bits",
    "name": "Linah Ali",
    "title": "Co-Founder",
    "company": "Bitcoin Beef Bits",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e69d51cb40513f6bd1e0_sfg5mAfkhOnpquObCYC2VwQJYFlP7FFfCIm-wocOtqw.webp",
    "biography": "Linah is one of the co-founders of Bitcoin Beef Bits, a fiat-free premium beef snack dried using excess heat from Bitcoin miners. With a background in marketing and experience across startups and tech including Uber, she’s always been drawn to entrepreneurship and building innovative, value-driven brands.Through Bitcoin Beef Bits, she explores how Bitcoin’s Proof-of-Work can be harnessed for sustainable innovation and meaningful brand storytelling. Active on Nostr, X, and Instagram, Linah is passionate about authentic marketing, grassroots movements, and finding creative ways to integrate Bitcoin into existing companies.",
    "localImage": "avatars/mena-speakers/linah-ali.webp"
  },
  {
    "sequence": 124,
    "slug": "linda-wambui---bitsavers-eduhub-and-trezor-academy-kenya",
    "name": "Linda Wambui",
    "title": "Founder, Local Organizer",
    "company": "Bitsavers Eduhub and Trezor Academy kenya",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911fdde8f909637df331e11_AsVFeVFX22c1qplRgNgXpUe-FmQe9CKeqJzNmTw9OTs.webp",
    "biography": "Linda Kariuki is a passionate Bitcoin educator and the local organizer of Trezor Academy Kenya, where she leads in-person Bitcoin education sessions to campus students and communities. She is also the founder of Bitsavers Eduhub, a platform focused on financial literacy and Bitcoin education, with a mission to promote Bitcoin as a store of value and tool for economic empowerment.With a strong emphasis on youth engagement and gender inclusion, Linda has spearheaded community-driven programs that demystify Bitcoin for students, women, and underserved populations. She has volunteered to teach Bitcoin at Afribit Kibera, an informal settlement in Nairobi, and served as a co-organizer of the Bitcoin Unconference Kenya, a grassroots gathering of Bitcoin builders and educators.Through her leadership, Linda is bridging global Bitcoin innovation with local African realities, creating initiatives like the Campus Caravan to foster inclusive participation, peer learning, and long-term Bitcoin adoption.",
    "localImage": "avatars/mena-speakers/linda-wambui.webp"
  },
  {
    "sequence": 125,
    "slug": "loren-asmus---utxo-management",
    "name": "Loren Asmus",
    "title": "Head of Capital Formation",
    "company": "UTXO Management",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f921c0f81cb39f3945f939_fhcbvYhPxcfvbIOS2gIa5G_jl2aD0qjs2IF6ijJXfNw.webp",
    "biography": "Loren is Head of Capital Formation at UTXO Management, where he is responsible for articulating the firm’s value proposition and addressing the needs of both current and prospective investors. Before joining UTXO Management, Loren spent over eleven years at Canterbury Consulting, an investment consulting firm overseeing $45 billion in assets under advisement. There, he was responsible for sourcing, underwriting, and monitoring investment managers across public and private markets. During his tenure, he served as Chair of the Fixed Income and Real Assets Manager Research Committees and Vice Chair of the Hedge Funds Committee. He was also a founding member of Canterbury’s digital assets working group. Loren is a CFA® charterholder and a Chartered Alternative Investment Analyst.",
    "localImage": "avatars/mena-speakers/loren-asmus.webp"
  },
  {
    "sequence": 126,
    "slug": "louise-reymond-corpus---million-miner",
    "name": "Louise Reymond Corpus",
    "title": "USA / UK Team Lead",
    "company": "Million Miner",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad6f611bd5d386c02373_Xj350fXtZA70nUiXPgdaUW4LMQ9SDNPtQCdDO-KCpPA.webp",
    "biography": "MillionMiner is the leading provider of professional mining hardware in Europe. With strong partnerships with industry leaders such as NiceHash, VoskCoin, EMCD and many more, MillionMiner not only offers first-class ASIC miners, but also exclusive access to events, mining pools and hosting services worldwide. Whether you are new to mining or a professional, we combine state-of-the-art technology with reliable support, fair prices and an international network for sustainable mining success.",
    "localImage": "avatars/mena-speakers/louise-reymond-corpus.webp"
  },
  {
    "sequence": 127,
    "slug": "luca-infeld---munich-international-mining",
    "name": "Luca Infeld",
    "title": "Fouder",
    "company": "Munich International Mining",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e68ee7f5029b72c2c3c4_0391d286a78d9db92f85aba6.webp",
    "biography": "Co-Founder & CBDO at Munich International Mining LLCBio: Luca is a testament to the power of hard work, dedication, and a relentless pursuit of one's passions - Bitcoin Mining. He is always on the lookout for new opportunities and ways to expand his mining operation. Luca's travels have taken him around the world, where he has forged valuable partnerships with other like-minded individuals and organizations.As a trusted partner to many people, Luca has built a reputation for his reliability, honesty, and integrity. His commitment to decentralization and democratizing the space has opened up new opportunities for people around the world to participate in the mining process.",
    "localImage": "avatars/mena-speakers/luca-infeld.webp"
  },
  {
    "sequence": 128,
    "slug": "luthando-ndabambi---bitcoin-ekasi",
    "name": "Luthando Ndabambi",
    "title": "Project Community Leader",
    "company": "Bitcoin Ekasi",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dff23e1ffd62104c782636_w28uqY-x6q-boNRGe-vnH3cITFiWOuCV8tDeaYnLXBU.webp",
    "biography": "Luthando Ndabambi currently serves as Community Director (or Project Community Lead) for Bitcoin Ekasi — an initiative focused on Bitcoin adoption and financial inclusion in South Africa.Earlier, he joined The Surfer Kids (a surf coaching / youth engagement programme) in May 2019 as a surf coach.Over time, he expanded his work into the Bitcoin space (around August 2021) by learning about Bitcoin and helping onboard township shops to accept Bitcoin as payment.",
    "localImage": "avatars/mena-speakers/luthando-ndabambi.webp"
  },
  {
    "sequence": 129,
    "slug": "madeline-morning---the-bitcoin-conference",
    "name": "Madeline Morning",
    "title": "Programming Associate",
    "company": "The Bitcoin Conference",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e814fcf2a328d5a05d9932_57037394f11a9287821c6c5a.webp",
    "biography": "When I’m not planning conferences, chances are I’m reading a book about bitcoin and drinking a cozy beverage.",
    "localImage": "avatars/mena-speakers/madeline-morning.webp"
  },
  {
    "sequence": 130,
    "slug": "manash-goswami---synteq-digital",
    "name": "Manash Goswami",
    "title": "Chief Financial Officer",
    "company": "Synteq Digital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f1513332f8cd72d1a4f440_kBqAX5cazLNyrpq5RDuk48S3ZL3F9lW9JON7vU8_5Qs.webp",
    "biography": "Manash Goswami, CPA, CFA, MBA, is Chief Financial Officer at Synteq Digital. With over 25 years of experience across technology, power, logistics, e‑commerce, and capital markets, he leads all financial operations and strategy, including budgeting, forecasting, and reporting, to support business growth.",
    "localImage": "avatars/mena-speakers/manash-goswami.webp"
  },
  {
    "sequence": 131,
    "slug": "maria-vovchok---dubai-blockchan-center",
    "name": "Maria Vovchok",
    "title": "Head of BD&Media Lead",
    "company": "Dubai Blockchain Center",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c2e69c4fe7d0072ea533fb_48b23fe8dabf36bdbec1c9eb.webp",
    "biography": "Maria Vovchok is an accomplished media professional and distinguished conference MC with over a decade of experience in media and more than eight years in blockchain, fintech, and Web3 communications.Recognized for her articulate and insightful approach, Maria bridges complex technological subjects with broad and diverse audiences across global markets.She began her Web3 journey as a news editor and anchor at several blockchain media outlets, later transitioning into marketing and PR roles within blockchain companies. Over the years, she has built strong relationships with VC funds, angel investors, and startup founders.Maria has served as an MC and moderator at numerous tech and business conferences worldwide. Her distinguished presence has been sought by premier events such as TOKEN2049, Hong Kong FinTech Week, LEAP Riyadh, and more. She also served as Managing Director of the World of Web3Summit, and was a contributing TV host at Moniify.Currently, Maria is the Head of Business Development & Media Lead at the Dubai Blockchain Center, where she also hosts the Encrypted podcast, interviewing top voices in the Web3 ecosystem. She has also recently joined Gate as a Digital Producer & Host.Beyond her professional work, Maria holds an ambassadorial rolewith the Blockchain Association of Ukraine, and has been honored as one of the Top 25 Women in Fintech & Blockchain in MENA by DX Talks.",
    "localImage": "avatars/mena-speakers/maria-vovchok.webp"
  },
  {
    "sequence": 132,
    "slug": "mark-artymko---ocean",
    "name": "Mark Artymko",
    "title": "President & Co-founder",
    "company": "OCEAN",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6903c72c332a2774454375f0_MUpR2Wv1kSk1dec5YT_hTtFRhV-w4TaTB6GUAN9moH4.webp",
    "biography": "Mark is the President and co-founder at OCEAN, a leading Bitcoin mining pool focused on decentralization, by empowering miners to reclaim their prominent position in the Bitcoin ecosystem. Mark is a former electrical engineer and utility executive, having spent 2 decades in high voltage power system design and operations in Canada and the USA prior to becoming a full time Bitcoin entrepreneur. Mark is a father of 7 and advocate of Bitcoin as the freedom technology of our lifetime.",
    "localImage": "avatars/mena-speakers/mark-artymko.webp"
  },
  {
    "sequence": 133,
    "slug": "mark-connors---risk-dimensions",
    "name": "Mark Connors",
    "title": "CEO, Chief Macro Strategist",
    "company": "Risk Dimensions",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05e59cafe1c0cb58b0ef_LFhKIK4k1Yy8pRvo-_aNzvtFDYwyxKLMiwkeTjxr9X0.webp",
    "biography": "Mark Connors is the founder of Risk Dimensions, an OCRO (Outsourced Chief Risk Officer) advisory that integrates his 35 years of institutional investment and financing experience with the recent advancements of bitcoin and AI. His career spans trading desks, multi-strategy hedge funds, and client-facing data strategy roles at Credit Suisse.More recently, Mark led research at 3iQ during the 2022–23 crypto winter, where he applied behavioral finance, debt-cycle frameworks, and traditional risk models to contextualize the crisis—not as a protocol failure, but a failure of market participants.This cross-disciplinary perspective drives his current research and consulting practice that demonstrates bitcoin is no longer a speculative anomaly and warrants inclusion in any multi-asset portfolio across the risk-reward spectrum.",
    "localImage": "avatars/mena-speakers/mark-connors.webp"
  },
  {
    "sequence": 134,
    "slug": "mark-moss---satsuma",
    "name": "Mark Moss",
    "title": "Chief Bitcoin Strategist",
    "company": "Satsuma",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f1512aa7ee7334c28ad88c_Pbaa3pWYzERmYB2JYzydVDEp7-ryDre2UV8Pp7c1qH0.webp",
    "biography": "Mark Moss is a leading educator, investor, and entrepreneur dedicated to helping people navigate the changing financial landscape through Bitcoin. As one of the early adopters and advocates of Bitcoin, Mark has built a global following by breaking down complex economic and technological trends into simple, actionable insights. He hosts The Mark Moss Show, where he discusses Bitcoin Treasuries, teaches how Bitcoin is reshaping money, markets, and the global power structure. With decades of experience as a successful investor and business owner, Mark now focuses on empowering individuals and institutions to understand Bitcoin's role as sound money and atool for financial sovereignty.",
    "localImage": "avatars/mena-speakers/mark-moss.webp"
  },
  {
    "sequence": 135,
    "slug": "marko-tarman---nicehash",
    "name": "Marko Tarman",
    "title": "Lead Mining Manager",
    "company": "NiceHash",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f65180b2531f6cb5b4921d_Gq_w3Gw4OXzyiNhSblOc1d6xC53MkN_fe2l9gAZ8IW0.webp",
    "biography": "Marko's journey with Bitcoin began in its early days, allowing him to witness the evolution of mining from CPU-based to GPU and ASIC-based setups.Currently serving as the Lead Mining Manager at NiceHash, he has been with NiceHash since 2018​. At NiceHash, he focuses on managing and optimizing cryptocurrency mining products and operations.",
    "localImage": "avatars/mena-speakers/marko-tarman.webp"
  },
  {
    "sequence": 136,
    "slug": "mason-foard---meliuz",
    "name": "Mason Foard",
    "title": "Director of Bitcoin Strategy",
    "company": "Méliuz",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6903a7fff1deae49a4953041_79acfb51a6325aa8551f5ca7.webp",
    "biography": "Bitcoin investor for half a decade; founding member of MSTR True North, the leading podcast on Bitcoin treasury companies; and Director of Bitcoin Strategy at Méliuz, the first public Bitcoin treasury company in Brazil and Latin America.",
    "localImage": "avatars/mena-speakers/mason-foard.webp"
  },
  {
    "sequence": 137,
    "slug": "matt-cole---strive",
    "name": "Matt Cole",
    "title": "CEO",
    "company": "Strive",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69138e3ecd2418fc202fa745_X8omvvppiKX9llV-5L3maO7iRd2zcggRTmnYAcccHwc.webp",
    "biography": "Matt Cole has served as Chief Executive Officer (CEO) of Strive since April 2023 and serves as the Chairman of the Board.A long-time Bitcoin investor and advocate, Matt has extensive experience in institutional asset management and fixed income, having spent 15 years at CalPERS in global fixed income, where he oversaw over $70 billion in actively managed Fixed Income assets. Matt joined Strive Asset Management in May 2022 as Head of Investment Office & Global Fixed Income. He was promoted to Chief Investment Officer, Global Head of Fixed Income in February 2023 before also becoming CEO of Strive. As CEO, Matt is focused on delivering innovative Bitcoin solutions and transforming how Americans interact with Bitcoin, making it accessible, practical, and central to their financial futures, while Strive remains committed to empowering investors through its pro-shareholder focused equity ETFs and actively managed Fixed Income ETFs. Matt is a CFA charterholder and holds an MBA from California State University — Sacramento.",
    "localImage": "avatars/mena-speakers/matt-cole.webp"
  },
  {
    "sequence": 138,
    "slug": "maurizio-pedrazzoli---mr-m-podcast",
    "name": "Maurizio Pedrazzoli",
    "title": "Founder",
    "company": "Mr M Podcast",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68e69a9d8e7ef9fb76699821_ruQ8Dmx85587AW7VfFwz5y42JFBSFD67ADoOEoPdMYs.webp",
    "biography": "Maurizio is a seasoned Bitcoin enthusiast and host of the long-running podcast Mr M Podcast which has been exploring the world of Bitcoin. With over a decade of experience in the crypto space, Maurizio provides insightful analysis, interviews with industry leaders, and discussions on the latest trends and developments in the blockchain ecosystem.His passion for decentralisation and financial sovereignty continues to drive engaging conversations about the future of digital currencies.",
    "localImage": "avatars/mena-speakers/maurizio-pedrazzoli.webp"
  },
  {
    "sequence": 139,
    "slug": "max-guise---block-inc",
    "name": "Max Guise",
    "title": "Bitkey & Proto Lead",
    "company": "Block Inc.",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6925d8ae631e8a8c22f9410d_ecF3Wgk4vaN_fx3p2ve2RIfelHpLZ5Vsr1H7gWnAz_M.webp",
    "biography": "is Bitkey & Proto Lead at Block, leading the development of the company’s self-custody bitcoin wallet Bitkey as well as the modular mining system, Proto. Prior to assuming this leadership role, Max was Hardware Security Lead at Block where he built and led product security and security engineering teams responsible for protecting a wide range of Square products and for shipping critical components that powered many different levels of Square's technology stack",
    "localImage": "avatars/mena-speakers/max-guise.webp"
  },
  {
    "sequence": 140,
    "slug": "michael-ashby---algoquant",
    "name": "Michael Ashby",
    "title": "CEO",
    "company": "AlgoQuant",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6902797f70c9cd59bf3eb2a5_f512e4bffd4ed863fbe95347.webp",
    "biography": "Michael Ashby is an accomplished hedge fund and family office professional with 20 years of experience in the financial sector. He serves as CEO and CIO at AlgoQuant, a global quantitative trading firm. AlgoQuant manages internal capital, allocates to external managers and is building an asset management unit.",
    "localImage": "avatars/mena-speakers/michael-ashby.webp"
  },
  {
    "sequence": 141,
    "slug": "michael-martin---bank-julius-baer",
    "name": "Michael Martin",
    "title": "Senior Relationship Manager",
    "company": "Bank Julius Baer",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fa7b5f5b9c2eacfe914_OqUOPABgFnxzdaLX7lX1kdx87Xe5-Ym4SMCFfaMucig.webp",
    "biography": "Michael Martin is a leading expert in institutional crypto advisory and private wealth management, currently serving as Senior Relationship Manager for Digital Asset Banking at Bank Julius Baer, one of world’s most respected private banks. With a career spanning 20 years across global financial centers— including Zurich, London, and Dubai — Michael has helped bridge the gap between traditional finance and the rapidly evolving world of digital assets.At Julius Baer, he advises a global client base of entrepreneurs, family offices, and institutional investors on the seamless integration of crypto assets into long-term wealth strategies.At the intersection of regulation, innovation, and client-centric advisory, Michael empowers clients to access Bitcoin and digital assets through secure custody, financial products, and strategic portfolio solutions.Within the robust Swiss banking framework, Michael is shaping the future of digital asset banking — one relationship at a time.",
    "localImage": "avatars/mena-speakers/michael-martin.webp"
  },
  {
    "sequence": 142,
    "slug": "michael-peterson---bitcoin-beach",
    "name": "Michael Peterson",
    "title": "Director",
    "company": "Bitcoin Beach",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c8e0c5e7a5122094b648_JmYYDPXUmg_5vya-Ce4xFyCmLrsB6rp3HjHGbJrbvc4.webp",
    "biography": "Michael Peterson is the creative mind behind the Bitcoin Beach project that spurred the government of El Salvador to embrace Bitcoin as legal tender. The adoption of Bitcoin has put El Salvador in the spotlight as the unlikely catalyst to upend the worlds current monetary order established in Brenton Woods. Michael and his team have demonstrated how an open monetary system can overcome the challenges of bringing financial inclusion to those of the bottom rung of the economic ladder living in the most challenging of environments. In the past few years there have been hundreds of articles from major publications and dozens of film crews covering Bitcoin Beach and the revolution that it has sparked. The coverage of Bitcoin Beach from media giants like 60 Minutes and HBO have helped move the mainstream narrative about Bitcoin from “Bros and Lambos” to “financial inclusion and self sovereignty” for those previously trapped in destructive cycles of poverty.",
    "localImage": "avatars/mena-speakers/michael-peterson.webp"
  },
  {
    "sequence": 143,
    "slug": "mohammed-alshiekh---dema-energy",
    "name": "Mohammed Alshiekh",
    "title": "CTO",
    "company": "DEMA Energy",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dff238b5818815b84c527f_42nRNUC8jMyV8s-tm916x714pxKGeVDbugLbBWimcX8.webp",
    "biography": "Mohammed Alshiekh, CTO and co-founder of DEMA Energy, builds systems that use Bitcoin mining as a flexible grid-balancing load. With 15+ years in engineering and AI, he develops immersion-cooled mining infrastructure, fleet management systems, and VPP platforms that merge Bitcoin and energy innovation.",
    "localImage": "avatars/mena-speakers/mohammed-alshiekh.webp"
  },
  {
    "sequence": 144,
    "slug": "muhammad-rasoul---amana-capital",
    "name": "Muhammad Rasoul",
    "title": "CEO",
    "company": "Amana Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c030a1ca9f7161516abfcf_yVVTEWdUdwpbjj2Rgm7vTtYLE6wuEhFJ-vmoOsJT2IQ.webp",
    "biography": "As the CEO of amana, Muhammad Rasoul is a strong supporter of transparency, building financial literacy, and ensuring everyone has both the opportunity and the learning tools to scale the heights of the investment world. And by laying the groundwork for a more transparent approach to multi-asset trading and investing, he is steering amana into the forefront of a more innovative and accessible regional financial industry.Over the course of his 25-year career, Rasoul has established a global presence as a financial industry innovator and thought leader. His expertise as a growth strategist has been instrumental in the creation, expansion, and successful sale of multiple companies, including Gain Capital, GFT Markets, and B2B liquidity provider, Alpha. He has also advised the CFTC, NFA, ASIC, FCA, and FSA in Japan.Muhammad lives in Dubai with his wife, Sabina, and daughters Amirah and Alivia. In his spare time, he keeps in touch with Nadia, Yaseen, and Aiden, his three elder children, all of whom study and work in their native US. He is also an avid philosophy and history buff and can be found pouring over books about early American history. Last but not least, Muhammad is a fan of football and a long-time supporter of Chelsea Football Club!",
    "localImage": "avatars/mena-speakers/muhammad-rasoul.webp"
  },
  {
    "sequence": 145,
    "slug": "muslim-bitcoiner---bitcoin-majlis",
    "name": "Muslim Bitcoiner",
    "title": "Co-founder, Author",
    "company": "Bitcoin Majlis",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fb2151dfc7d84da6200_Or7MMS9gydX4A6PlId0QHgKHHldDEkzudaZkgKT4pzU.webp",
    "biography": "Muslim Bitcoiner is the co-founder of Bitcoin Majlis, a non-profit organization dedicated to educating Muslims about Bitcoin and exposing the dangers of fiat currency. He is the author of Anti-Riba Money: Dismantling Usury through Bitcoin, a recently published book that presents a compelling Islamic case for rejecting fiat and embracing Bitcoin. Active on both X and Nostr, he works to promote a deeper understanding of Bitcoin and its adoption within Muslim communities and organizations.",
    "localImage": "avatars/mena-speakers/muslim-bitcoiner.webp"
  },
  {
    "sequence": 146,
    "slug": "mu-aawiyah-tucker---meta-madeenah-llc",
    "name": "Mu’aawiyah Tucker",
    "title": "CEO",
    "company": "Meta Madeenah LLC",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691391732d61a58a20d9d140_9239e5c039aef503be363cb0.webp",
    "biography": "Mu’aawiyah Tucker has been engaged in educating, propagating and building on Bitcoin since 2017, and has a unique perspective of Bitcoin from an Islamic perspective due to being a specialist in Islamic Law.",
    "localImage": "avatars/mena-speakers/mu-aawiyah-tucker.webp"
  },
  {
    "sequence": 147,
    "slug": "igancio-pauls---ocean",
    "name": "Nacho Pauls",
    "title": "Chief Commerical Officer",
    "company": "OCEAN",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6921aed6230e5b5a166f4b8a_753f5ad2724d341aa81230e3.webp",
    "biography": "Bitcoin advocate. Argentine-born, retired athlete, great at teambuilding, full-time learner and resilient.",
    "localImage": "avatars/mena-speakers/nacho-pauls.webp"
  },
  {
    "sequence": 148,
    "slug": "naser-el-agha---cryptominers-intl-group",
    "name": "Naser El Agha",
    "title": "CEO",
    "company": "CryptoMiners Intl' Group",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911fe1533615bf5ba0d75dc_S3ekV7Ruf7bjyOdYDNprVDSK_dU9dBw_9xQ-HIK4pBc.webp",
    "biography": "Naser El Agha is a seasoned leader with over five years of experience in the Bitcoin and cryptocurrency mining industry. As CEO, he has played a pivotal role in building, scaling, and optimizing mining operations across multiple regions, with a strong focus on infrastructure development, energy efficiency, and sustainable growth.His expertise spans mining infrastructure design, large-scale project execution, energy optimization, and regulatory strategy. Under his leadership, the company has successfully developed state-of-the-art mining farms, introduced advanced air and hydro cooling systems, and secured strategic government contracts and partnerships.Beyond operations, Naser has been instrumental in expanding the company’s footprint by establishing new franchises and regional branches. He continues to advocate for responsible mining practices and works closely with regulatory bodies to shape policies that support innovation and energy-efficient blockchain adoption.Driven by a vision to position Bitcoin mining as a sustainable and strategic industry, Naser combines technical knowledge with business foresight. A perfect balance between energy infrastructure and digital finance.",
    "localImage": "avatars/mena-speakers/naser-el-agha.webp"
  },
  {
    "sequence": 149,
    "slug": "neil-jacobs---fomo21",
    "name": "Neil Jacobs",
    "title": "Founder",
    "company": "FOMO21",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dd461fc611e7a64156b13d_VTlH-8kyEaIzMxXTWPWtr8FfS2IlK_A53h0NbXuKAcI.webp",
    "biography": "Neil Jacobs is a leading marketing strategist, educator, and content creator in the Bitcoin industry. With a big-four CPA background and 150,000 social media followers, he has driven brand and revenue growth for prominent Bitcoin companies, including co-founding FOMO21.com—which has served customers in over 70 countries—and previously serving as Head of Brand Engagement at Swan Bitcoin.Neil’s Bitcoin journey began over a decade ago and he became a vocal advocate in the years that followed. Since then, he has hosted podcasts like Inside Bitcoin and served on the Board of Directors for SatsCenter, a nonprofit advancing Bitcoin education. Neil combines financial expertise with strategic vision to champion Bitcoin and foster its adoption globally.",
    "localImage": "avatars/mena-speakers/neil-jacobs.webp"
  },
  {
    "sequence": 150,
    "slug": "niko-jilch---binifico-gmbh",
    "name": "Niko Jilch",
    "title": "Founder",
    "company": "Binifico GmbH",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e69d51cb40513f6bd1dd_LWDqnb2xQSwtZ-JIctQriAm_GO1Q79wtIJYdvlbLHI0.webp",
    "biography": "Niko is the founder and CEO of digital media company Binifico.He runs one of the most popular podcasts and YouTube channels on the topic of Bitcoin in the German speaking world: \"Was Bitcoin bringt\".His popular English newsletter is called \"Fix the money\".Niko is a sought-after speaker at conferences in Europe and internationally.",
    "localImage": "avatars/mena-speakers/niko-jilch.webp"
  },
  {
    "sequence": 151,
    "slug": "nolan-bauerle---roxomtv",
    "name": "Nolan Bauerle",
    "title": "Host",
    "company": "RoxomTV",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad555cdcfb3670954168_2caa22ceba043d9cc7b29dba.webp",
    "biography": "Nolan Bauerle writes, produces, and creates content related to our shift to a Bitcoin standard as a measure of economic production.",
    "localImage": "avatars/mena-speakers/nolan-bauerle.webp"
  },
  {
    "sequence": 152,
    "slug": "obi-nwosu---fedi",
    "name": "Obi Nwosu",
    "title": "CEO",
    "company": "Fedi",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa2efc8f300eead619cb_R_YGpqW6AKKIZWS3UsJB9SPnY8Rv_jp2-txOp6fLjXc.webp",
    "biography": "Obi Nwosu is cofounder and CEO of Fedi and a zealous advocate for Bitcoin mass adoption. He previously founded the Bitcoin exchange Coinfloor, and holds board positions at ₿trust and Gridless Compute.",
    "localImage": "avatars/mena-speakers/obi-nwosu.webp"
  },
  {
    "sequence": 153,
    "slug": "olga-kochmar---bitfufu",
    "name": "Olga Kochmar",
    "title": "Commercial Director",
    "company": "BitFuFu",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691dd269fed90b883407ed7a_nw9jG6_Dmn2TvW3FIIugiopQolRoJhrehPi7L5U-AjY.webp",
    "biography": "Commercial Director at BitFuFu, overseeing the company’s energy partnerships and infrastructure development, while driving vertical integration across the company’s technology and operations. BitFuFu (Nasdaq: FUFU) is a leading platform in Bitcoin mining and mining services—combining self-mining, hosting, and cloud hashrate with an integrated stack to deliver efficient, resilient, and grid-responsive compute at scale.",
    "localImage": "avatars/mena-speakers/olga-kochmar.webp"
  },
  {
    "sequence": 154,
    "slug": "omar-al-yousif---coinw",
    "name": "Omar Al Yousif",
    "title": "Board Member",
    "company": "CoinW",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d8de96c5cb20d6ea0cd_aak3OyLG9NoQ3O1NdDbl16j6C_6v2F_KFjVNe1QKcoU.webp",
    "biography": "Omar Al Yousif is an engineer, investor, and capital markets specialist with a background in project management. He has been pioneering and managing major digital and smart infrastructure projects across the Middle East, in addition to leading high-profile digital asset treasury initiatives in Tokyo, Hong Kong, London, and Nasdaq.As Deputy Chairman of 7-E Emirates Holding and Partner at 10X Capital, Omar works on bridging capital markets between Asia and the Gulf, structuring cross-border listings, and advising on public market strategies. His career includes senior leadership roles at Siemens AG and Etihad Rail, where he spearheaded multi-billion-dollar infrastructure, technology, and mobility projects across the MENA region.With deep government and corporate networks, Omar is recognized for his ability to unite strategic stakeholders, drive innovative investment models, and advance transformative projects across industries from rail to blockchain.Education: MSc in Major Program Management, University of Oxford; BSc (Hons) in Construction & Project Management, University of London",
    "localImage": "avatars/mena-speakers/omar-al-yousif.webp"
  },
  {
    "sequence": 155,
    "slug": "paul-boots---virtual-assets-regulatory-authority-vara",
    "name": "Paul Boots",
    "title": "Head of Sector Development",
    "company": "Virtual Assets Regulatory Authority (VARA)",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691c7ed71ecbf266e80dfb33_4Cv7FckE4-Axg_MN9V_OSr5KVpAAxDVSV1kSqSN2MuA.webp",
    "biography": "BIOGRAPHYPaul Boots - Head of Sector Development, Virtual Assets Regulatory Authority (VARA)Paul Boots, Head of Sector Development at the Virtual Assets Regulatory Authority (VARA), brings with him a wealth of experience as a senior executive and entrepreneur with a proven track record in innovation, leadership, and market development. With a diverse background spanning financial services, strategy, and technology, Paul has been instrumental in shaping the Middle East’s peer-to-peer financing landscape, notably as the founding Group COO at Beehive, where he pioneered one of the region's first peer-to-peer lending platforms. His entrepreneurial expertise also extends to co-founding a boutique advisory firm that focuses on leadership development and strategy for large UAE-based companies, with a special focus on AI-driven technologies.Before these ventures, Paul played a key role in the executive leadership team at the Dubai Multi Commodities Centre (DMCC), where he was instrumental in establishing Dubai as a global hub for trade across multiple industries. During his tenure, he conceptualized and built DMCC’s commodity trade finance platform, which facilitated Islamic banking partnerships. More recently, Paul led the development of a large B2B marketplace on behalf of the Investment Corporation of Dubai, further showcasing his ability to build innovative platforms that drive economic growth.A graduate of Babson College, Paul’s passion for leadership, entrepreneurship, and building high-performing teams is central to his approach. His appointment at VARA aligns with Dubai’s strategic goals under the D33 agenda, as Paul’s leadership in sector development will play a critical role in positioning the Emirate as a global leader in the virtual assets space. His unique blend of strategic insight and operational expertise are pivotal as VARA continues to shape the future of virtual asset regulation and innovation.",
    "localImage": "avatars/mena-speakers/paul-boots.webp"
  },
  {
    "sequence": 156,
    "slug": "paul-dawalibi---innovation-city",
    "name": "Paul Dawalibi",
    "title": "CEO",
    "company": "Innovation City",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05ee2f2a2aeac84937f1_fT3AATfjAadrmomxIM1cPegGXMcCRNJfOgeTY6StTSc.webp",
    "biography": "Paul Dawalibi is a technology entrepreneur, investor, unicorn founder, futurist and gamer, with over 25 years of venture capital and startup experience. He is currently the CEO of Innovation City, the world’s first free zone fully powered by artificial intelligence (AI) in the UAE, where he is building the Silicon Valley of the Middle East in Ras Al Khaimah. Previously, he was CEO of Holodeck - the leading global media and technology company focused on gaming, esports and web3. His ability to communicate the business opportunity around innovation has made him the largest industry influencer and expert in the MENA region. Paul is the host and creator of Game Changers - a groundbreaking business show on CNBC Arabia reaching 50M homes in the Middle East. He is a frequently requested speaker at tech, startup, web3, and gaming conferences all around the world. He consults family offices, governments, investors, and global companies on startups and building innovation ecosystems. Paul is also the creator of the world's 1st esports NFT and founder of the 2020 fastest growing company in Canada. He believes that the future is fun™.On TV and in media:• My content is consumed daily and trusted by millions in 66 countries around the world, and am widely recognized as the thought leader in the region for startups, tech and gaming.• Host & Creator of “Game Changers” – the most exciting weekly show on CNBC Arabia focused on gaming, esports and the metaverse, reaching 50M homes in the MENA region.• Host & Creator of the world-famous Business of Esports podcast - the largest esports and gaming industry outlet and the only authority on the business side of the gaming/esports industry.Live and in person:• Chairman of the 1st ever Dubai Esports Festival (now called GameExpo)• Invited to speak at the biggest innovation and technology conferences in the world - Next World Forum (KSA), PAX East, Esports Business Summit, World Metaverse Forum, GITEX, SALT, Crypto Bahamas, DIFCFintech Week, World Corporate Summit, Step, LEAP, TMRW, World AI Show, Future Blockchain Summit, RetailME Icons, Fast Company: World Changing Ideas, Dubai Future Forum, Ignite, World Blockchain Summit, Web Summit, AIM Congress, MIT NextTech Summit, etc…• Retained as a startup, web3, AI, gaming, and esports expert bycompanies, family offices, governments, and investors around the world.• Professor of esports business at Saint Peter's University In books• Author of Metaverse Dream – landmark metaverse book published by Assouline.• Wrote the foreword for the best-selling esports business book of all time (The Book of Esports)• As a VC, I've been talking about gaming, esports and the metaverse since 2011. At work (recent)• Building the Silicon Valley of the Middle East and a global hub for innovation in Ras Al Khaimah• Architect of a world-class gaming investment program for Abu Dhabi (DCT / ADGaming)• Member of the Dubai Program for Gaming Working Group, charting the direction and future of the gaming industry in Dubai• Advisor to Dubai Police on gaming and esports strategies• Consulted as a subject matter expert on the concept & business model for Qiddiya (KSA gaming district)• Consulted with Dubai Health Authority on the metaverse and gamification ofhealthcare and was recognized by the Director General of DHA• Developed the gaming content strategy for GITEX / Future Blockchain Summit• Expert on building early stage tech, gaming and venture ecosystems",
    "localImage": "avatars/mena-speakers/paul-dawalibi.webp"
  },
  {
    "sequence": 157,
    "slug": "pavlenex---btcpay-server-stratum-v2",
    "name": "Pavlenex",
    "title": "Product Manager",
    "company": "BTCPay Server, Stratum V2",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f636b0b3c36c1fc22d1c31_2bd1144b5a6f93d710e02bab.webp",
    "biography": "Pavlenex is a product manager dedicated to accelerating Bitcoin adoption through open-source payment solutions and mining infrastructure. He currently leads product strategy at BTCPay Server, an open-source payment processor, and Stratum V2, a next-gen mining protocol focused on enhancing decentralization and efficiency in mining. He is also a grantee of Spiral, a non-profit initiative by Block (formerly Square), founded by Jack Dorsey, dedicated to supporting free and open-source Bitcoin projects. He co-founded HUB21, one of the first physical Bitcoin hubs and BitcoinSmiles, a non-profit initiative providing dental healthcare to impoverished communities in rural El Salvador, Pavlenex actively contributes to both technological advancement and social impact within the Bitcoin ecosystem.",
    "localImage": "avatars/mena-speakers/pavlenex.webp"
  },
  {
    "sequence": 158,
    "slug": "pedro---bitcoin-conference",
    "name": "Pedro",
    "title": "Designer",
    "company": "Bitcoin Conference",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f1513332f8cd72d1a4f443_zl_cOSLSwwQsT72Kv8u0XpEmaUKHVS_surzsMnyyOdI.webp",
    "biography": "Pedro is a designer and developer for the Bitcoin Conference. In addition to extensive contributions to no-KYC open source projects like Bisq and Mempool, he's directing the film Anatomy of Bitcoin, leads the design for the SatSigner project, founded the research and publishing house PirateHash, and co-founded the lighting game Chain Duel.",
    "localImage": "avatars/mena-speakers/pedro.webp"
  },
  {
    "sequence": 159,
    "slug": "peter-abou-hachem---hub71",
    "name": "Peter Abou Hachem",
    "title": "Head of Growth and Strategy",
    "company": "Hub71",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6924839470a4b09348a3a573_FDhtSt8Wrm9meNB3ALwruvRoSWoegm9C4w1AASY557U.webp",
    "biography": "Peter is a key member of the Hub71 team, leading on Strategy and Product Development.In his current role, Peter plays an integral role in designing new products and programs for the Hub71 ecosystem as well as identifying the right partners that could activate such programs.A key part of Peter’s role is identifying synergies between startups, corporates, government entities, universities, global hubs and programs. Matchmaking entities based on identified synergies is a key role in enabling a fully functional tech ecosystem. Peter has been part of designing and launching programs such as Corporate Engagement Program, Ventures Lab, Value Creation, Academia Engagement, Banking Products for startups, The Outliers and many more.Prior to joining Hub71, Peter was a Project Manager at Roland Berger Strategy Consultants. As a consultant, Peter worked on building tech ecosystems, developing country-wide strategies, building new ventures, driving partnerships between private and public sectors as well as digital transformation and restructuring. This previous experience allows Peter to play a key role in shaping Hub71’s strategy.Peter holds a bachelor’s degree in Civil and Environmental Engineering from the American University of Beirut (Beirut, Lebanon) as well as a Machine Learning certificate from Stanford University (California, USA).",
    "localImage": "avatars/mena-speakers/peter-abou-hachem.webp"
  },
  {
    "sequence": 160,
    "slug": "peter-duan---bull-standard",
    "name": "Peter Duan",
    "title": "Founder",
    "company": "Bull Standard",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e084d902e80b9325c12ed_YDzBlxOFyjMFyuVP-VipV7ZJpaikDbpxe-m3jOZCoig.webp",
    "biography": "Ex-TradFi professional with 14 years of experience spanning Structured Finance at Cantor Fitzgerald, Investor Relations for an S&P 500 company, and Wealth Management. Now focused on bridging Bitcoin and traditional capital markets through the emerging Bitcoin Treasury Company movement.",
    "localImage": "avatars/mena-speakers/peter-duan.webp"
  },
  {
    "sequence": 161,
    "slug": "philip-rage---soter",
    "name": "Philip Rage",
    "title": "Head of Underwriting",
    "company": "Soter",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad6f611bd5d386c02376_f38Dr72uqP3FWgu1YAjJQl27djrrg0n7gloiuoqChk0.webp",
    "biography": "Philip Rage is a London-based insurance executive and digital assets specialist with a strong focus on cryptocurrency risk management. He has built a career in strategy, innovation, and underwriting within the (re)insurance sector, previously at firms like Aon.Currently Head of Underwriting at Soter Insure, a company specializing in digital asset insurance, Philip bridges traditional finance and crypto by providing coverage for Bitcoin in financial services.His work helps institutionalize Bitcoin custody and DeFi through specialized insurance products, making him a key figure in onboarding traditional capital to the space.",
    "localImage": "avatars/mena-speakers/philip-rage.webp"
  },
  {
    "sequence": 162,
    "slug": "prince-filip-of-serbia---jan3",
    "name": "Prince Filip of Serbia",
    "title": "Chief Strategy Officer",
    "company": "JAN3",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dc3fa1436747db485e13ba_d2240af13deaf50967b197c3.webp",
    "biography": "HRH Hereditary Prince Filip Karađorđević of Serbia serves as the Chief Strategy Officer (CSO) at JAN3, a global financial technology company. After a 13-year career in traditional finance, Prince Filip joined JAN3, driven by his belief in Bitcoin’s potential to deliver financial freedom and sovereignty to billions worldwide.Prince Filip advocates for strong individual property rights and financial freedom through Bitcoin, while promoting legal frameworks that enable economic empowerment for the unbanked. A frequent guest speaker at prestigious international conferences, he engages with heads of state, legislators, monarchs, politicians, and C-suite executives.Prince Filip envisions a new Renaissance, catalysed by Bitcoin, for Serbia and the wider world. Through his foundation in Serbia, he actively promotes Christianity, cultural heritage, financial literacy, the arts, technology, and family values.",
    "localImage": "avatars/mena-speakers/prince-filip-of-serbia.webp"
  },
  {
    "sequence": 163,
    "slug": "rachel-conlan---binance",
    "name": "Rachel Conlan",
    "title": "CMO",
    "company": "Binance",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911ffacf8db2ab8eb072a6b_66163cb6f25fdacabda3c745.webp",
    "biography": "Rachel Conlan, a visionary marketer and entrepreneurial strategist is the driving force behind Binance's global marketing and brand campaigns. As Binance embarks on its ambitious journey to reinforce and broaden its standing as the world's most trusted cryptocurrency brand, Rachel's leadership is instrumental. Before joining Binance, Rachel was a transformative figure at OKX, spearheading brand and marketing initiatives that included the negotiation and launch of high-profile international partnerships with Manchester City F.C., McLaren Racing, and Tribeca Festival. Her strategic insights and knack for partnership creation have left indelible marks on the brand. Rachel's vast experience extends to her tenure at CAA Sports, a leading international sports and entertainment agency, where she held the reins of Global Partnerships. She developed innovative brand partnerships and cultural marketing programs, bridging global brands, rights holders, and talent, adding immense value and contributing to CAA's market influence. As the Global Chief Marketing Officer for Havas, the sixth-largest communications company within the Vivendi conglomerate, Rachel demonstrated exceptional leadership. She was entrusted with enhancing Havas' reputation and revenue, crafting integrated marketing and experiential platforms for Fortune 500 companies that set industry benchmarks. In addition to her role as CMO, Rachel's contributions to Havas spanned various leadership positions. As Managing Director of Havas Luxhub, she led strategic and commercial operations, fostering pioneering strategies for luxury, fashion, and lifestyle companies to engage and retain a new generation of consumers. Her client portfolio boasted iconic brands like LVMH, PUIG, Sotheby's, Net-a-Porter, Netjets, and Kit and Ace. Rachel's strategic prowess was further displayed in her role as Havas' Global Growth Director. She orchestrated a comprehensive global new business development and marketing plan for the network. Notably, Rachel was part of the visionary team behind Havas' 2012 rebrand from Euro RSCG Worldwide, establishing a new standard for Havas Group's transformation. Rachel resides in Abu Dhabi, UAE with her husband and toddler son.",
    "localImage": "avatars/mena-speakers/rachel-conlan.webp"
  },
  {
    "sequence": 164,
    "slug": "rahim-taghizadegan---deedsats",
    "name": "Rahim Taghizadegan",
    "title": "CEO",
    "company": "Deedsats",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b638dc64b755698d9ae9_7nft8uflwoyr95y_2ulqj8_lcg2NIIqB9DhK9PGwM74.webp",
    "biography": "Rahim Taghizadegan is the last Austrian economist of the Austrian School in the direct tradition, teaching at universities in Austria, Switzerland, Liechtenstein, and Germany. Author of over 15 books, he was the first economist to teach about Bitcoin at university. He is the founder of scholarium.at, based in Zug, building Bitcoin citadels and educational hubs around the world, and of deedsats.com, building privacy-friendly solutions for digital assets on RGB and Bitcoin.",
    "localImage": "avatars/mena-speakers/rahim-taghizadegan.webp"
  },
  {
    "sequence": 165,
    "slug": "raj-maitra---bitshala",
    "name": "Raj⚡ Maitra",
    "title": "CEO",
    "company": "Bitshala",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691c8553c6e24a0ebc526da9_40bf5445b45ff5652c85a5e7.webp",
    "biography": "Pre-Bitcoin:Graduated M.Tech in Structural Engineering in 2016, from IIT Madras.Worked as a professional Structural Engineer for offshore oil rigs, water treatment plants, bridges, and metro viaducts. 2016-2021.Found Bitcoin in 2017 at the dusk of the Blocksize War. Fell in love with the whole idea and started studying deeper. My journey has been entirely self-taught, where I taught myself the history of money, the principles of Austrian economics, and eventually cryptography and maths.Over time the Bitcoin obsession became so big, that I started learning to code. Eventually, I became good enough to start contributing to Bitcoin FOSS projects. Which landed my first part-time gig at RGB and my first little contributions to Bitcoin Core, in 2020.My journey self-studying at that time I documented in this blog: https://www.citadel21.com/from-hello-world-to-bitcoin-coreLeft my structural engineering career completely to work on Bitcoiin full-time by being blessed as the first recipient of the Spiral Dev Grant from India, in 2021.Since then my passion for Bitcoin has led me into an ongoing rabbit hole and it has become my life mission to contribute back to the Freedom Industry, in whatever way best I can.Post Bitcoin:Developer Works:Bitcoin Core Contributor: 2020-2021Developer at RGB: 2020-2021Developer at BDK: 20021-2023Lead Dev and PM in Coiinswap: 2023 onwards.Community Works:Cofounded the first Indian Bitcoin-Only Telegram channel: 2018.Organized the first Bitcoin-Only Meetup in Bangalore: 2019.Organized the first Biitcoiin-Only meetup in Goa: 2022.Organized the Technical Track of the first Bitcoin-Only Conference in India: 2022.Educational Works:Mentor at Summer of Bitcoin: Since 2022Started building Bitshala: 2023.Blogs: https://rajarshi149.medium.com/Bitshala:At Bitshala we organize a package of educational activities to train the upcoming Bitcoin developers. We offer a roadmap to aspiring developers, reducing the barrier to entry in Bitcoiin FOSS, and finally get them started with a paid Felklowshiip Program to start professional contributions to real Biitcoiin FOSS projects.Find more details here: https://bitshala.org/My Twitter: https://x.com/RajarshiMaitraPresentation Description:The presentation will be on Bitshala, explaining its objective, mission, and models.I will brief about all the programs we take up at Bitshala. The roadmap to becoming a Bitcoin development, and how people can start getting involved.I will talk a bit about the FOSS Dev mindset, soft-skills required to be a FOSS dev, and tips on selecting FOSS projects to start contributing.The talk concludes with a concrete roadmap for aspiring developers in the room to start taking Bitcoin FOSS as a viable career alternative.",
    "localImage": "avatars/mena-speakers/raj-maitra.webp"
  },
  {
    "sequence": 166,
    "slug": "rami-alsridi---mining-grid",
    "name": "Rami Alsridi",
    "title": "Founder & CEO",
    "company": "Mining Grid",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c949c8010f9258ccf6f8_a2guBYnAcSBYkxhzYhiK4dQP6QxyTfKhiwObeBgd-TU.webp",
    "biography": "My Bitcoin journey began unexpectedly in 2017 while working as a cybersecurity consultant. A client had fallen victim to a cyberattack, with the hackers demanding payment in Bitcoin—a currency I knew little about at the time. This experience sparked my curiosity as a computer engineer passionate about transformative technology, leading me to explore Bitcoin’s potential. After delving into research and connecting with colleagues, I met a tech-savvy friend who was already mining Bitcoin and coding Ethereum smart contracts, which deepened my interest. As the founders of Miningrid, we created a platform that simplifies Bitcoin mining through a secure, non-custodial wallet, making it accessible to all. My mission is to empower others by making Bitcoin mining and its ecosystem both understandable and approachable",
    "localImage": "avatars/mena-speakers/rami-alsridi.webp"
  },
  {
    "sequence": 167,
    "slug": "redouane-elkamhi---goat-network",
    "name": "Redouane Elkamhi",
    "title": "Professor of Finance & Core Contributor",
    "company": "GOAT Network",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea67164f559a3412d148e_vGwtl_pFm-r6R_8e30GbwUYt6L6yW-nRXYctHeq_qpI.webp",
    "biography": "Redouane Elkamhi is a Professor of Finance at the Rotman School of Management, University of Toronto, and a renowned expert in strategic and tactical asset allocation, cryptocurrency, and decentralized finance. He served as the inaugural co-director of the Finance Lab at the Rotman Financial Innovation Hub, where he spearheaded initiatives in blockchain, decentralized finance, and crypto-ventures.With over two decades of experience, Professor Elkamhi has been a trusted senior advisor to several of Canada’s largest pension funds, providing insights into total fund management and innovative investment strategies. His research has been presented at premier academic and industry conferences and published in leading finance and economics journals.Professor Elkamhi's contributions to the field have earned him numerous accolades, including the prestigious Shimomura Fellowship from the Development Bank of Japan and Excellence in Research Awards from the University of Toronto and the University of Iowa. He has also received multiple Best Research Paper Awards from esteemed organizations and journals, such as ICPM, PCAM, AFFI, GARP, IFM2, the Review of Financial Studies, and the Review of Asset Pricing Studies.",
    "localImage": "avatars/mena-speakers/redouane-elkamhi.webp"
  },
  {
    "sequence": 168,
    "slug": "robbie-maltby---bitcoin-studios",
    "name": "Robbie Maltby",
    "title": "Full Stack Marketer",
    "company": "Bitcoin Studios",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa286d83ee45cd6493fb_DnHKeo6eGEL4qp71hAviHUNssMdzM6fma7DjnvvD6mg.webp",
    "biography": "Full-stack fiat marketer turned Bitcoiner. Supporting Bitcoin-native builders to find product–market fit while building my own under Bitcoin Studios — current projects: Bitcoin Works (land-based startup society) and Bit Mortgage (Bitcoin-backed mortgage provider).",
    "localImage": "avatars/mena-speakers/robbie-maltby.webp"
  },
  {
    "sequence": 169,
    "slug": "robert-warren---bitcoin-park",
    "name": "Robert Warren",
    "title": "Head of Research and Education",
    "company": "Bitcoin Park",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691c8381682d1687f181f7f5_GGRyCpj7_H_B20q6ATroPb-8mpKwZ4okrPxYhB9S30g.webp",
    "biography": "Robert Warren is a builder with experience in, product, operations, and research. His technical training in Philosophy and Psychology, and a Master's in Education, positions him to explain and share freedom technologies and their cultural implications. He currently contributes at Bitcoin Park, leading Research, Education, and Programming and authored the Bitcoin Miner's Almanac",
    "localImage": "avatars/mena-speakers/robert-warren.webp"
  },
  {
    "sequence": 170,
    "slug": "robin-seyr---robin-seyr-podcast",
    "name": "Robin Seyr",
    "title": "Founder & Host",
    "company": "Robin Seyr Podcast",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c8ee765ea05df5f778b0_KANnJJW8UIVooRjlAorwY2Pq5GFWnZxI-4p-a8dk55o.webp",
    "biography": "Daily Bitcoin Podcast Host. All-In Bitcoin since he is 21 years old and committed to interview every day a Bitcoiner in the next 10 years!",
    "localImage": "avatars/mena-speakers/robin-seyr.webp"
  },
  {
    "sequence": 171,
    "slug": "rohan-hirani---bitcoinquant",
    "name": "Rohan Hirani",
    "title": "Co-Founder",
    "company": "BitcoinQuant",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68eea67164f559a3412d148a_c1BszcAoa6XOMLSQ7Hag2ydHD7XT18T2KO1XNMrrBm0.webp",
    "biography": "Rohan Hirani is the Co-Founder of BitcoinQuant, a data platform focused on bringing greater transparency to Bitcoin treasury investors. Prior to building BitcoinQuant, he was a Strategy Consultant at Bain & Company, where he specialized in private equity market analysis across software and wealth management.",
    "localImage": "avatars/mena-speakers/rohan-hirani.webp"
  },
  {
    "sequence": 172,
    "slug": "roman-martinez---bitcoin-beach",
    "name": "Roman Martinez",
    "title": "Cofounder",
    "company": "Bitcoin Beach",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f2c600cb1fc3818b2cc42_xhPCPWUV3fnEM362Hei0bBtsWiFx9zqY9w3ubgzmKAY.webp",
    "biography": "Community Leader at BitcoinbeachCo-founder GoodLifeElSalvadorCo-founder Bitcoinbeach",
    "localImage": "avatars/mena-speakers/roman-martinez.webp"
  },
  {
    "sequence": 173,
    "slug": "roya-mahboob---digital-citizen-fund",
    "name": "Roya Mahboob",
    "title": "CEO",
    "company": "Digital Citizen Fund",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68cd7150c7723bfc76c8095d_Sd-IJy3o80C-q0w4X0a8bpE8qJOui8vbOnaMP8cdv_4.webp",
    "biography": "Roya Mahboob is an entrepreneur and Afghanistan’s first female tech CEO, but her impact extends far beyond the sphere of business. Ms. Mahboob has used her success and tech expertise to help educate and empower Afghan women and girls, and she has been an outspoken advocate for their rights. She founded the Digital Citizen Fund (DCF), which aims to increase Afghan women’s technological and financial literacy. She also co-founded and supports the Afghan Girls Robotics Team. Ms. Mahboob has worked to build Innovation/Tech Centers across Afghanistan and has launched an online platform to strengthen the voices of Afghan women and journalists. Ancillary to this, she regularly speaks and writes eloquently about the vital importance of STEAM education and economic opportunity for women and girls as they pertain to human rights. Ms. Mahboob was named to TIME’s 2013 list of 100 Most Influential People and received the 2014 Tribeca Disruptive Innovation Award, The Advancement of Gender Equality through Education Award, Young Leader of World Economic Forum 2015 , Asia Game changer 2019, Doha forum award of 2022, LantosHumanRights awards, the prestigious Presidential Leadership Scholarship and is a founding Leader of The NewNow, a group of rising global leaders tackling global challenges.",
    "localImage": "avatars/mena-speakers/roya-mahboob.webp"
  },
  {
    "sequence": 174,
    "slug": "russell-okung---bitcoin",
    "name": "Russell Okung",
    "title": "Professional Athlete/Investor",
    "company": "Bitcoin",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c9096def056107a0f097_S_bGe68rrVxFgc94VBPJMi1ruOJKNvQ6QSl76GYU3n8.webp",
    "biography": "First professional athlete paid in Bitcoin.",
    "localImage": "avatars/mena-speakers/russell-okung.webp"
  },
  {
    "sequence": 175,
    "slug": "ruzbeh-kroner---21st-capital",
    "name": "Ruzbeh Kroner",
    "title": "CEO",
    "company": "21st Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68f1512aa7ee7334c28ad888_JwFkTTmnA9rdf1EriCIqdny_CBYfoC3DcnfbLwYtJPs.webp",
    "biography": "Ruzbeh is the co-founder and CEO of 21st Capital, the Gulf region’s only self-custody platform with collaborative custody and multilayer timelocks. He brings 17+ years of banking experience across Germany, the UAE, the USA, and Switzerland, spanning derivatives, payments, compliance, sales, and fundraising. Active in Bitcoin since 2017, he co-founded Bitguide, an open Bitcoin university. Ruzbeh’s work bridges institutional-grade financial rigor with the security and sovereignty of Bitcoin-native custody.",
    "localImage": "avatars/mena-speakers/ruzbeh-kroner.webp"
  },
  {
    "sequence": 176,
    "slug": "salahuddin-khawaja---hypermode",
    "name": "Salahuddin Khawaja",
    "title": "Founder",
    "company": "Hypermode",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e6a415d7acefd035c41c_mmV_qxkTyYwjMA5s38WjVPgIazHE_FMiDiIo1MR_GJI.webp",
    "biography": "Salah spent 20 years in NY running tech projects on Wall Street. Initially as a Management Consulting at Deloitte (for clients like MasterCard, CapitalOne, Citi, Lehman) and then worked in house at JP Morgan and Bank of America. At Bank of America he was Managing Director of Automation running a team of 300 people.He saw the potential of Bitcoin in 2014 and has been HODLing since.Salah started in tech early - with learning to code in high school. He then went to LUMS and got his Bachelors in Computer Science in 1997. He then got a Masters in Telecommunication and Network Management from Syracuse University in 1999.",
    "localImage": "avatars/mena-speakers/salahuddin-khawaja.webp"
  },
  {
    "sequence": 177,
    "slug": "sam-callahan---oranjebtc",
    "name": "Sam Callahan",
    "title": "Director of Bitcoin Strategy & Research",
    "company": "OranjeBTC",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dd461fc611e7a64156b13a_xWnfdMcIncqy6FrUTv-j2Zq_7fvq6npx_A118xDiBXA.webp",
    "biography": "Sam Callahan is Director of Strategy & Research at OranjeBTC, overseeing Bitcoin treasury operations and leading the firm’s research and education. He previously served as Vice President at Battery Finance and Lead Analyst at Swan Bitcoin, and he sits on the advisory boards of MARA Digital Holdings and Cantilever Advisors.",
    "localImage": "avatars/mena-speakers/sam-callahan.webp"
  },
  {
    "sequence": 178,
    "slug": "sanjay-gupta---auradine-inc",
    "name": "Sanjay Gupta",
    "title": "Chief Strategy Officer",
    "company": "Auradine, Inc.",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68cd6a03c1ae17422a3eb9bd_32de9b35cf65efc5003adee0.webp",
    "biography": "Sanjay Gupta leads Strategy, Business Development & Marketing at Auradine, a pioneer in web infrastructure solutions including AI, blockchain, and security. He has 25+ years of senior-level experience in driving the disruptive growth of global technology and financial services companies. Sanjay has a consistent track record of driving step-change growth across multi-billion-dollar organizations.",
    "localImage": "avatars/mena-speakers/sanjay-gupta.webp"
  },
  {
    "sequence": 179,
    "slug": "saqr-ereiqat---dubai-digital-asset-association",
    "name": "Saqr Ereiqat",
    "title": "Secretary General",
    "company": "Dubai Digital Asset Association",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68fa8fb078450df8b41a5195_74655e97017e989ae54d73ad.webp",
    "biography": "Saqr Mashhor Ereiqat is the Secretary General of the Dubai Digital Asset Association (D2A2), focused on driving the regulated, institutional adoption of Bitcoin and digital assets.With a 20-year career in technology, Saqr is a vital voice on how major markets develop regulatory clarity for decentralized finance.Digital Asset Achievements* Ecosystem Growth: Co-founded Crypto Oasis Ventures, a key initiative that has identified over 2,040 Web3 organizations in the UAE, demonstrating massive regional adoption.* Government Regulation: Advised in government regulation and strategy across 4 countries, including defining Dubai's government blockchain strategy and contributing to the Digital Nation Pakistan agenda.* Global Consulting Reach: Led complex consulting projects for public and private sector entities across 23 countries in Europe, the Middle East, and Africa at IBM.Saqr offers an essential, data-driven view on how state-level policy directly impacts the global growth and acceptance of Bitcoin.",
    "localImage": "avatars/mena-speakers/saqr-ereiqat.webp"
  },
  {
    "sequence": 180,
    "slug": "sarah-white---african-bitcoiners-africa-free-routing",
    "name": "Sarah White",
    "title": "General Manager",
    "company": "African Bitcoiners|Africa Free Routing",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e6a9e7f5029b72c2ca31_w8mpcMxKbBtUNqvO-U63ZOh4-TV-GQex4WrKD56UEzA.webp",
    "biography": "Sarah White is the General Manager of African Bitcoiners, a community-driven organization dedicated to advancing Bitcoin education, adoption, and innovation across Africa. She has played a pivotal role in initiatives such as Africa Free Routing, a project within African Bitcoiners, which empowers developers across Africa with hands-on training to build on Bitcoin through Lightning bootcamps, and the Africa Bitcoin Ecosystem Infographic, which provides in-depth research and insights into Bitcoin projects, communities, and infrastructure across the continent.With a background in Petroleum and Process Engineering, Sarah blends technical acumen with strategic leadership to drive impactful projects that foster inclusion, education, and real-world Bitcoin adoption. Her mission is to make Bitcoin accessible and useful to everyday Africans, helping communities achieve financial freedom and sovereignty.",
    "localImage": "avatars/mena-speakers/sarah-white.webp"
  },
  {
    "sequence": 181,
    "slug": "scott-millar---sideswap",
    "name": "Scott Millar",
    "title": "Co-founder",
    "company": "SideSwap",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6914acb75ff1f79d500e85c8_9d99c633e863e59105fc8b21.webp",
    "biography": "Scott Millar is a long-time Bitcoin advocate and entrepreneur, best known as the founder of SideSwap, a non-custodial exchange and wallet built on the Liquid Network, and BlockSettle AB, a Swedish-regulated payment institution. With a background in trading and fintech, Scott has been at the forefront of building tools for Bitcoin settlement, tokenization, and self-custody, driven by a vision of an open, interoperable financial system rooted in Bitcoin.",
    "localImage": "avatars/mena-speakers/scott-millar.webp"
  },
  {
    "sequence": 182,
    "slug": "sebastian-widmann---komainu",
    "name": "Sebastian Widmann",
    "title": "General Manager",
    "company": "Komainu",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69123cf7229d0371224564db_P5x4npIWwJkDnVGJu8G1ZkVLoGIgqYdX_UTN7NH5y80.webp",
    "biography": "Sebastian has been an advocate for Bitcoin since 2013, having conducted academic research on decentralized systems and blockchain. Sebastian currently acts as General Manager of Komainu, a regulated digital asset custodian built by institutions for institutions, that recently completed a $75m fundraise in Bitcoin. Sebastian is also a contributor for Forbes Digital Assets, where he publishes articles on Digital Assets.",
    "localImage": "avatars/mena-speakers/sebastian-widmann.webp"
  },
  {
    "sequence": 183,
    "slug": "serena-sebastiani---dawnx",
    "name": "Serena Sebastiani",
    "title": "Founder and Managing Director @DawnX, co-Chair Digital Assets @Mena Fintech Association",
    "company": "DAWNX",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6926249f0f8aa2118c5c2339_2bcc5117495aa0242cf78ee8.webp",
    "biography": "Serena Sebastiani is the founder and Managing Director of DawnX, a Management Consulting Boutique focused on Fintech, Digital Assets and the Future of Finance.She comes from 15 years of experience @ PwC, where she last led the Firm’s Digital Assets business.Ex-Regulator, Serena supports Regulatory Authorities in the Region to design their future-looking strategies and policies in the Fintech and Virtual Assets space, works with Banks and other TradFi institutions to enter the Virtual Assets space, and advises VASPs on their strategies, operations, compliance issues.Serena supports the growth of the Fintech and Web3 ecosystem in the Region by contributing to the active community of players across the value chain.She is also co-chair of the Digital Assets Committee at the Mena Fintech Association, the President for GCC countries at the Association of Women in Crypto, a mentor in acceleration programs and speaker at major industry events.",
    "localImage": "avatars/mena-speakers/serena-sebastiani.webp"
  },
  {
    "sequence": 184,
    "slug": "shalini-wood---siri-inc",
    "name": "Shalini Wood",
    "title": "Partner",
    "company": "Siri Inc",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691c838515b3593196692af3__0ImVSF1PftpYiI4UR1hnUz0mpGe0xGrACUjPwGiHN8.webp",
    "biography": "Believe in Bitcoin, freedom & positive-sum energyShalini Wood is a marketing architect with extended experience across Fortune 100, academia & Web3.Recognized by Forbes as one of the Top 5 Female Executives Building a LastingLegacy in Blockchain, she played a foundational role at Babylon as the firstmarketing hire & CMO— scaling the brand from whitepaper into a $6BillionBitcoin staking pioneer. Under her leadership, Babylon didn’t just join amovement—it created it, giving rise to BTCfi, the now-emerging category thatconnects Bitcoin with the world of DeFi.She currently serves as Founding Advisor to Satoshi Financial, GCC’s firstdedicated Bitcoin treasury platform, a pioneering initiative in institutional-grade Bitcoin treasury management. She is also Advisor & Growth Partner toBotanix (Bitcoin Layer 2), Veera (Web3 browser & wallet with 3M+ users), and an emerging Layer 1 protocol (stealth).Shalini is an angel investor and strategic contributor to high-growth projectsincluding Lombard, Lorenzo, Allo, BOB, Hetu, and others. She has also invested in a number of Digital Asset Treasuries (DATs), including BNC BNB Treasury Company, MCVT SUI Treasury, ETH Zilla Treasury, Satsuma European Bitcoin Treasury Company, TONX Treasury, and more.Previously, she spent several years as a course designer and lecturer at Utrecht University in the Netherlands — one of Europe’s top research institutions — where she co-developed courses on blockchain, decentralization, and brand futures.Earlier in her career, she led regional marketing communications for Honeywell(Fortune 100), overseeing brand, PR, and digital strategy across the EMEA region— building visibility for mission-critical technologies in logistics, retail, and industrial systems.",
    "localImage": "avatars/mena-speakers/shalini-wood.webp"
  },
  {
    "sequence": 185,
    "slug": "shanon-squires---compass-mining",
    "name": "Shanon Squires",
    "title": "Chief Mining Officer",
    "company": "Compass Mining",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c9688ff5476a446b66fea7_ihrIabptxyXd5A1H5bWmm40DrhMxbUVLV2piTtqWv7A.webp",
    "biography": "Shanon became Compass Mining’s Chief Mining Officer in December 2023, following his exceptional work as Procurement Manager. Shanon oversees all aspects of mining operations, from energy acquisition to partnerships. Since entering the Bitcoin mining space in 2017, Shanon has established himself as a prominent leader, known for his ability to navigate the complex challenges of energy acquisition, co-location strategy, and cultivating international relationships. His expertise in optimizing energy use and building sustainable, scalable mining infrastructure makes him a sought-after speaker on industry panels, where he addresses key trends in mining technology and global energy markets.",
    "localImage": "avatars/mena-speakers/shanon-squires.webp"
  },
  {
    "sequence": 186,
    "slug": "shawn-owen---salt-lending",
    "name": "Shawn Owen",
    "title": "CEO & Co-Founder",
    "company": "SALT Lending",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6920ad77782ce31fef18895a_VoLz3YVpKbyaxqXpWXPApGAz6Hf6YTxZ3ICThvWJAYU.webp",
    "biography": "Shawn Owen is a pioneering entrepreneur and CEO of SALT, the original bitcoin-backed lender. A Bitcoin advocate since 2011, Shawn believes Bitcoin is the best form of digital property and energy savings.He co-founded SALT to offer innovative Bitcoin-backed loans, raising over $124 million and establishing a leading position in the Bitcoin lending industry. With over 25 years of business experience, he is recognized for his expertise in technology, capital allocation, and fostering growth.",
    "localImage": "avatars/mena-speakers/shawn-owen.webp"
  },
  {
    "sequence": 187,
    "slug": "siddarth-bharwani---jetking",
    "name": "Siddarth  Bharwani",
    "title": "Director & CFO",
    "company": "Jetking",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae22904_oviXOGJDTakvEnmmGBbPqwt2ve-5FZY70_ng9Th-tg8.webp",
    "biography": "started as a personal investment to hedge against traditional assets class of equity and gold. having realised the depth of an asset such as bitcoin pivoted a 40 year old organisation to hold bitcoin on its balance sheet making it the first publicly listed company in India to do so. Ambition to navigate a complex regulatory market of India to bring bitcoin or associated stock to a 100M people in India.",
    "localImage": "avatars/mena-speakers/siddarth-bharwani.webp"
  },
  {
    "sequence": 188,
    "slug": "simon-gerovich---metaplanet-inc",
    "name": "Simon Gerovich",
    "title": "President",
    "company": "Metaplanet",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68d4157bb5b3ba91798c0afc_gRLOtZ1ymm-OM3npDmSX269AnYkb4TKL8tEieRhI6KA.webp",
    "biography": "Simon is the President of Metaplanet Inc., a publicly traded company listed on the Tokyo Stock Exchange. Metaplanet is undergoing a strategic transformation, leveraging Bitcoin as its principal treasury reserve asset. Metaplanet utilizes excess cash flow and implements accretive corporate governance, including financial management strategies such as debt and equity financing, to further its Bitcoin accumulation.Simon has been an active investor in the digital asset ecosystem since 2014. He started his career at Goldman Sachs in Tokyo as an equity derivatives trader. He was a co-founder and Chairman of Red Planet Hotels, a regional hotel company focused on Asia’s value hotel sector. Prior to founding Red Planet Hotels, Simon served as the Chief Executive Officer of Evolution Capital Public Company Limited, a real estate asset management company listed on the Stock Exchange of Thailand. As President of Metaplanet, Simon is responsible for spearheading the company's new Bitcoin investment strategy, guiding its overall direction, raising capital, and managing investor relations. He graduated from Harvard University with an AB in Applied Mathematics. Simon is an active member of YPO, the premier global organization of chief executives.",
    "localImage": "avatars/mena-speakers/simon-gerovich.webp"
  },
  {
    "sequence": 189,
    "slug": "sindura-saraswathi---university-of-central-florida",
    "name": "Sindura Saraswathi",
    "title": "PhD Student",
    "company": "University of Central Florida",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6911ff7f9538c5f89fe1fb7f_sSMHlUR0s92c_twhMjCHMEBzmCB4Ht3NA1zVaXcsRTk.webp",
    "biography": "Sindura Saraswathi is a PhD student at the University of Central Florida, researching Bitcoin and the Lightning Network with a focus on scalability and reliability. Her recent work includes a closed-form framework for selecting optimal threshold signatures for Bitcoin custody and an in-depth analysis of pathfinding strategies across Lightning clients.",
    "localImage": "avatars/mena-speakers/sindura-saraswathi.webp"
  },
  {
    "sequence": 190,
    "slug": "sonia-mayenco---kraken",
    "name": "Sonia Mayenco",
    "title": "Head of Compliance, RoW markets",
    "company": "Kraken",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e6a415d7acefd035c41f_5c125d258cba42670c9e5dc5.webp",
    "biography": "Sonia Mayenco is the Head of Compliance for Rest-of-the-World (RoW) markets at Kraken, one of the world’s leading cryptocurrency platforms. A lawyer by training, Sonia brings over 10 years of experience in the crypto industry, with a focus on regulatory compliance, strategic market expansion and risk management across both emerging and mature markets.Sonia began her career in Singapore, where she was a founding member of Cryptosigma (now Toast), one of the earliest Bitcoin-based remittance startups. The company was recognized as one of the top 3 startups at the Singapore Startupbootcamp FinTech accelerator program in 2015, marking an early chapter in what would become a long-standing commitment to digital finance innovation.With extensive experience across APAC and LATAM, Sonia has helped shape global compliance strategies for a wide range of crypto products, including spot and margin trading, OTC trading, derivatives and tokenized equities. Today, she plays a pivotal role in Kraken’s expansion into emerging and regulated markets, helping bridge innovation with regulatory integrity.",
    "localImage": "avatars/mena-speakers/sonia-mayenco.webp"
  },
  {
    "sequence": 191,
    "slug": "stafford-masie---africa-bitcoin-corporation",
    "name": "Stafford Masie",
    "title": "Executive Chairman & Director of Bitcoin Strategy",
    "company": "Africa Bitcoin Corporation",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691dfb547394fe38c263be3e_f6be5163b425445fccaa3d48.webp",
    "biography": "Stafford Masie is a pioneering South African technologist, entrepreneur, and futurist with over three decades at the forefront of digital innovation. His career began in the early 1990s as a software developer at South Africa’s largest telecommunications company, followed by technology leadership roles at a major technology integrator. He went on to launch his own startup, later acquired, leading him to the U.S. tech scene in 1997, where he spent seven years immersed in Silicon Valley’s ecosystem of innovation at Novell’s HQ in Utah.Upon returning to South Africa in 2004 as Managing Director of Novell Sub-Saharan Africa, Stafford later established Google’s first presence in the country in 2006, serving as its founding country manager. He later launched thumbzup that invented the Payment Pebble®, a world-first globally adopted fintech innovation backed by Visa Inc.During 2014 he was first exposed to Bitcoin, sparking a lasting fascination up until today where he is known in SA as a Bitcoin maxi.Since then, Stafford has become a leading voice and investor in the African Bitcoin and crypto ecosystem. He has angel-invested in and advised multiple AI and blockchain startups, co-founded BitMach, a Bitcoin mining venture in South Africa, and is currently launching a crypto audit and analysis platform in the United States.He served as Chairman of the Board of Altvest Capital, which has since transformed into Africa’s first Bitcoin treasury company (BTCTC) listed on the Johannesburg Stock Exchange (JSE), where he now holds the position of Executive Chairman and Director of Bitcoin Strategy.In addition to his corporate leadership, Stafford independently advises African regulatory bodies on artificial intelligence and cryptocurrency legislation. He has previously served on the boards of Discovery Bank, ADvTECH, and Chairman WITS University/Telkom Innovation Lab, among others.Widely recognized as a Bitcoin maximalist, Stafford is passionate about “orange-pilling” key stakeholders and advocating for Bitcoin as a transformative force for financial sovereignty across the African continent.",
    "localImage": "avatars/mena-speakers/stafford-masie.webp"
  },
  {
    "sequence": 192,
    "slug": "stefan-kern---bitkern-group",
    "name": "Stefan Kern",
    "title": "CEO & Founder",
    "company": "Bitkern Group",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691dd270f4ddfea0bcb33f85_-4fwLYvFRnyqVR_ysWv8UdyuwM0u4J5QP8OXJPbzcGw.webp",
    "biography": "Stefan Kern is the Founder & CEO of the Bitkern Group, a Swiss based provider of high-performance computing and Bitcoin mining infrastructure, which he established in 2017. Under his leadership, Bitkern has grown into a trusted partner for private and institutional clients, offering scalable data-center solutions, managed hosting, and hardware procurement across multiple international locations.With a strong focus on energy efficiency, operational reliability, and technological excellence, Stefan has been instrumental in shaping the standards of professional Bitcoin mining. His strategic vision emphasizes the intersection of sustainability, innovation, and digital asset infrastructure, positioning Bitkern as a key player in the global high-performance computing landscape.",
    "localImage": "avatars/mena-speakers/stefan-kern.webp"
  },
  {
    "sequence": 193,
    "slug": "stephan-livera---stephan-livera-podcast",
    "name": "Stephan Livera",
    "title": "Podcaster",
    "company": "Stephan Livera Podcast",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c968989879b14a65c97596_UPk1c-vNFg1mNZTDSEwkmODPeFWaK98bd4J9UXlLMp8.webp",
    "biography": "Bitcoin Podcaster",
    "localImage": "avatars/mena-speakers/stephan-livera.webp"
  },
  {
    "sequence": 194,
    "slug": "susie-violet-ward---bitcoin-policy-uk",
    "name": "Susie Violet Ward",
    "title": "CEO & Co-Founder",
    "company": "Bitcoin Policy UK",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6883c9096def056107a0f09a_UilFpsrppZ_F_gzzXiencWu2VRwyZ7OgnT10OVxy2WE.webp",
    "biography": "Bitcoin Journalist with a focus on education, and a financial analyst with a background in accounting, holding a deep interest in bitcoin and the environment. Working as a bitcoin columnist for a business-focused newspaper in London and authoring numerous research articles on the benefits of Bitcoin Mining and its implications for renewable energy's future. Serving as the Director and Head of Mining and Sustainability at Bitcoin Policy UK, committed to exploring and educating about bitcoin's technological innovation and potential environmental impact at the core of these professional pursuits.",
    "localImage": "avatars/mena-speakers/susie-violet-ward.webp"
  },
  {
    "sequence": 195,
    "slug": "selim-chidiac---chidiac-investments-limited",
    "name": "Sélim Chidiac",
    "title": "Director",
    "company": "Chidiac Investments Limited",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05e59cafe1c0cb58b0ec_oqCOHezWtEsF9lu1Sk_F8vLUdJY297GS2gb_Hy50zZQ.webp",
    "biography": "Sélim Chidiac is a seasoned Board Director and former global CEO who has been deeply engaged in the Bitcoin ecosystem for over five years. He has attended leading conferences across the US, Europe, and the Middle East, participated in YouTube podcasts, and dedicated hundreds of hours to studying Bitcoin through books and podcasts. Today, Sélim combines his expertise in corporate governance, international expansion, transformation, and capital markets with his passion for Bitcoin, sharing insights on its role in reshaping finance and long-term value creation. He currently serves on multiple boards and advises leaders on innovation, strategy, and disruptive technologies.",
    "localImage": "avatars/mena-speakers/s-lim-chidiac.webp"
  },
  {
    "sequence": 196,
    "slug": "teresa-goody-guillen---bakerhostetler",
    "name": "Teresa Goody Guillén",
    "title": "Partner",
    "company": "BakerHostetler",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/69274454237ee4f760a94678_vc8_qEd_9971YrYi3iPZ73IZYsQyaqvsUYJp_uD-LlQ.webp",
    "biography": "Teresa Goody Guillén launched and leads the first AmLaw100 law firm's Digital and Innovative Markets Group, designed to seamlessly integrate traditional financial markets and the rapidly evolving digital markets. She has been advising on bitcoin and altcoin legal and business matters since 2015, has held BTC since 2017, and is an investor in crypto-related projects. In conjunction with co-leading the law firm’s Web3 and Digital Assets group, her team is comprised of multidisciplinary attorneys who each have expertise in the the technical and legal aspects of both traditional financial markets and crypto. Her team provides strategic advice on bitcoin, altcoins, stablecoins, capital, commodities, and derivatives markets to to a wide range of market and ecosystem participants, , including traditional and crypto exchanges (CEX and DEX), ATSs, public and private companies, payment processors, liquidity providers, private equity firms, venture capitalists, hedge funds, ETFs, and trade associations.Teresa also serves as a advisor to crypto and AI start-ups. Her practice includes regulatory and compliance guidance, conducting investigations, defending against enforcement actions, representing clients in litigation, and advising on business and transactional matters.She is nationally recognized as a leader in crypto and securities enforcement. She is Chambers ranked for Blockchain & Crypto and named to the Securities Docket's SEC \"Enforcement Elite.\" She is recognized by The Legal500 for Dispute Resolution and Corporate Investigations and has been honored as Litigator of the Week by The AmLaw Litigation Daily. She hosts a fireside chat series Bulls, Bears, and Blockchain, serves as co-leader of The Digital Chamber's Token Alliance, and has taught Digital law & Policy at Georgetown University. In addition to her JD, she earned an MBA and is a Cryptocurrency Tracing Certified Examiner and Certified Fraud Examiner. She was formerly with the SEC's Office of the General Counsel (~15 years ago).",
    "localImage": "avatars/mena-speakers/teresa-goody-guill-n.webp"
  },
  {
    "sequence": 197,
    "slug": "theresa-morrison---blockspaces-inc",
    "name": "Theresa Morrison",
    "title": "COO, CFO",
    "company": "BlockSpaces, Inc.",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6903a7fff1deae49a495303e_RfhRERT2YoHTBQ97ekBrHcbILUUiqWyd3UWu_0UxIRU.webp",
    "biography": "Bitcoin 2017. Early team roles in swaps, derivatives, and project finance at Investec Merchant Bank, building treasury lending and structured finance desk from the ground up. Currently serving as COO/CFO to BlockSpaces, - innovating Bitcoin-native smart contract execution of collateral and risk management for institutional finance and trading/derivative markets. Advisor to Base 58, a Bitcoin protocol school for technical education. Advisory Board member of Bitcoin Arabia.",
    "localImage": "avatars/mena-speakers/theresa-morrison.webp"
  },
  {
    "sequence": 198,
    "slug": "tommy-chan---crypto-com-capital",
    "name": "Tommy Chan",
    "title": "Head of DeFi Investment",
    "company": "Crypto.com Capital",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68dd461d1eeabb7ced27ac46_56c7d2cbcdb210115ee22b80.webp",
    "biography": "Bitcoin is for holding, not selling/trading",
    "localImage": "avatars/mena-speakers/tommy-chan.webp"
  },
  {
    "sequence": 199,
    "slug": "tony-yazbeck---the-bitcoin-way",
    "name": "Tony Yazbeck",
    "title": "Founder",
    "company": "The Bitcoin Way",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae228fd_xzyog0bze1SRvFUwMQYU02Ou4RSXU2IlFdGbta0ffRQ.webp",
    "biography": "Educator at The Bitcoin Way. Bitcoin Self-Custody • Cybersecurity • Plan B Residencies.",
    "localImage": "avatars/mena-speakers/tony-yazbeck.webp"
  },
  {
    "sequence": 200,
    "slug": "tracy-hoyos-lopez---kraken",
    "name": "Tracy Hoyos-Lopez",
    "title": "Chief of Staff, Strategic Initiatives",
    "company": "Kraken",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05f41a8f3acd2ea77850_892e0f5fd2cf8434fdebd34b.webp",
    "biography": "Tracy Ann Hoyos López is a strategic force in the Bitcoin and crypto space, currently serving as Chief of Staff, Strategic Initiatives to Arjun Sethi, CEO of Kraken, one of the world’s leading digital asset platforms. With a background in law and public service, Tracy now operates at the intersection of Bitcoin, crypto, policy, and high-level business strategy.She played a pivotal role in orange-pilling President Donald Trump, directly influencing his embrace of Bitcoin and crypto during the 2024 Presidential campaign. Her leadership helped secure President Trump’s historic appearance at the Bitcoin Conference and led to a record-breaking $25 million fundraising effort in just 1.5 months. Her efforts established Bitcoin and cryptocurrency as core components of the national political conversation in the United States.Tracy’s influence extends across the industry, bridging legal expertise, political acumen, and Bitcoin and crypto advocacy. At Kraken, she leads strategic initiatives that shape the company's positioning in both U.S. and global markets. Her deep understanding of regulatory dynamics, coupled with her commitment to financial freedom and decentralization, has made her a trusted advisor, a movement builder, and a driving force behind Bitcoin and crypto’s most important political and institutional breakthroughs.",
    "localImage": "avatars/mena-speakers/tracy-hoyos-lopez.webp"
  },
  {
    "sequence": 201,
    "slug": "tristan-thompson---basketball-fun",
    "name": "Tristan Thompson",
    "title": "Co-Founder",
    "company": "Basketball.fun",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/692624a3f2873b1c941ac0f4_b6e926a71f70411d61c18dfb.webp",
    "biography": "Co-Founder, Basketball.fun | , Chief Digital Equity Officer World MobileTristan Thompson is a championship-winning athlete, entrepreneur, and emerging voice at the intersection of sports, culture, and Web3. After more than a decade in the NBA, he’s shifted his focus to building the future of digital fan engagement and athlete empowerment through technology.As Co-Founder and Lead Advisor at Basketball.fun (TEASER HERE) , Tristan is reimagining what it means to be a fan. The platform gives people the chance to own NBA moments, make live predictions, and build their fan identity through tokenized player shares and clubs, turning the energy of game night into a participatory, on-chain experience. Built on Somnia’s blockchain, Basketball.fun is fast, gasless, and simple enough for anyone to use. It bridges sports, culture, and community while using stablecoins to make rewards instant, global, and real.Beyond sports innovation, Tristan serves as Chief Advisory Officer at AxonDAO, where he’s helping redefine how people control and monetize their health and bio-data. He’s also partnered with World Mobile, a decentralized project focused on expanding internet access.Tristan’s thought leadership has been featured in Forbes, Yahoo Finance , CoinDesk, Cointelegraph, Decrypt, The Block, and on CNBC Crypto World, The Street, Fox News, Thinking Crypto, and CoinMarketCap Live, where he was the first athlete ever featured. His high-profile interviews, including with Bo Hines, reflect his growing influence across sports, crypto, and technology.He recently spoke at Korea Blockchain Week, where he discussed athlete empowerment and decentralized fandom, and is set to appear next at Binance Blockchain Week and Bitcoin MENA, continuing to champion the conversation around Web3 adoption and digital ownership.Thought leadership Op-Eds penned by Tristan:Newsweek: NBA Champion Tristan Thompson: ‘AI is the Ultimate Teammate’Entrepreneur: How Building Tech With No Tech Background Taught Me the Most Valuable Skill in BusinessCointelegraph: Blockchain is the missing trust layer in sports analytics",
    "localImage": "avatars/mena-speakers/tristan-thompson.webp"
  },
  {
    "sequence": 202,
    "slug": "tyler-evans---kindlymd-naka",
    "name": "Tyler Evans",
    "title": "CIO",
    "company": "KindlyMD ($NAKA)",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d8de96c5cb20d6ea0d0_YFMvT29Wtiwr9r0Fp34_XNPwl9Q0TPvO7NHwTqg9WdU.webp",
    "biography": "Tyler is a the Chief Investment Officer at Kindly MD ($NAKA). He's the co-founder of BTC Inc., the publisher of Bitcoin Magazine and organizer of Bitcoin 2023. He is the Chief Investment Officer and General Partner at UTXO Management, an asset management firm focused on the Bitcoin ecosystem. Tyler serves on the boards of Metaplanet, the Smarter Web Company and Matador.",
    "localImage": "avatars/mena-speakers/tyler-evans.webp"
  },
  {
    "sequence": 203,
    "slug": "walid-abou-zaki---unlock-blockchain",
    "name": "Walid Abou Zaki",
    "title": "CEO",
    "company": "Unlock Blockchain",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/690e05ee2f2a2aeac84937f4_c35ad6cda98d36a02d0e4ddb.webp",
    "biography": "Walid is the founder of Unlock Blockchain, the MENA region’s leading bilingual platform for blockchain and crypto news. He is a recognized industry voice and frequent moderator of high-level panels, connecting global perspectives with regional opportunities.",
    "localImage": "avatars/mena-speakers/walid-abou-zaki.webp"
  },
  {
    "sequence": 204,
    "slug": "weikeng-chen---l2-iterative",
    "name": "Weikeng Chen",
    "title": "Research Partner",
    "company": "L2 Iterative",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6887b630a94348bfcae22900_pJK7AIjguAIlueYxiUGr0ULW72nQCJ2i1ASxYPqOz98.webp",
    "biography": "Working on Circle STARK verifier and covenants on Bitcoin",
    "localImage": "avatars/mena-speakers/weikeng-chen.webp"
  },
  {
    "sequence": 205,
    "slug": "wright-wang---microbt",
    "name": "Wright Wang",
    "title": "Sales and Marketing Director",
    "company": "MicroBT",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/691f6d8a37fcf622a66dd520_FUanzy1fdn4RRmvniZhEecnNzi9uJ3HJ7YBeGojbqnE.webp",
    "biography": "With over two decades of technical expertise, Wright Wang joined MicroBT in 2018 and contributed to the development of two generations of ASICs. Subsequently, he transitioned from R&D to marketing and was promoted to Marketing Director in 2019. Wright possesses a profound understanding of the technical challenges faced by MicroBT’s customers and has successfully collaborated with numerous clients to achieve mutually beneficial outcomes. Under his able leadership, MicroBT has garnered recognition as a reputable brand, consistently delivering high-quality WhatsMiner products that are widely acclaimed by global customers. In 2023&2024, he was bestowed with the Outstanding Contribution Award of MicroBT, led the key client project team and won the award for outstanding team.",
    "localImage": "avatars/mena-speakers/wright-wang.webp"
  },
  {
    "sequence": 206,
    "slug": "wyatt-o-rourke---basilic-financial",
    "name": "Wyatt O'Rourke",
    "title": "Founder & CEO",
    "company": "Basilic Financial",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6891081b2844b7f85023e5d5_4HcYPnCOIgf-n4GQCaTPTXnG37kPv_3gixyd8eyv_8Q.webp",
    "biography": "My style is to blend financial savvy with a passion for Bitcoin and conservative values. I seek to offer my clients and peers with a fresh, informed perspective on wealth management. I am interested in the intersection of behavior, incentives, and markets. My thoughts are inspired by the works of Srinivasan, Booth, Alden and many more. My values stem from my Christian faith. My hobbies, marriage, and involvement in communities keep me inspired. To stay active, I enjoy skiing, golfing, camping and hunting. #1 YIMBY and urbanist.Founding member and Chief Marketing officer of the Space. Founder of Basilic Financial, a Bitcoin Wealth Management Firm.",
    "localImage": "avatars/mena-speakers/wyatt-o-rourke.webp"
  },
  {
    "sequence": 207,
    "slug": "xiaohui-liu---opcat-labs",
    "name": "Xiaohui Liu",
    "title": "CEO",
    "company": "OPCAT Labs",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa286d83ee45cd6493fe_NRsKZjoNIzMDP1mtGfaiMvljqBzx0YmnF-mdaL5zZ5g.webp",
    "biography": "Xiaohui Liu is the founder and CEO of OP_CAT Labs, a R&D company focused on OP_CAT technology on Bitcoin. He created sCrypt, a high-level smart contract language for Bitcoin. He also created the CAT protocol, the first miner-validated token standard on Bitcoin using OP_CAT. Before creating sCrypt, he worked as a research scientist at Facebook’s Connectivity Lab. Xiaohui holds a Ph.D. in Computer Science on p2p distributed networking.",
    "localImage": "avatars/mena-speakers/xiaohui-liu.webp"
  },
  {
    "sequence": 208,
    "slug": "yat-siu---animoca-brands",
    "name": "Yat Siu",
    "title": "Co-Founder & Executive Chairman",
    "company": "Animoca Brands",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa3c37b3fe8f53b83c9e_8xhvDGv8wkmTEfFDvG-Mi1IJe5uVYxEkE83yIekB4tQ.webp",
    "biography": "Yat Siu, Co-Founder and Executive Chairman, Animoca BrandsVeteran technology entrepreneur/investor Yat Siu is the co-founder and executive chairman of Animoca Brands, a global leader in Web3, blockchain, gaming, and tokenization with the goal to provide all users with property rights for virtual assets. Yat began his career at Atari Germany, then established Hong Kong Cybercity/Freenation, the first free web page and email provider in Asia. In 1998 he set up Outblaze, an award-winning pioneer of multilingual white label web services. After selling one of its business units to IBM, he pivoted Outblaze to incubate digital entertainment projects. One of those projects is Animoca Brands.Yat has numerous accolades, including Global Leader of Tomorrow at the World Economic Forum, Young Entrepreneur of the Year at the DHL/SCMP Awards, and recognition as one of Cointelegraph's top 100 notable people in blockchain. A classically trained musician, Yat is a member of the advisory board of BAFTA (British Academy of Film and Television Arts) and a director of the Asian Youth Orchestra.",
    "localImage": "avatars/mena-speakers/yat-siu.webp"
  },
  {
    "sequence": 209,
    "slug": "yoni-assia---etoro",
    "name": "Yoni Assia",
    "title": "Founder and CEO",
    "company": "eToro",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68c435d6e61894f2d26e9fc3_6cc8196b47653f922f48f395.webp",
    "biography": "Yoni Assia is the Co-Founder and CEO of eToro, the trading and investing platform. Yoni co-founded eToro in 2007 with the vision of a world where everyone can trade and invest in a simple and transparent way. Today, the platform has over 40 million registered users from 75 countries and empowers users to trade, invest, share and learn.Yoni showed an interest in finance and computer science from his youth and so decided to merge his passions and his belief in the power of shared knowledge by founding eToro. eToro is a collaborative investment community designed to provide users with the tools they need to grow their knowledge and wealth. Users can hold a range of traditional and innovative assets and choose how to invest: trade directly, invest in a portfolio, or copy other investors.Yoni is widely acknowledged as a crypto pioneer, having co-written the Colored Coins whitepaper with Ethereum creator Vitalik Buterin in 2012. He is also the founder of GoodDollar, the largest, community-driven blockchain UBI project in the world.Yoni is a member of the YPO and was included by Financial News in its Fintech 40 ranking and their Rising Stars in Asset Management ranking. He was also listed in Fortune’s 40 under 40 and in City A.M’s fintech 100 top influencers.",
    "localImage": "avatars/mena-speakers/yoni-assia.webp"
  },
  {
    "sequence": 210,
    "slug": "ziya-sadr---liana-wallet",
    "name": "Ziya Sadr",
    "title": "Product and Community",
    "company": "Liana wallet",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/6908e652939468477fb81e04_b871783c48a22051856d8a70.webp",
    "biography": "Bitcoin educator, security specialist.",
    "localImage": "avatars/mena-speakers/ziya-sadr.webp"
  },
  {
    "sequence": 211,
    "slug": "zuby---team-zuby-media",
    "name": "Zuby",
    "title": "Musician, Author, Speaker, Host of 'Real Talk with Zuby'",
    "company": "Team Zuby Media",
    "imageUrl": "https://cdn.prod.website-files.com/687f979126432c8ce843e6d7/68ffaa237cfeb026b10e7562_811758227b93ea70e962ef70.webp",
    "biography": "Zuby is more than just a rapper. He is an influential public figure, creative entrepreneur, and avid bitcoin supporter. His unique perspective, authenticity, and infectious energy have earned him millions of followers on social media, and millions of downloads of his 'Real Talk with Zuby' podcast. He credits bitcoin with helping him preserve his sovereignty as an independent creator.",
    "localImage": "avatars/mena-speakers/zuby.webp"
  }
]